Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1204][field_questions][11][answer
source: <p><a name="sslstrip"></a> HTTPS Everywhere, like the <a href="http://www.w3.org/Security/wiki/Strict_Transport_Security">HSTS protocol</a>, tries to address an attack called <a href="http://www.thoughtcrime.org/software/sslstrip/">SSL stripping</a>. Users are only protected against the SSL stripping attack if their browsers don't even <em>try</em> to connect to the HTTP version of the site — even if the site would have redirected them to the HTTPS version. With HTTPS Everywhere, the browser won't even attempt the insecure HTTP connection, even if that's what you ask it to do. (Note that HTTPS Everywhere currently does not include a comprehensive list of such sites, which are mainly financial institutions.)</p>
tr: <p><a name="sslstrip"></a>HTTPS Everywhere, <a href="http://www.w3.org/Security/wiki/Strict_Transport_Security">HSTS protokolü</a> gibi, <a href="http://www.thoughtcrime.org/software/sslstrip/">SSL stripping</a> isimli bir saldırıyı engellemeye çalışır. Kullanıcıların internet tarayıcılarının <em>bir siteye HTTP protokolüyle bağlanmayı denemesi bile</em> -bağlantı daha sonra HTTPS'e aktarılsa dahi- kullanıcıyı SSL stripping saldırısına karşı korumasız bırakır. HTTPS Everywhere kullanırsanız, siz isteseniz bile internet tarayıcınız güvensiz olan HTTP bağlantısına bağlanmayı denemez (HTTPS Everywhere'in şu an için bu tarzda siteleri içine alan (ki bunlar genellikle finansal kuruluşlardır) bir liste içermediğini dikkate alın).</p>

# 1204][field_questions][12][question
source: What do the different colors for rulesets in the toolbar menu mean?
tr: Araç çubuğundaki kural setleri (rulesets) için olan farklı renkler ne anlama geliyor?

# 1204][field_questions][12][answer
source: <p></p><a name="colors"></a><p>The colors are:</p><p>Dark Green: ruleset was active in loading the resources in the current page.</p><p>Light Green: ruleset was ready to prevent HTTP loads in the current page, but everything that the ruleset would have covered was loaded over HTTPS anyway (in the code, light green is called a "moot rule").</p><p>Dark Brown or Clockwise Red Arrow: broken rule -- the ruleset is active but the server is redirecting at least some URLs back from HTTPS to HTTP.</p><p>Gray: the ruleset is disabled.</p>
tr: <p> </p><p></p><a name="colors"></a><p>Renkler:</p><p>Koyu Yeşil: mevcut sayfadaki kaynakları yüklerken kuralseti aktifleştirildi.</p><p>Açık Yeşil: kuralseti mevcut sayfada HTTP üzerinden gelecek verileri engellemeye hazırdı, ancak tüm veriler HTTPS üzerinden taşındığı için buna gerek kalmadı (kodun içinde, açık yeşile "moot rule" denir).</p><p>Koyu Kahverengi ya da Saat Yönünde Kırmızı Ok: kırılmış kural -- kuralseti aktif ancak sunucu en azından birkaç URL'i HTTPS'ten HTTP'ye yönlendiriyor.</p><p>Gri: kuralseti devre dışı bırakıldı.</p>

# 1204][field_questions][13][question
source: I'm having a problem installing the browser extension.
tr: Tarayıcı eklentisini yüklemekte problem yaşıyorum.

# 1204][field_questions][13][answer
source: <p><a name="problems-installing"></a> Some people report that installing HTTPS Everywhere gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast anti-virus, which blocks installation of browser extensions. You may be able to <a href="https://addons.mozilla.org/en-US/firefox/addon/https-everywhere/">install from addons.mozilla.org instead</a>.</p>
tr: <p><a name="problems-installing"></a>Bazı kişiler HTTPS Everywhere'i yüklemenin onlara "The addon could not be downloaded because of a connection failure on www.eff.org." hatası verdiğini belirttiler. Bu soruna tarayıcı eklentilerinin kurulmasını engelleyen Avast anti-virus uygulaması sebep olabilir. Eklentiyi <a href="https://addons.mozilla.org/en-US/firefox/addon/https-everywhere/">addons.mozilla.org</a> adresinden kurmak bu sorunu çözebilir.</p>

# 1204][field_questions][14][question
source: How do I add my own site to HTTPS Everywhere?
tr: Kendi sitemi HTTPS Everywhere'e nasıl eklerim?

# 1204][field_questions][14][answer
source: We're excited that you want your site in HTTPS Everywhere! However, remember that not everyone who visits your site has our extension installed. If you run a web site, you can make it default to HTTPS for everyone, not just HTTPS Everywhere users. And it's less work! The steps you should take, in order, are: <ol><li>Set up a <a href="https://www.sslshopper.com/apache-redirect-http-to-https.html">redirect</a> from HTTP to HTTPS on your site.</li> <li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html">Add the Strict-Transport-Security (HSTS) header on your site</a>.</li> <li><a href="https://hstspreload.appspot.com/">Add your site to the HSTS Preload list</a>.</li> </ol> These steps will give your site much better protection that adding it to HTTPS Everywhere. Generally speaking, once you are done, there is no need to add your site to HTTPS Everywhere. However, if you would still like to, please follow the <a href="https://eff.org/https-everywhere/rulesets">instructions on writing rulesets</a>, and indicate that you are the author of the web site when you submit your pull request.
tr: Sitenizi HTTPS Everywhere'e ekleme isteğiniz bizi mutlu etti! Ancak, sitenizi ziyaret eden herkesin eklentimizi kullanmadığını unutmayın. Eğer bir web sitesi çalıştırıyorsanız, HTTPS'i sadece HTTPS Everywhere kullanıcıları için değil, herkes için varsayılan yapabilirsiniz. Ve bunu yapmak daha kolaydır! Bunu yapmak için gerçekleştirmeniz gereken adımlar sırasıyla şöyledir: <ol><ol><li>Sitenize HTTP'den HTTPS'e bir <a href="https://www.sslshopper.com/apache-redirect-http-to-https.html">yönlendirme</a> kurun.</li> <li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html">Strict-Transport-Security (HSTS) üst bilgisini (header) sitenize ekleyin.</a></li> </ol></ol><ol><ol><li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html"></a><a href="https://hstspreload.appspot.com/">Sitenizi HSTS preload listesine ekleyin.</a></li> </ol></ol><a href="https://hstspreload.appspot.com/">Bu adımları uygulayarak sitenizde HTTPS Everywhere'in sağlayacağı korumadan daha fazlasını elde edersiniz. Genel olarak, bu adımları tamamladığınızda, sitenizi HTTPS Everywhere'e eklemenin bir anlamı yoktur. Ancak, sitenizi yine de HTTPS Everywhere'e eklemek isterseniz, lütfen </a><a href="https://eff.org/https-everywhere/rulesets">kuralsetlerini yazma talimatlarını</a> takip edin ve pull request'ini yaratırken eklediğiniz sitenin sahibi olduğunuzu belirtin.

# 1204][title_field][0][value
source: HTTPS Everywhere FAQ
tr: HTTPS Everywhere SSS

# 1205][body][0][value
source: <p>HTTPS Everywhere is produced as a collaboration between <a href="https://www.torproject.org">The Tor Project</a> and the <a href="https://eff.org/">Electronic Frontier Foundation</a>. Many sites on the web offer some limited support for encryption over <a href="https://en.wikipedia.org/wiki/HTTP_Secure">HTTPS</a>, but make it difficult to use. For instance, they may default to unencrypted HTTP, or fill encrypted pages with links that go back to the unencrypted site. The HTTPS Everywhere extension fixes these problems by using <a href="https://www.xkcd.com/208">clever technology</a> to rewrite requests to these sites to HTTPS. Information about how to access the project's Git repository and get involved in development is <a href="/https-everywhere/development">here</a>.</p><p><strong>Webmasters and prospective contributors:</strong> Check the <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> to quickly see how existing HTTPS Everywhere rules affect sites you care about! HTTPS Everywhere is governed by EFF's <a href="https://www.eff.org/code/privacy">Privacy Policy for Software</a>.</p><p><a name="problems-installing"></a> <strong>Problems Installing: </strong>Some people report that installing HTTPS Everywhere gives them the error: "The addon could not be downloaded because of a connection failure on <span class="moz-txt-link-abbreviated">www.eff.org</span>." <a href="https://kittens.eff.org/https-everywhere/faq#problems-installing">See this FAQ entry for help</a>.</p><p><a href="#" id="https-everywhere-more">Read More About HTTPS Everywhere »</a></p><div id="https-everywhere-hidden"><h2>Questions and Caveats</h2><p>Sadly, many sites still include a lot of content from third party domains that is not available over HTTPS. As always, if the browser's lock icon <a href="https://www.eff.org/https-everywhere/faq#mixed-content">is broken or carries an exclamation mark</a>, you may remain vulnerable to some adversaries that use active attacks or traffic analysis. However, the effort that would be required to eavesdrop on your browsing should still be usefully increased. <strong>Update: in recent versions of Firefox, Mozilla has removed the broken padlock indicator. Now, the only difference between a secure and insecure HTTPS deployment is the blue or green tint on the left of the address bar for secure deployments</strong> Answers to common questions may be on the <a href="/https-everywhere/faq/">frequently asked questions</a> page. <strong>HTTPS Everywhere can protect you only when you're using sites that support HTTPS and for which HTTPS Everywhere include a <a href="/https-everywhere/rulesets">ruleset</a>.</strong> If sites you use don't support HTTPS, ask the site operators to add it; only the site operator is able to enable HTTPS. There is more information and instruction on how server operators can do that in the EFF article <a href="/pages/how-deploy-https-correctly">How to Deploy HTTPS Correctly</a>.</p><h2>Development And Writing your own Rulesets</h2><p><strong>Webmasters and prospective contributors:</strong> Check the <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> to quickly see how existing HTTPS Everywhere rules affect sites you care about! You can help us test forthcoming site support and new features by installing the <a href="/files/https-everywhere-devel.xpi">development branch</a> of the extension. HTTPS Everywhere uses small ruleset files to define which domains are redirected to https, and how. If you'd like to write your own ruleset, you can find out how to do that <a href="/https-everywhere/rulesets">here</a>. Information about how to access the project's Git repository and get involved in development is <a href="/https-everywhere/development">here</a>. Send feedback on this project to the <tt>https-everywhere AT eff.org</tt> mailing list. Note that this is a public and publicly-archived mailing list. You can also <a href="https://lists.eff.org/mailman/listinfo/https-everywhere">subscribe</a>. Send new rewrite rules or fixes to existing rewrite rules to the <tt>https-everywhere-rules AT eff.org</tt> mailing list. Note that this is a public and publicly-archived mailing list. You can also <a href="https://lists.eff.org/mailman/listinfo/https-everywhere-rules">subscribe</a>.</p></div>
tr: <p>HTTPS Everywhere, <a href="https://www.torproject.org">Tor Project</a> ve <a href="https://eff.org">Electronic Frontier Foundation</a>'ın ortaklaşa çalışmasıyla ortaya çıkmış bir projedir. İnternetteki birçok site sınırlı bir şekilde <a href="https://en.wikipedia.org/wiki/HTTP_Secure">HTTPS</a> üzerinden şifreleme desteği sunar, ancak bu desteği kullanmayı zorlaştırırlar. Örneğin, bağlantıyı varsayılan olarak HTTP üzerinden kabul edebilirler ya da şifrelenmiş sayfaları sizi sifrelenmemiş sayfalara götürecek bağlantılarla doldurabilirler. HTTPS Everywhere eklentisi, bu problemi <a href="https://www.xkcd.com/208">akıllı teknoloji</a>yle istekleri HTTPS üzerine yazarak çözer. Sitenin git deposuna (repository) ulaşmak ve projenin geliştirilmesiyle alakalı bilgi almak istiyorsanız <a href="/https-everywhere/development">bağlantıyı</a> takip edin.</p> <p><strong>Webmasterlar ve katkıda bulunmak isteyenler:</strong> HTTPS Everywhere kurallarının ilgilendiğiniz siteleri nasıl etkilediğini hızlıca görmek için <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a>'a göz atın! HTTPS Everywhere, EFF'in <a href="https://www.eff.org/code/privacy">Privacy Policy for Software</a> (Yazılım için Gizlilik İlkesi) ile idare edilir.</p> <p><a name="problems-installing"></a><strong>Yüklemede yaşanacak sorunlar:</strong> Bazı kişiler HTTPS Everywhere'i kurarken "The addon could not be downloaded because of a connection failure on <span class="moz-txt-link-abbreviated">www.eff.org</span>." şeklinde bir hatayla karşılaştıklarını belirttiler. Yardım için <a href="https://kittens.eff.org/https-everywhere/faq#problems-installing">linkteki SSS sayfası</a>nı ziyaret edin.</p> <p><a href="#" id="https-everywhere-more"> HTTPS Everywhere'le İlgili Ek Bilgiler »</a></p> <div id="https-everywhere-hidden"><h2>Sorular ve Uyarılar</h2> <p> Maalesef birçok site halen HTTPS kullanmayan üçüncü parti sitelerden içerik bulundurmaktadır. Her zaman olduğu gibi, eğer tarayıcınızın kilit ikonu <a href="https://www.eff.org/https-everywhere/faq#mixed-content">kırık ya da bir ünlem işaretine sahipse</a>, bu bazı düşmanların aktif saldırılarına ya da internet trafiği analizlerine maruz kaldığınız anlamına gelebilir. Ancak, bu şekilde HTTPS kullanılması bile saldırganların tarayıcınızı izlemek için göstermeleri gereken çabayı arttırır. <strong>Güncelleme: Firefox'un güncel sürümlerinde, Mozilla kırık kilit göstergesini kaldırmıştır. Şu anda güvenli ve güvensiz HTTPS bağlantısı arasındaki tek fark, adres çubuğunuzun sol kısmındaki mavi ya da yeşil renktir.</strong> Yaygın soruların cevaplarını <a href="/https-everywhere/faq/">sıkça sorulan sorular</a> sayfasında bulabilirsiniz. <strong>HTTPS Everywhere sizi yalnızca HTTPS kullanan ve HTTPS Everywhere'in <a href="/https-everywhere/rulesets">kural setlerine</a> dahil olan sitelere karşı korur.</strong> Eğer kullandığınız sitenin HTTPS desteği yoksa, site yöneticilerine bu desteği eklemeleri için yazın. Yalnızca site yöneticilerinin HTTPS desteğini verme yetkisi vardır. Sunucu operatörlerinin bu desteği nasıl verebilecekleriyle ilgili bilgiler ve talimatlar, EFF'in hazırladığı <a href="/pages/how-deploy-https-correctly">How to Deploy HTTPS Correctly</a> isimli makalede bulunabilir.</p> <h2>Kendi Kural Setlerinizi Yazmak ve Geliştirmek</h2><p><strong>Webmasterlar ve katkıda bulunmak isteyenler:</strong>HTTPS Everywhere kurallarının ilgilendiğiniz siteleri nasıl etkilediğini hızlıca görmek için <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a>'a göz atın! Gelecek site desteğini ve yeni özellikleri eklentinin <a href="/files/https-everywhere-devel.xpi"> development branch</a>'ini yükleyerek test edebilir ve bize yardım edebilirsiniz. HTTPS Everywhere hangi adreslerin HTTPS'e yönlenlendirildiğini ve nasıl yönlendirildiklerini belirlemek için küçük kural seti dosyaları kullanır. Kendi kural setinizi yazmak istiyorsanız, <a href="/https-everywhere/rulesets">bu sayfaya</a> göz atın. Projenin git deposuna ulaşmak ve projenin geliştirilmesine katkıda bulunmak istiyorsanız <a href="/https-everywhere/development">development</a> sayfasına bakın. Projeyle ilgili geribildirimlerinizi <tt> https-everywhere AT eff.org</tt> adresindeki eposta listesine gönderin. Bu eposta listesinin herkese açık olduğunu ve herkese açık bir şekilde arşivlendirildiğini unutmayın. Ayrıca bu listeye <a href="https://lists.eff.org/mailman/listinfo/https-everywhere"> üye de olabilirsiniz</a>. Yeni yeniden yazılmış kuralları ya da varolan kurallar üzerindeki düzeltmeleri <tt> https-everywhere-rules AT eff.org</tt> adresindeki eposta listesine gönderin. Bu eposta listesinin herkese açık olduğunu ve herkese açık bir şekilde arşivlendirildiğini unutmayın. Ayrıca bu listeye <a href="https://lists.eff.org/mailman/listinfo/https-everywhere"> üye de olabilirsiniz</a>.</p></div>
