Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1207][body][0][summary
source: <h3>Which apps and tools actually keep your messages safe?</h3> <div class="section"> In the face of widespread Internet surveillance, we need a secure and practical means of talking to each other from our phones and computers. Many companies offer “secure messaging” products—but are these systems actually secure? We decided to find out, in the first phase of a new EFF Campaign for Secure &amp; Usable Crypto. This scorecard represents only the first phase of the campaign. In later phases, we are planning to offer closer examinations of the usability and security of the tools that score the highest here. As such, <span style="text-decoration: underline;">the results in the scorecard below should not be read as endorsements of individual tools or guarantees of their security</span>; they are merely indications that the projects are on the right track. For practical advice and tutorials on how to protect your online communication against surveillance, check out EFF's <a href="https://ssd.eff.org/">Surveillance Self-Defense</a> guide. </div>
tr: <h3>Hangi uygulamalar ve araçlar mesajlarınızı gerçekten güvende tutuyor?</h3> <div class="section"> Yaygın internet gözetimiyle karşılaştığımız bugünlerde, bilgisayarlarımız ve telefonlarımız aracılığıyla birbirimizle konuşabilmek için güvenli ve pratik yöntemlere ihtiyacımız var. Birçok firma "güvenli mesajlaşma" ürünleri sunuyor, ancak bu ürünler gerçekten güvenli mi? EFF'in Güvenli &amp; Kullanılabilir Kripto kampanyasının ilk adımı olarak bu soruya cevap bulmaya çalıştık. Bu karne kampanyanın sadece ilk aşamasını temsil ediyor. Daha sonraki aşamalarda, bu karneden yüksek not almış araçların güvenliğini ve kullanılabilirliğini daha yakından incelemeyi planlıyoruz. Bu yüzden, <span style="text-decoration: underline;">aşağıda yer alan karnedeki sonuçlar tekil araçların onaylandığı ya da güvenliklerinin garantilendiği şeklinde algılanmamalıdır</span>; aşağıdaki liste sadece bu araçların doğru yolda olduklarının bir göstergesidir. Çevrimiçi haberleşmelerinizi nasıl koruyabileceğinizle alakalı pratik ipuçları ve öğreticiler için EFF'in hazırladığı <a href="https://ssd.eff.org/">Gözetim Meşru Müdafaa</a> rehberine göz atabilirsiniz. </div>

# 1207][title_field][0][value
source: Secure Messaging Scorecard
tr: Güvenli Mesajlaşma Karnesi

# 1208][field_questions][0][question
source: What is Privacy Badger?
tr: Privacy Badger nedir?

# 1208][field_questions][0][answer
source: <a id="what_is_privacy_badger"></a>Privacy Badger is a browser add-on that stops advertisers and other third-party trackers from secretly tracking where you go and what pages you look at on the web. If an advertiser seems to be tracking you across multiple websites without your permission, Privacy Badger automatically blocks that advertiser from loading any more content in your browser. To the advertiser, it's like you suddenly disappeared.
tr: <a id="what_is_privacy_badger"></a>Privacy Badger, nereye gittiğinizi ve hangi siteleri dolaştığınızı gizlice takip eden reklamverenleri ve diğer üçüncü taraf takipçileri engelleyen bir tarayıcı eklentisidir. Eğer bir reklamveren izniniz olmadan sizi farklı web siteler üzerinden takip ediyorsa, Privacy Badger bu reklamverenin tarayıcınıza içerik yüklemesini otomatik olarak engeller. Reklamveren için birden ortadan kaybolmuş gibi olursunuz.

# 1208][field_questions][1][question
source: How is Privacy Badger different to Disconnect, Adblock Plus, Ghostery, and other blocking extensions?
tr: Privacy Badger’ın Disconnect, Adblock Plus, Ghostery ya da diğer engelleyici eklentilerden farkı nedir?

# 1208][field_questions][1][answer
source: <a id="how_is_it_different"></a>Privacy Badger was born out of our desire to be able to recommend a single extension that would automatically analyze and block any tracker or ad that violated the principle of user consent; which could function well without any settings, knowledge, or configuration by the user; which is produced by an organization that is unambiguously working for its users rather than for advertisers; and which uses algorithmic methods to decide what is and isn't tracking. Although we like Disconnect, Adblock Plus, Ghostery and similar products (in fact Privacy Badger is based on the ABP code!), none of them are exactly what we were looking for. In our testing, all of them required some custom configuration to block non-consensual trackers. Several of these extensions have business models that we weren't entirely comfortable with. And EFF hopes that by developing rigorous algorithmic and policy methods for detecting and preventing non-consensual tracking, we'll produce a codebase that could in fact be adopted by those other extensions, or by mainstream browsers, to give users maximal control over who does and doesn't get to know what they do online.
tr: <a id="how_is_it_different"></a> Privacy Badger, kullanıcı izni prensibini ihlal etmiş takipçileri ya da reklamları otomatik bir şekilde analiz eden, ayarsız, ek bilgi gerektirmeyen ya da ince ayar yapılmadan kullanılabilecek, açık bir şekilde reklamcılardan ziyade kullanıcılar için çalışan bir organizasyon tarafından yaratılmış ve nelerin takip edip, nelerin takip etmediğini algoritmik yöntemler kullanarak algılayan, tek bir eklentiyi tavsiye etme ihtiyacından doğmuş olan bir eklentidir. Disconnect, Adblock Plus, Ghostery ve diğer benzer ürünler hoşumuza gitse de (hatta Privacy Badger, ABP kodunu temel alıyor!), bu ürünlerden hiçbiri tam olarak aradığımız şey değil. Bu araçların hepsi yaptığımız testlerde rızai olmayan takipçileri engellemek için özel yapılandırmalar gerektirdi. Ayrıca bu eklentilerin birkaçı tam olarak tatmin olmadığımız iş modellerine sahip. EFF, rızai olmayan takipçileri belirlemek ve engellemek için titiz algoritmik ve politika yöntemleri geliştirerek, diğer eklentiler veya yaygın tarayıcılar tarafından da benimsenmiş bir kod temeli yaratmayı ve kullanıcılara çevrimiçi aktivitelerini kimin görüp, kimin göremeyeceği konusunda maksimum kontrol sağlamayı umuyor.

# 1208][field_questions][2][question
source: How does Privacy Badger work?
tr: Privacy Badger nasıl çalışır?

# 1208][field_questions][2][answer
source: <a id="how_does_it_work"></a>When you view a webpage, that page will often be made up of content from many different sources. (For example, a news webpage might load the actual article from the news company, ads from an ad company, and the comments section from a different company that's been contracted out to provide that service.) Privacy Badger keeps track of all of this. If as you browse the web, the same source seems to be tracking your browser across different websites, then Privacy Badger springs into action, telling your browser not to load any more content from that source. And when your browser stops loading content from a source, that source can no longer track you. Voila! At a more technical level, Privacy Badger keeps note of the "third party" domains that embed images, scripts and advertising in the pages you visit. If a third party server appears to be tracking you without permission, by using uniquely identifying cookies (and, as of version 1.0, local storage super cookies and canvas fingerprinting as well) to collect a record of the pages you visit across multiple sites, Privacy Badger will automatically disallow content from that third party tracker. In some cases a third-party domain provides some important aspect of a page's functionality, such as embedded maps, images, or stylesheets. In those cases Privacy Badger will allow connections to the third party but will screen out its tracking cookies and referrers. <p align="right">[<a href="#top">top</a>]</p>
tr: <a id="how_does_it_work"></a>Bir web sitesini görüntülediğinizde, o site genellikle birçok farklı kaynaktan içerik toplayarak oluşturulur. (Örneğin bir haber sitesi haber metnini bir haber kaynağından, reklamları bir reklam şirketinden ve yorum bölümünü de o servisi sağlamak amacıyla anlaşılmış başka bir şirketten yükleyebilir.) Privacy Badger tüm bunları takip eder. Eğer siz internette dolaşırken bir kaynak sizi başka sitelerde de takip ediyorsa, Privacy Badger devreye girer ve tarayıcınıza o kaynaktan bir daha bir şey yüklememesini söyler. Ve tarayıcınız bir kaynaktan içerik yüklemeyi keserse, o kaynak artık sizi takip edemez. İşte bu kadar! İşin teknik detayına inecek olursak, Privacy Badger ziyaret ettiğiniz sitelere fotoğraf, script ya da reklam koyan “üçüncü taraf” alan adlarının notunu tutar. Eğer üçüncü taraf bir sunucu izniniz olmadan tanımlayıcı çerezler kullanarak ziyaret ettiğiniz sitelerin kaydını farklı siteler boyunca tutuyor görüntüsünü veriyorsa, Privacy Badger o üçüncü taraf takipçiden gelen içeriği otomatik olarak yasaklar. Bazı durumlarda bir üçüncü taraf alan adı, bir sitenin fonksiyonelliği için kritik olan yerleştirilmiş haritaları, görüntüleri ya da stil sayfalarını içerebilir. Bu gibi durumlarda Privacy Badger üçüncü taraflara izin verir ancak tarayıcı çerezleri ve referrer’ları filtreler. <p align="right">[<a href="#top">yukarı</a>]</p>

# 1208][field_questions][3][question
source: What is a third party tracker?
tr: Üçüncü taraf takipçi nedir?

# 1208][field_questions][3][answer
source: <a id="trackers"></a>When you visit a webpage parts of the page may come from domains and servers other than the one you asked to visit. This is an essential feature of <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>, but it has also come to be a serious privacy problem. On the modern Web, embedded images and code often use cookies and other methods to track your browsing habits — often to display advertisements. The domains that do this are called "third party trackers", and you can read more about how they work <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">here</a>.
tr: <a id="trackers"></a>Bir web sitesini ziyaret ettiğinizde, o sitenin bir bölümü ziyaret etmek istediğiniz sunucular ve alan adlarına ait olmayan yerlerden gelebilir. Bu <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>‘in esas özelliklerinden biridir ama bu özellik aynı zamanda ciddi bir gizlilik problemi yaratmaya başlamıştır. Modern Web’de, yerleştirilmiş görüntüler ve kodlar genellikle internet alışkanlıklarınızı takip eden çerezleri ve diğer yöntemleri kullanır. Bu genellikle reklam gösterme amacıyla yapılır. Bunu yapan alan adlarına “üçüncü taraf takipçi” (third party tracker) denir ve <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">buraya</a> tıklayarak bu takipçilerin nasıl çalıştığı hakkında daha fazla bilgi edinebilirsiniz.

# 1208][field_questions][4][question
source: What do the red, yellow and green sliders in the Privacy Badger menu mean?
tr: Privacy Badger menüsündeki kırmızı, sarı ve yeşil kaydırıcılar ne anlama geliyor?

# 1208][field_questions][4][answer
source: <a id="what_do_the_colors_mean"></a>The colors mean the following: <ul><li>Green means there's a third party domain, but it hasn't yet been observed tracking you across multiple sites, so it might be unobjectionable. When you first install Privacy Badger every domain will be in this green state but as you browse, domains will quickly be classified as trackers.</li> <li>Yellow means that the third party domain appears to be trying to track you, but it is on Privacy Badger's cookie-blocking "yellowlist" of third party domains that, when analyzed, seemed to be necessary for Web functionality. In that case, Privacy Badger will load content from the domain but will try to screen out third party cookies and referrers from it.</li> <li>Red means that content from this third party tracker has been completely disallowed.</li> </ul> Privacy Badger analyzes each third party's behavior over time, and picks what it thinks is the right setting for each domain, but you can adjust the sliders if you wish.
tr: <a id="what_do_the_colors_mean"></a>Renkler şu anlama geliyor: <ul><li>Yeşil renk üçüncü taraf bir alan adının olduğunu, ancak bu alan adının sizi henüz diğer sitelerde takip etmediğini, yani sakıncasız olabileceğini gösterir. Privacy Badger’ı ilk kez kurduğunuzda tüm alan adları yeşil renge sahiptir, ancak internette dolaştıkça bu alan adları hızlıca takipçi olarak sınıflandırılırlar.</li> <li>Sarı renk bir üçüncü taraf alan adının sizi izlemeye çalıştığını, ancak bu alan adının Privacy Badger’ın çerez-engelleyen üçüncü taraf alan adlarının “sarı listesinde” olduğunu, yani analiz edildiğinde sayfanın fonksiyonelliği için gerekli olduğunu gösterir. Bu durumda Privacy Badger alan adlarından içeriği yükler ancak buralardan gelen üçüncü taraf çerezleri ve referrer’ları filtreler.</li> <li>Kırmızı renk üçüncü taraf takipçiden gelen içeriğin tümünün yasaklandığı anlamına gelir.</li> </ul> Privacy Badger üçüncü tarafların davranışlarını zamanla analiz eder ve her alan adı için hangi ayarın doğru olduğunu seçer. Eğer isterseniz kaydırıcıları oynatarak bu ayarları kendiniz de yapabilirsiniz.

# 1208][field_questions][5][question
source: Why does Privacy Badger block ads?
tr: Privacy Badger reklamları neden engelliyor?

# 1208][field_questions][5][answer
source: <a id="why_does_privacy_badger_block_ads"></a>Actually, nothing in the Privacy Badger code is specifically written to block ads. Rather, it focuses on disallowing any visible or invisible "third party" scripts or images that appear to be tracking you even though you specifically denied consent by sending a Do Not Track header. It just so happens that most (but not all) of these third party trackers are advertisements. When you see an ad, the ad sees you, and can track you. Privacy Badger is here to stop that.
tr: <a id="why_does_privacy_badger_block_ads"></a>Esasında Privacy Badger’ın kodunda reklamları engellemek için özellikle yazılmış bir bölüm yoktur. Privacy Badger bunun yerine Do Not Track ayarınızı görmezden gelerek isteğinize karşı sizi takip eden, görünen veya görünmeyen “üçüncü taraf” script’leri ya da görüntüleri engellemeye odaklanır. Üçüncü taraf takipçilerin birçoğu (hepsi değil) aynı zamanda reklam olduğu için bunlar da engellenir. Bir reklam gördüğünüzde, o reklam sizi görür ve takip eder. Privacy Badger’ın amacı bunları durdurmaktır.

# 1208][field_questions][6][question
source: Why doesn't Privacy Badger block all ads?
tr: Privacy Badger reklamları neden engellemiyor?

# 1208][field_questions][6][answer
source: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Because Privacy Badger is primarily a privacy tool, not an ad blocker. Our aim is not to block ads, but to prevent non-consensual invasions of people's privacy because we believe they are inherently objectionable. We also want to create incentives for advertising companies to do the right thing. Of course, if you really dislike ads, you can also install a traditional ad blocker.<a name="dnt-policy"></a>
tr: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Çünkü Privacy Badger öncelikle bir gizlilik aracıdır, reklam engelleyici değil. Bizim amacımız reklamları engellemek değil, insanların gizliliğine karşı olan ve sakıncalı olduğunu düşündüğümüz rızai olmayan ihlalleri engellemektir. Biz ayrıca reklamverenleri doğru hareket etmeleri için teşvik etmek istiyoruz. Tabii ki eğer reklamlardan hoşlanmıyorsanız sıradan bir reklam engelleyici eklenti yükleyebilirsiniz.<a name="dnt-policy"></a>

# 1208][field_questions][7][question
source: What about tracking by the sites I actively visit, like NYTimes.com or Facebook.com?
tr: NYTimes.com ya da Facebook.com gibi sürekli ziyaret ettiğim sitelerin beni takip etmesine ne demeli?

# 1208][field_questions][7][answer
source: <a id="what_about_first_party_tracking"></a>For the time being, Privacy Badger only protects you against tracking by third party sites. In the future we plan to add some privacy protections for "first party" sites that you actually visit. We are doing things in this order because the most scandalous, intrusive and objectionable form of online tracking is that conducted by companies you've <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">often never heard of</a> and have no relationship with. First and foremost, Privacy Badger is there to enforce Do Not Track against these domains by providing the technical means to restrict access to their tracking scripts and images. The right policy for whether nytimes.com, facebook.com or google.com can track you <i>when you visit that site</i> – and the technical task of preventing it – is more complicated because often (though not always) tracking is interwoven with the features the site offers, and sometimes (though not always) users may understand that the price of an excellent free tool like Google's search engine is measured in privacy, not money.
tr: <a id="what_about_first_party_tracking"></a>Privacy Badger şu an için sizi yalnızca üçüncü taraf sitelerin yaptığı izlemeye karşı korur. Gelecekte “birinci taraf” sitelerin yaptığı izlemelerle ilgili ek gizlilik korumaları eklemeyi planlıyoruz. Bunu bu sırayla yapmamızın sebebi, en kepaze, izinsiz ve sakıncalı çevrimiçi izlemelerin genellikle <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">adını daha önce hiç duymadığınız</a> veya ilişkinizin olmadığı şirketler tarafından yapılıyor olmasıdır. Privacy Badger’ın görevi her şeyden önce teknik araçlar sağlayarak bu alan adlarının takipçi script’lerine ve görüntülerine olan erişimini Do Not Track kuralını uygulayarak engellemektir. nytimes.com, facebook.com ya da google.com’u <i>ziyaret ettiğinizde</i> uygulanacak doğru politika (ve engellenmesi için olan teknik iş) biraz daha karışıktır çünkü her zaman olmasa da takip yapan araçlar bir sitenin sunduğu özelliklerle iç içe geçmiş olabilir ve bazen (her zaman değil) kullanıcılar Google arama motoru gibi ücretsiz, harika bir servisin fiyatının parayla değil, gizlilikle ölçüldüğünü anlayabilir.

# 1208][field_questions][8][question
source: Does Privacy Badger contain a "black list" of blocked sites?
tr: Privacy Badger engellenmiş sitelerin “kara listesine” sahip midir?

# 1208][field_questions][8][answer
source: <a id="is_there_a_black_list"></a>No, unlike other blocking tools like AdBlock Plus, we have not made decisions about which sites to block, but rather about which behavior is objectionable. Domains will only be blocked or screened if the Privacy Badger code inside your browser actually observes the domain collecting unique identifiers after it was sent a Do Not Track message. Privacy Badger <i>does</i> contain a "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" of some sites that are known to provide essential third party resources; those sites show up as yellow and have their cookies blocked rather than being blocked entirely. This is a compromise with practicality, and in the long term we hope to phase out the yellowlist as these third parties begin to <a href="/dnt-policy">explicitly commit to respecting Do Not Track</a>. The criteria for including a domain on the yellowlist can be <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">found here</a>.
tr: <a id="is_there_a_black_list"></a>Hayır. Adblock Plus gibi diğer engelleme araçlarının aksine biz hangi sitelerin engellenmesi gerektiğiyle ilgili bir karar vermiyoruz. Biz sadece hangi davranışların sakıncalı olduğunun kararını veriyoruz. Tarayıcınıza yerleşen Privacy Badger kodu, Do Not Track mesajının yollanmasından sonra bir alan adının benzersiz ürün tanımlayıcısı (unique identifier) topladığını gözlemlediğinde o alan adını engeller veya filtreler. Privacy Badger, gerekli üçüncü taraf kaynaklar sağlayan sitelerin “<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">sarı listesini</a>“ <i>tutar</i> ve bu siteler tamamıyla engellenmekten ziyade sarı renkte gözükürler ve çerezleri engellenir. Bu pratik bir tavizdir ve uzun vadede üçüncü tarafların <a href="/dnt-policy">Do Not Track kuralına uymaya başlamasıyla</a> sarı listeyi aşamalı olarak azaltmayı umuyoruz. Bir alan adının sarı listeye eklenmesiyle ilgili kriterleri <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">burada bulabilirsiniz</a>.

# 1208][field_questions][9][question
source: How was the cookie blocking yellowlist created?
tr: Sarı listeyi engelleyen çerez nasıl yaratıldı?

# 1208][field_questions][9][answer
source: <a id="how_was_the_white_list_created"></a>The initial list of domains that should be cookie blocked rather than blocked entirely was derived from a <a href="https://jonathanmayer.org/papers_data/bau13.pdf">research project</a> on classifying third party domains as trackers and non-trackers. We will make occasional adjustments to it as necessary. If you find domains that are under- or over-blocked, please <a href="https://github.com/EFForg/privacybadgerchrome/issues">file a bug</a> on Github.
tr: <a id="how_was_the_white_list_created"></a>Çerezlerden ziyade tamamen engellenmesi gereken alan adlarının başlangıçtaki listesi, üçüncü taraf alan adlarını takipçi ve takipçi olmayan şeklinde sınıflandıran bir <a href="https://jonathanmayer.org/papers_data/bau13.pdf">araştırma projesinden</a> elde edildi. Arada sırada ve gerekli duyduğumuz durumlarda bu listede değişikliğe gideceğiz. Eğer gereğinden az, ya da gereğinden fazla engellenen alan adlarına rastlarsanız, lütfen GitHub üzerinden <a href="https://github.com/EFForg/privacybadgerchrome/issues">bug bildirimi yapın</a>.

# 1208][field_questions][10][question
source: Does Privacy Badger prevent fingerprinting?
tr: Privacy Badger parmak izi kontrolünü engeller mi?

# 1208][field_questions][10][answer
source: <a id="does_it_prevent_fingerprinting"></a>Browser fingerprinting is an extremely subtle and problematic method of tracking, which we <a href="https://panopticlick.eff.org">documented with the Panopticlick project</a>. Privacy Badger 1.0 can detect <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">based</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">fingerprinting</a>, and will block third party domains that use it. Detection of other forms of fingerprinting and protections against first-party fingerprinting are ongoing projects. Of course, once a domain is blocked by Privacy Badger, it will no longer be able to fingerprint you as a third-party.
tr: <a id="does_it_prevent_fingerprinting"></a>Tarayıcı parmak izleri, fark etmesi çok zor ve problematik olan bir izleme yöntemidir ve bunu daha önce <a href="https://panopticlick.eff.org">Panopticlick projesiyle belgeledik</a>. Privacy Badger’ın 1.0 sürümü <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">kanvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">temelli</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">parmak izi kontrolünü</a> algılayabilir ve bunları kullanan üçüncü taraf alan adlarını engeller. Diğer tür parmak izi kontrollerini algılama ve birinci taraf parmak izi kontrolüne karşı savunma ile ilgili projelerimiz devam ediyor. Elbette bir alan adı Privacy Badger tarafından engellendiğinde, o alan adı üçüncü taraf olarak bir daha tarayıcınızın parmak izini kontrol edemez.
