Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1208][field_questions][11][question
source: Does Privacy Badger consider every cookie to be a tracking cookie?
tr: Privacy Badger her çerezi takipçi çerez olarak mı algılıyor?

# 1208][field_questions][11][answer
source: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analyzes the cookies from each site; unique cookies that contain tracking IDs are disallowed, while "low entropy" cookies that perform other functions are allowed. For instance a cookie like LANG=fr that encodes the user's language preference, or a cookie that preserves a very small amount of information about ads the user has been shown, would be allowed provided that individual or small groups of users' reading habits could not be collected with them. We have a <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">very rough</a> implementation of this; pull requests are welcome.
tr: <a id="is_every_cookie_a_tracking_cookie"></a>Hayır. Privacy Badger her siteden gelen çerezleri analiz eder; takip numaralarına sahip özgün çerezlere izin verilmez, ancak diğer fonksiyonları gerçekleştiren “düşük entropi” çerezlere izin verilir. Örneğin LANG=fr gibi kullanıcının dil seçeneğini kodlayan bir çereze, ya da kullanıcının gördüğü bir reklamla alakalı çok az miktarda bilgi saklayan bir çereze izin verilir, ancak buna sadece çerezlerin tek ya da küçük bir grup kullanıcıya ait okuma alışkanlıklarının toplanmadığı durumlarda izin verilir. Bunun nasıl uygulanacağıyla ilgili <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">kaba taslak</a> bir uygulama planımız var. Yardım etmek istiyorsanız kapımız açık.

# 1208][field_questions][12][question
source: Does Privacy Badger account for a cookie that was used to track me even if I deleted it?
tr: Privacy Badger beni daha önce izlemiş ama sildiğim bir çerezin takibini yapıyor mu?

# 1208][field_questions][12][answer
source: <a id="what_about_deleted_cookies"></a>Yes. Privacy Badger keeps track of cookies that could be used to track you and where they came from, even if you frequently clear your browser's cookies.
tr: <a id="what_about_deleted_cookies"></a>Evet. Privacy Badger sizi izlemek için kullanılan çerezleri ve bunların nereden geldiğinin takibini tarayıcınızın çerezlerini sık sık temizleseniz bile yapar.

# 1208][field_questions][13][question
source: Will you be supporting any other browsers besides Chrome / Firefox?
tr: Chrome / Firefox dışında başka tarayıcıları da destekleyecek misiniz?

# 1208][field_questions][13][answer
source: <a id="safari_and_ie"></a>In the near future we hope to release Privacy Badger for Opera, Safari, and Firefox Mobile. Unfortunately at the moment we cannot support Internet Explorer, since current version IE appears to be incompatible with how Privacy Badger works at a technical level. (With that said, if you would like to work on porting Privacy Badger to other platforms, please let us know!)
tr: <a id="safari_and_ie"></a>Kısa bir süre içinde Opera, Safari ve Firefox Mobile tarayıcıları için Privacy Badger’ı kullanıma sunmayı umuyoruz. Maalesef şu an için Internet Explorer’ı destekleyemiyoruz, çünkü IE’nin son sürümü Privacy Badger’ın çalışması için gerekli teknik altyapıyı desteklemiyor. (Bununla birlikte, Privacy Badger’ı başka platformlara port etmek istiyorsanız lütfen bizimle temas kurun!)

# 1208][field_questions][14][question
source: Can I download Privacy Badger outside of the Chrome Web Store?
tr: Privacy Badger’ı Chrome Web Store dışında başka bir yerden indirebilir miyim?

# 1208][field_questions][14][answer
source: <a id="no_chrome_store"></a>You can! If you are using an alternative Chromium based browser such as Chromium ports Iron, Comodo Dragon, or Maxthon you can get the latest version of the addon directly from this link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>
tr: <a id="no_chrome_store"></a>İndirebilirsiniz! Chromium temelli Iron, Comodo Dragon ya da Maxthon gibi başka bir Chromium portunu kullanıyorsanız, eklentinin son sürümünü <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a> adresinden edinebilirsiniz.

# 1208][field_questions][15][question
source: I am an online advertising / tracking company. How do I stop Privacy Badger from blocking me?
tr: Ben bir reklamverenim / izleme şirketiyim. Privacy Badger’ın beni engellemesini nasıl durdurabilirim?

# 1208][field_questions][15][answer
source: <a id="how_to_comply_with_dnt"></a>One way is to stop tracking third party users who have turned on the Do Not Track header (i.e., stop collecting cookies, supercookies or fingerprints from them). That will work for new Privacy Badger installs. If copies of Privacy Badger have already blocked your domain, you can unblock yourself by promising to respect the Do Not Track header in a way that conforms with the user's privacy policy. You can do that by posting a specific compliant <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, where "example.com" is all of your DNT-compliant domains. Note that the domain <i>must</i> support HTTPS, to protect against tampering by network attackers. The path contains ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger currently checks for this specific <i>verbatim</i> policy document, though in the future Privacy Badger may allow content from sites that post different versions of a <a href="/dnt-policy">compliant DNT Policy</a>, and that there may be ways for users to specify their own acceptable DNT policies if they wish to.
tr: <a id="how_to_comply_with_dnt"></a>Üçüncü taraf kullanıcıları izlemeyi durdurmanın yollarından biri, Do Not Track başlığını devreye sokmuş kullanıcıları takip etmemektir (yani kullanıcılardan çerezleri, superçerezleri ve parmak izlerini toplamayı bırakın). Bu yeni Privacy Badger kurulumları için çalışır. Eğer Privacy Badger kopyaları alan adınızı çoktan engellediyse, kullanıcının gizlilik politikasına ve Do Not Track isteğine saygı duyacağınıza söz vererek engelinizi kaldırabilirsiniz. Bunu bir spesifik uyumlu <a href="https://www.eff.org/dnt-policy" target="_blank">DNT poliçesini</a> <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt> adresine bildirerek gerçekleştirebilirsiniz (“example.com” yerine DNT-uyumlu alan adlarınızı yazın). Bu alan adının ağ ataklarına karşı korunabilmesi için HTTPS desteklemesi <i>gerektiğini</i> unutmayın. Bu yol <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>’e uygun olarak “.well-known” URI’ını içerir. Privacy Badger şu an için bu spesifik poliçe dökümanını <i>harfi harfine</i> kontrol eder, ancak Privacy Badger gelecek sürümlerde uyumlu bir <a href="/dnt-policy">DNT poliçesinin</a> farklı versiyonlarını bildirmiş sitelere izin verebilir ve kullanıcıların kendi kabul edilebilir DNT poliçelerini kullanabilmelerinin yolları da olabilir.

# 1208][field_questions][16][question
source: What is the Privacy Badger license? Where is the Privacy Badger source code?
tr: Privacy Badger hangi lisansı kullanıyor? Privacy Badger’ın kaynak kodu nerede?

# 1208][field_questions][16][answer
source: <a id="license"></a>Privacy Badger is GPLv3 code, the Chrome version is based on a modified version of the AdBlock Plus engine. You can find the Privacy Badger source trees <a href="https://github.com/EFForg/">on Github</a>. There is also a <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger is governed by EFF's <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>
tr: <a id="license"></a>Privacy Badger GPLv3 lisansını kullanır ve Chrome sürümü AdBlock Plus motorunun modifiye edilmiş bir sürümüdür. Privacy Badger’ın kaynak ağaçlarını (source tree) <a href="https://github.com/EFForg/">Github’da</a> bulabilirsiniz. Ayrıca bir <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing listesi</a> de mevcuttur. Privacy Badger, EFF’in “<a href="/code/privacy">Yazılım için Gizlilik Politikası</a>”na sadık kalınarak yönetilir. <a name="comparison"></a>

# 1208][field_questions][17][question
source: I found a bug! What do I do now?
tr: Bir bug buldum! Şimdi ne yapayım?

# 1208][field_questions][17][answer
source: <a id="i_found_a_bug"></a>First, please make sure the bug hasn't already been reported by checking the current bug list <a href="https://github.com/EFForg/privacybadgerfirefox/issues">for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues">for Chrome</a>. If the bug hasn't yet been reported you can report the bug <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">here for Privacy Badger for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">here for Privacy Badger for Chrome</a>. If you don't have a GitHub account, then you can login using the anonymous one: "cypherpunk"/"cypherpunk", but please understand that doing so will limit our ability to communicate with you about the bug and make it harder for us to fix it quickly.
tr: <a id="i_found_a_bug"></a>İlk önce bug’ın daha önce rapor edilmediğini <a href="https://github.com/EFForg/privacybadgerfirefox/issues">Firefox</a> veya <a href="https://github.com/EFForg/privacybadgerchrome/issues">Chrome</a> için mevcut olan bug listesine bakarak kontrol edin. Eğer bug daha önce rapor edilmediyse, bug’ı <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">Firefox sürümü için buradan</a>, <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">Chrome sürümü içinse buradan</a> rapor edebilirsiniz. Eğer Github hesabınız yoksa, “cypherpunk”/”cypherpunk” anonim hesabını kullanarak giriş yapabilirsiniz ancak lütfen bunu yapmanın bizim sizinle bug’la ilgili iletişime geçme kabiliyetimizi sınırlayacağını ve bug’ın çözümünün daha da zorlaşacağını unutmayın.

# 1208][field_questions][18][question
source: How can I support Privacy Badger?
tr: Privacy Badger’ı nasıl destekleyebilirim?

# 1208][field_questions][18][answer
source: <a id="support"></a>Thanks for asking! Individual donations make up about half of EFF's support, which gives us the freedom to work on user-focused projects. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Thank you. If you want to help with the code we appreciate that as well. Here are the lists of good volunteer tasks <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.
tr: <a id="support"></a>Sorduğunuz için teşekkürler! Kişisel bağışlar EFF’in desteğinin yarısını oluşturuyor ve bu destekler bize kullanıcı odaklı projeler üzerinde çalışma özgürlüğü sunuyor. Eğer Privacy Badger ya da buna benzer diğer projelerin gelişimini desteklemek ve daha güvenli bir internet ekosisteminin inşaasına katkıda bulunmak istiyorsanız, <a href="https://supporters.eff.org/donate/support-privacy-badger">bize maddi yardımda bulunabilirsiniz</a>. Teşekkürler. Eğer kodlayarak yardım etmek istiyorsanız, bunun için de müteşekkir oluruz. <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> ve <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a> için mevcut olan gönüllü işlere göz atabilirsiniz.

# 1208][field_questions][19][question
source: How does Privacy Badger handle social media widgets?
tr: Privacy Badger sosyal medya butonlarını nasıl idare ediyor?

# 1208][field_questions][19][answer
source: <a id="social"></a>Social media widgets (such as the Facebook Like button, Twitter Tweet button, or Google +1 button) often track your reading habits. Even if you don't click them, the social media companies often see exactly which pages you're seeing the widget on. Privacy Badger includes a feature imported from the <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> project which is able to replace the widgets with a stand-in version, so that you can still see and click them. You will not be tracked by these replacements unless you explicitly choose to click them. Privacy Badger currently knows how to replace the following widgets if they are observed tracking you: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (The source code for these replacements is <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">here</a>; pull requests are welcome) Note that Privacy Badger will not replace social media widgets unless it has blocked the associated tracker. If you're seeing real social media widgets, it generally means that Privacy Badger hasn't detected tracking from that variant of the widget, or that the site you're looking at has implemented its own version of the widget. To avoid confusion, the replacement widgets are marked with the Privacy Badger badge next to the button. To interact with a replacement widget, simply click on it. Depending on the widget, Privacy Badger will either send you directly to the appropriate sharing page (for example, to post a tweet) or it will enable and load the real social widget (for example, the Facebook Like button, with personalized information about how many of your friends have "liked" the page). In the second case, you will still need to interact with the real widget to "like" or share the page. <a id="connection-failure"></a>
tr: <a id="social"></a>Sosyal medya butonları (Facebook’un Beğen, Twitter’ın Tweet ya da Google +1 butonu gibi) genellikle okuma alışkanlıklarınızı izler. Bu butonlara tıklamasanız bile, sosyal medya şirketleri bu butonları hangi sayfalarda görüntülediğinizi bilirler. Privacy Badger, <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> isimli projeden aktarılmış bir özellik içerir. Bu özellik sosyal medya butonlarının yerine benzerlerini yerleştirir ve isterseniz bu botunları görmeye ve tıklamaya devam edebilirsiniz. Bu butonların benzerleri siz bu butonlara tıklamadıkça sizi takip etmez. Şu an için Privacy Badger sizi takip etmeleri durumunda listelenen butonların nasıl değiştirilebileceğini biliyor: AddThis, Facebook, Google, Linkedin, Pinterest, Stumbleupon ve Twitter. (Bu butonların benzerlerinin kaynak kodu <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">buradadır</a>; pull request’lerine açığız) İlişkili takipçi engellenmediği sürece Privacy Badger’ın bu butonları benzerleriyle değiştirmediğini lütfen dikkate alın. Eğer gerçek sosyal medya butonlarını görüyorsanız, bu genellikle Privacy Badger’ın butonun o varyantında takipçiye rastlamadığı ya da ziyaret ettiğiniz sitenin bu butonun kendi sürümünü kullandığı anlamına gelir. Kafa karışıklığını önlemek için benzer butonların yanında Privacy Badger logosu vardır. Benzer butonlarla etkileşebilmek için bu butonlara tıklamanız yeterlidir. Butona bağlı olarak, Privacy Badger sizi ya direkt olarak uygun paylaşım sayfasına (tweet atmanız için twitter’a) gönderir ya da gerçek sosyal medya butonunu aktifleştirip sizin için yükler (örneğin hangi arkadaşlarınızın sayfayı beğendiğiyle alakalı kişiselleştirilmiş bilgilerin bulunduğu Facebook Beğen butonu gibi). İkinci durumda, sayfayı “beğenmek” ya da paylaşmak için gerçek butonu kullanmak zorundasınız. <a id="connection-failure"></a>

# 1208][field_questions][20][question
source: I'm having a problem installing the browser extension.
tr: Tarayıcı eklentisini kurarken bazı sorunlar yaşıyorum.

# 1208][field_questions][20][answer
source: Some people report that installing Privacy Badger gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast antivirus, which blocks installation of browser extensions. You may be able to work around by right-clicking to download the .xpi file, then dragging it into Firefox to install. If that fails, you may temporarily disable Avast antivirus before installing the extension.
tr: Bazı kişiler Privacy Badger kurulumu sırasında şu hatayı aldıklarını belirttiler: “The addon could not be downloaded because of a connection failure on www.eff.org.” Bu soruna tarayıcı eklentilerinin kurulumunu engelleyen Avast antivirus yazılımı yol açabilir. Bu sorunu .xpi dosyasına sağ tıklayıp indirdikten sonra, kurulum için dosyayı Firefox’a sürükleyerek çözebilirsiniz . Eğer başarısız olursanız, eklentiyi yüklemeden önce Avast antivirus’u geçici olarak devre dışı bırakabilirsiniz.

# 1208][field_questions][21][question
source: Is Privacy Badger compatible with other extensions, including other adblockers?
tr: Privacy Badger reklam engelleyiciler de dahil olmak üzere diğer eklentilerle uyumlu mudur?

# 1208][field_questions][21][answer
source: Privacy Badger is compatible with most extensions. Whether it makes sense to run it with another adblocker varies. If you have customized your adblocker settings to block trackers as well, Privacy Badger may be partially redundant (though it may offer advantages like cookie blocking that other tracker blockers do not). However if you run extensions like Adblock Plus or Ghostery in their default configurations, Privacy Badger can significantly increase your privacy online. (Adblock does not block invisible trackers by default, Ghostery does not block anything by default.) The only extensions known to be incompatible with Privacy Badger is the Avast antivirus extension, which blocks the installation of Privacy Badger and other extensions. Last updated July 22nd, 2015
tr: Privacy Badger eklentilerin büyük çoğunluğuyla uyumludur. Başka bir reklam engelleyici çalıştırmanın mantıklı olup olmadığı duruma göre değişiklik gösterir. Eğer reklam engelleyici eklentinizin engel listesinin içine takipçileri de dahil ettiyseniz, Privacy Badger’ı kullanmak gereksiz olabilir (ancak Privacy Badger çerez engellemesi gibi diğer engelleyicilerde olmayan avantajlar sunabilir). Ancak eğer Adblock Plus ya da Ghostery gibi bir eklentiyi varsayılan ayarlarıyla kullanıyorsanız, Privacy Badger çevrimiçi gizliliğinizi önemli derecede arttırabilir. (Adblock varsayılan olarak gizli takipçileri engellemez. Ghostery varsayılan olarak hiçbir şeyi engellemez.) Privacy Badger’la uyumlu olmadığı bilinen tek eklenti, Privacy Badger ve diğer eklentilerin kurulumunu engelleyen Avast antivirus eklentisidir. En son 22 Temmuz 2015 tarihinde güncellendi

# 1209][field_text_field][0][value
source: A Project of the <a href="/">Electronic Frontier Foundation</a>
tr: Bir <a href="/">Electronic Frontier Foundation</a> projesi

# 1212][menu:item:1956:title
source: Creating HTTPS Everywhere Rulesets
tr: HTTPS Everywhere Kuralsetlerini Yaratmak

# 1213][menu:item:7475:title
source: HTTPS Everywhere Atlas
tr: HTTPS Everywhere Atlası

# 1214][menu:item:1955:title
source: How to Deploy HTTPS Correctly
tr: HTTPS Doğru Bir Şekilde Nasıl Deploy Edilir?

# 1215][menu:item:1957:title
source: Report Bugs / Hack On The Code
tr: Bug Bildirimi / Kodu Hackleyin

# 1216][menu:item:1954:title
source: FAQ
tr: SSS

# 1217][singular
source: HTTPS Everywhere is a Firefox, Chrome, and Opera extension that encrypts your communications with many major websites, making your browsing more secure.
tr: HTTPS Everywhere, birçok büyük websitesiyle olan haberleşmelerinizi şifreleyerek tarayıcınızı daha güvenli yapan bir Firefox, Chrome ve Opera eklentisidir.

# 1218][singular
source: Encrypt the web: Install HTTPS Everywhere today.
tr: Web'i şifreleyin: HTTPS Everywhere'i şimdi kurun.

# 1219][singular
source: Install in Firefox
tr: Firefox'a Kur

# 1220][singular
source: Install in Firefox for Android
tr: Android için Firefox'a Kur

# 1221][singular
source: Install in Chrome
tr: Chrome'a Kur

# 1222][singular
source: Install in Opera
tr: Opera'ya Kur

# 1223][singular
source: Recent Releases
tr: Son Sürümler

# 1224][singular
source: Stable releases for Firefox:
tr: Firefox için kararlı sürümler:

# 1225][singular
source: Stable releases for Chrome, Chromium, and Opera 15+:
tr: Chrome, Chromium ve Opera 15+ için kararlı sürümler:

# 1227][singular
source: Note: If you install the standalone .crx (i.e. not from the Chrome Web Store), and you are using Windows, Chrome will automatically disable the extension on each restart. You may be able to work around by using developer mode. See <a href="https://github.com/EFForg/https-everywhere/issues/819">this issue</a>.
tr: Not: Bağımsız .crx dosyasını (Chrome Web Store'u kullanmadan) kurarsanız ve Windows kullanıyorsanız, Chrome tarayıcınızı yeniden başlattığınızda eklentiyi otomatik olarak devre dışı bırakır. Geliştirici modunu kullanarak buna geçici bir çözüm bulabilirsiniz. <a href="https://github.com/EFForg/https-everywhere/issues/819">Linkteki issue'ya</a> gözatın.

# 1228][singular
source: Featured Tools
tr: Öne Çıkan Araçlar

# 1229][singular
source: All Tools
tr: Tüm Araçlar

# 1230][singular
source: Yes
tr: Evet

# 1231][singular
source: No
tr: Hayır

# 1232][singular
source: Encrypted in transit?
tr: Taşıma sırasında şifrelenmiş?

# 1233][singular
source: Encrypted so the provider can’t read it?
tr: Sağlayıcının okuyamayacağı şekilde şifrelenmiş?

# 1234][singular
source: Can you verify contacts’ identities?
tr: Kişilerin kimliği doğrulanabiliyor mu?

# 1235][singular
source: Are past comms secure if your keys are stolen?
tr: Anahtarlar çalınmışsa geçmiş konuşmalar güvende mi?

# 1236][singular
source: Is the code open to independent review?
tr: Kod bağımsız incelemeye açık mı?

# 1237][singular
source: Is security design properly documented?
tr: Güvenlik tasarımı düzgünce belgelenmiş mi?

# 1238][singular
source: Has there been any recent code audit?
tr: Kod yakın bir zamanda denetlenmiş mi?

# 1239][singular
source: Privacy Badger blocks spying ads and invisible trackers.
tr: Privacy Badger casus reklamları ve gizli takipçileri engeller.

# 1241][singular
source: Install Privacy Badger
tr: Privacy Badger’ı Kur

# 1242][singular
source: Privacy Badger FAQ
tr: Privacy Badger SSS

# 1243][singular
source: and Enable Do Not Track
tr: ve Do Not Track’i etkinleştir

# 1244][singular
source: Click here for !browser version
tr: !browser sürümü için buraya tıklayın

# 1247][singular
source: Download for Firefox
tr: Firefox için İndir

# 1248][singular
source: Download for Chrome
tr: Chrome için İndir
