Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 739][body][0][value
source: <p class="eff-light-blue eff-grey">By <a href="http://noncombatant.org">Chris Palmer</a> and <a href="/about/staff/yan-zhu">Yan Zhu</a></p><p><em>Originally published on 15 Nov 2010. Revised on 12 Dec 2013.</em></p><p>Internet technologists have always known that HTTP is insecure, causing many risks to users. Because HTTP traffic is unencrypted, any data sent over HTTP can be read and modified by anyone who has access to the network. As revealed by the Snowden NSA surveillance documents, HTTP traffic can also be collected and searched by government agencies without notice to users or webmasters. Given these risks, EFF believes that every website should support HTTPS on all pages as soon as possible.</p><p>While HTTPS has long existed as the bare minimum for web security, some websites have been slow to adopt it. In part, this is because correctly and completely serving an application over HTTPS takes some care.</p><p>This article is designed to encourage and assist website operators in implementing and improving HTTPS support. Although no precaution will defend against all threats, supporting HTTPS will protect users from a wide range of common attacks.</p><h2>Background</h2><p>HTTPS provides three security guarantees:</p><ol><li><strong>Server authentication</strong> allows users to have some confidence that they are talking to the true application server. Without this guarantee, there can be no guarantee of confidentiality or integrity.</li><li><strong>Data confidentiality</strong> means that eavesdroppers cannot understand the content of the communications between the user's browser and the web server, because the data is encrypted.</li><li><strong>Data integrity</strong> means that a network attacker cannot damage or alter the content of the communications between the user's browser and the web server, because they are validated with a cryptographic <em><a href="https://secure.wikimedia.org/wikipedia/en/wiki/Message_authentication_code">message authentication code</a></em>.</li></ol><p><strong>HTTP provides no security guarantees</strong>, and applications that use it <strong>cannot possibly provide users any security</strong>. When using a web application hosted via HTTP, people have no way of knowing whether they are talking to the true application server, nor can they be sure attackers have not read or modified communications between the user's computer and the server.</p><h2>Modes of Attack and Defense</h2><p>However users connect to the Internet, there are a variety of people who can attack them--whether spying on them, impersonating them, tampering with their communications, or all three of these. The wifi network operator can do this; any ISP in the path between client and server can do it; anyone who can reconfigure the wifi router or another router can do it; and often, anyone else using the same network can do it, too.</p><p><a href="http://codebutler.com/firesheep-a-day-later/">Firesheep</a> is an example of a <em>passive network attack</em>: it eavesdrops on the contents of network communications between browser and server, but does not re-route or modify them. Government surveillance programs such as <a href="http://www.theguardian.com/world/2013/jul/31/nsa-top-secret-program-online-data">XKeyscore</a> also use passive attacks on HTTP traffic to collect massive amounts of online communication data.</p><p>By contrast, other freely-available tools perform <em>active network attacks</em>, in which the attacker does modify the contents of and/or re-route communications. These tools range from serious, such as <a href="http://www.thoughtcrime.org/software/sslstrip/">sslstrip</a>, to silly, like <a href="http://www.ex-parrot.com/pete/upside-down-ternet.html">the Upside-Down-Ternet</a>. Although Upside-Down-Ternet is a funny prank, it is technically identical to potentially more damaging attacks such as an attack that injects malicious code or incorrect information into web pages; at the same time, it shows that such attacks are easy enough to be jokes. Free wifi hotspots have been known to inject advertisements dynamically into web pages that users read--indicating that active network attacks are a viable business model. Tools like <a href="http://www.oxid.it/cain.html">Cain and Abel</a> enable a range of attacks, including re-routing local network traffic through the attacker's system. (Also see <a href="http://arpspoof.sourceforge.net/">Arpspoof</a> and <a href="http://www.monkey.org/%7Edugsong/dsniff/">dsniff</a>.)</p><p>Only a mechanism that provides (at least) authentication, confidentiality, and integrity can defend against a range of attacks. HTTPS is currently our best option for web applications.</p><p>However, there are some potential pitfalls that site operators must avoid in order to deploy HTTPS securely.</p><h2>Mixed Content</h2><p>When hosting an application over HTTPS, there can be no <em>mixed content</em>; that is, all content in the page must be fetched via HTTPS. It is common to see partial HTTPS support on sites, in which the main pages are fetched via HTTPS but some or all of the media elements, stylesheets, and JavaScript in the page are fetched via HTTP.</p><p>This is unsafe because although the main page load is protected against active and passive network attack, none of the other resources are. If a page loads some JavaScript or CSS code via HTTP, an attacker can provide a false, malicious code file and take over the page's DOM once it loads. Then, the user would be back to a situation of having no security. This is why all mainstream browsers warn users about pages that load mixed content. Nor is it safe to reference images via HTTP: What if the attacker swapped the Save Message and Delete Message icons in a webmail app?</p><p><strong>You must serve the entire application domain over HTTPS.</strong> Redirect HTTP requests with HTTP 301 or 302 responses to the equivalent HTTPS resource.</p><p>Some site operators provide only the login page over HTTPS, on the theory that only the user's password is sensitive. These sites' users are <a>vulnerable to passive and active attacks</a>.</p><p>Unfortunately, many sites today load content from external sites and CDN's that do not support HTTPS. If it's not possible to serve these resources from your own host or another one that supports HTTPS, you should urge these other sites to start supporting HTTPS immediately.</p><h2>Security and Cookies</h2><p>As Chris Palmer described in a <a href="https://www.isecpartners.com/media/12009/web-session-management.pdf">paper on secure session management for web applications</a>, site operators must scope sensitive cookies (such as cookies used for user authentication) to the secure origin. If a cookie is broadly scoped (with the Domain attribute in the Set-Cookie: header), it may "leak" to other hosts or applications in the same domain--potentially less-secure hosts or applications.</p><p>Similarly, the application must set the Secure attribute on the cookie when setting it. This attribute instructs the browser to send the cookie only over secure (HTTPS) transport, never insecure (HTTP).</p><h2>Use HTTP Strict Transport Security</h2><p><a href="https://en.wikipedia.org/wiki/Strict_Transport_Security">HTTP Strict Transport Security</a> (HSTS) is an HTTP protocol extension that enables site operators to instruct browsers to expect the site to use HTTPS.</p><p>Although not all browsers yet support HSTS, EFF urges those that don't--we're looking especially at you, Apple and Microsoft--to follow the lead Google, Opera, and Mozilla have set by adopting this useful security mechanism. Indeed, ultimately we expect HTTPS (and possibly newer protocols such as <a href="https://en.wikipedia.org/wiki/SPDY">SPDY</a> and <a href="https://en.wikipedia.org/wiki/QUIC">QUIC</a>) to replace HTTP entirely, the way SSH replaced Telnet and rsh.</p><p>As an extra precaution, your site should support HSTS preloading, which prevents interception of an HTTP request if the browser hasn't yet received a valid HSTS header from the server. HSTS preloading is implemented via an opt-in list of domains that is included in Chromium, Google Chrome, and Firefox. See <a href="http://www.chromium.org/sts">Chromium's page</a> for instructions on getting your site added to this list. Note that you must also send an HSTS header with a max-age greater value than 18 weeks for Firefox to include your site in their HSTS preload list.</p><p>We recently enabled HSTS and HSTS preloading for eff.org. It took less than an hour to set up, and we found a way to do it without forcibly redirecting users to HTTPS, so we can state an unequivocal preference for HTTPS access while still making the site available in HTTP. It worked like a charm and a significant fraction of our users are now automatically accessing our site in HTTPS, perhaps without even knowing it.</p><h2>Choose Strong Protocols and Cipher Suites</h2><p>Here is a brief list of recommendations for choosing secure protocols and cipher suites in an SSL deployment:</p><ul><li>Disable support for SSLv2, SSLv3, and TLS 1.0.</li><li>Support TLS 1.1 and 1.2.</li><li>Disable NULL, aNULL, and eNULL ciphersuites, which do not offer both encryption and authentication.</li><li>Use private keys that are at least as secure as a 2048-bit RSA key.</li><li>Prefer ciphersuites that include <b>ephemeral Diffie-Hellman key exchange</b>. These offer the important property of <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">Perfect Forward Secrecy</a>, which prevents decryption of past web traffic if your SSL private key is compromised in the future.</li><li>Disable ciphersuites with keys sizes smaller than 128 bits for encryption.</li><li>Disable ciphersuites that use MD5 for hashing. SHA-1 is also discouraged but may be required for compatibility with TLS 1.0 and SSLv3.</li><li>Disable ciphersuites that use RC4 for encryption. AES-CBC is preferable to RC4 but vulnerable to the <a href="https://www.imperialviolet.org/2011/09/23/chromeandbeast.html">BEAST</a> attack. Thus, AES-GCM is often recommended.</li><li>Disable TLS compression in order to prevent the <a href="https://en.wikipedia.org/wiki/CRIME_%28security_exploit%29">CRIME attack</a>.</li><li>Only support secure TLS renegotiations compliant with <a href="http://www.ietf.org/rfc/rfc5746.txt">RFC 5746</a>, or disable TLS renegotiations entirely.</li></ul><p>A useful tool for testing for well-known weaknesses in an existing HTTPS deployment is Qualys's <a href="https://www.ssllabs.com/ssltest/">SSL Server Test</a>.</p><h2>Performance Concerns</h2><p>Many site operators report that they can't move to HTTPS for performance reasons. However, most people who say this have not actually measured any performance loss, may not have measured performance at all, and have not profiled and optimized their site's behavior. Usually, sites have latency far higher and/or throughput far lower than necessary even when hosting over HTTP--indicating HTTPS is not the problem.</p><p>The crux of the performance problem is usually at the content layer, and also often at the database layer. Web applications are fundamentally I/O-bound, after all. Consider <a href="http://gmailblog.blogspot.com/2008/05/need-for-speed-path-to-faster-loading.html">this wisdom from the Gmail developers</a>:</p><blockquote><p>First, we listed every transaction between the web browser and Google's servers, starting with the moment the "Sign in" button is pressed. To do this, we used a lot of different web development tools, like <a href="http://httpwatch.com/">Httpwatch</a>, <a href="http://www.wireshark.org/">WireShark</a>, and <a href="http://www.fiddlertool.com/fiddler/">Fiddler</a>, plus our own performance measuring systems. [...]</p><p>We spent hours poring over these traces to see exactly what was happening between the browser and Gmail during the sign-in sequence, and we found that there were between fourteen and twenty-four HTTP requests required to load an inbox and display it. To put these numbers in perspective, a popular network news site's home page required about a 180 requests to fully load when I checked it yesterday. But when we examined our requests, we realized that we could do better. We decided to attack the problem from several directions at once: reduce the number of overall requests, make more of the requests cacheable by the browser, and reduce the overhead of each request.</p><p>We made good progress on every front. We reduced the weight of each request itself by eliminating or narrowing the scope of some of our cookies. We made sure that all our images were cacheable by the browser, and we consolidated small icon images into single meta-images, a technique known as spriting. We combined several requests into a single combined request and response. The result is that it now takes as few as four requests from the click of the "Sign in" button to the display of your inbox.</p></blockquote><p>Google's <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">Adam Langley provides additional detail</a>:</p><blockquote>In order to do this we had to deploy <em>no additional machines</em> and <em>no special hardware</em>. On our production frontend machines, SSL/TLS accounts for less than 1% of the CPU load, less than 10KB of memory per connection and less than 2% of network overhead. Many people believe that SSL takes a lot of CPU time and we hope the above numbers (public for the first time) will help to dispel that. [emphasis in original]</blockquote><p>Is it any wonder Gmail performs well, even when using HTTPS exclusively? Site operators can realize incremental improvement by gradually tuning their web applications. Chris gave a presentation to this effect at <a href="http://assets.en.oreilly.com/1/event/22/High%20Performance,%20Low%20Cost,%20and%20Strong%20Security_%20Pick%20Any%20Three%20Presentation.pdf">Web 2.0 Expo 2009</a>.</p><h2>Conclusion</h2><p>HTTPS provides the baseline of safety for web application users, and there is no performance- or cost-based reason to stick with HTTP. Web application providers <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1421553">undermine their business models</a> when, by continuing to use HTTP, they enable a wide range of attackers anywhere on the internet to compromise users' information.</p>
fr: <p class="eff-light-blue eff-grey">Écrit par <a href="http://noncombatant.org">Chris Palmer</a> et <a href="/about/staff/yan-zhu">Yan Zhu</a></p><p><em>Publié le 15 novembre 2010. Révisé le 12 décembre 2013.</em></p><p>Les spécialistes de l’internet ont toujours su que HTTP est non sécurisé et qu’il cause beaucoup de risques pour les utilisateurs. Parce que le trafic HTTP n'est pas chiffré, toutes les données envoyées via HTTP peuvent être lues et modifiées par quiconque a accès au réseau. Comme l’ont révélé les documents de Snowden sur la surveillance de la NSA, le trafic HTTP peut être également collecté et fouillé par des organismes gouvernementaux sans préavis aux utilisateurs ou aux webmasters. Compte tenu de ces risques, l’EFF estime que les sites Web devraient offrir le protocole HTTPS sur l’ensemble de leurs pages dès que possible.</p><p>Tandis que HTTPS existe depuis longtemps comme le strict minimum pour la sécurité sur le Web, certains sites ont été lents à l’adopter. Cela s’explique en partie par le fait qu’une certaine attention est nécessaire pour pouvoir offrir correctement et entièrement une application via HTTPS.</p><p>Cet article est conçu pour encourager et pour aider les opérateurs de sites Web dans la mise en œuvre et l'amélioration de la prise en charge de HTTPS. Bien qu'aucune précaution ne puisse prémunir contre toutes les menaces, la prise en charge de HTTPS protégera les utilisateurs contre un large éventail d'attaques courantes.</p><h2>Contexte</h2><p>HTTPS apporte trois garanties de sécurité :</p><ol><li><strong>L’authentification du serveur</strong> permet aux utilisateurs d'avoir confiance qu'ils communiquent avec le serveur d'application réel. Sans cette garantie, il ne peut y avoir de garantie de confidentialité ou d'intégrité.</li><li><strong>La confidentialité des données</strong> signifie que les espions ne peuvent comprendre le contenu des communications entre le navigateur et le serveur web, car les données sont chiffrées.</li><li><strong>L’intégrité des données</strong> signifie qu'un attaquant du réseau ne peut pas endommager ou modifier le contenu des communications entre le navigateur et le serveur web, car elles sont validées par un <em><a href="https://secure.wikimedia.org/wikipedia/en/wiki/Message_authentication_code">code d'authentification en message cryptographique</a></em>.</li></ol><p><strong>Le HTTP ne fournit aucune garantie</strong> de sécurité et les applications qui l'utilisent <strong>ne peuvent pas vraiment fournir de sécurité à leurs utilisateurs</strong>. Lorsque vous utilisez une application Web hébergée via HTTP, les gens n'ont aucun moyen de savoir s’ils parlent au serveur d'application réel, et ne peuvent s’assurer que les attaquants n'ont pas lu ou modifié des communications entre l'ordinateur et le serveur.</p><h2>Modes d'attaque et de Defense</h2><p>De quelque manière que les utilisateurs se connectent à l'Internet, il existe une variété de personnes qui peuvent les attaquer, que ce soit en les espionnant, en les imitant, en falsifiant leurs communications, ou en faisant tout cela en même temps. L'opérateur du réseau Wi-Fi peut le faire ; n'importe quel FAI se trouvant entre le client et le serveur peut le faire ; quiconque peut reconfigurer le routeur Wi-Fi ou autre routeur peut le faire ; et souvent, n'importe qui d'autre utilisant le même réseau peut le faire aussi.</p><p><a href="http://codebutler.com/firesheep-a-day-later/">Firesheep</a> est un exemple <em>d'attaque de réseau passive</em> : il intercepte le contenu des communications réseau entre le navigateur et le serveur, mais ne les redirige pas et ne les modifie pas. Les programmes gouvernementaux de surveillance tels que <a href="http://www.theguardian.com/world/2013/jul/31/nsa-top-secret-program-online-data">XKeyscore</a> utilisent également des attaques passives sur le trafic HTTP pour recueillir des quantités massives de données relatives aux communications en ligne.</p><p>En revanche, d’autres outils disponibles gratuitement effectuent des <em>attaques de réseau actives</em>, où l'attaquant modifie le contenu ou redirige les communications. Ces outils varient du grave, tel que <a href="http://www.thoughtcrime.org/software/sslstrip/">sslstrip</a>, au ridicule, tel que le <a href="http://www.ex-parrot.com/pete/upside-down-ternet.html">Upside-Down-Ternet</a>. Bien que Upside-Down-Ternet soit une farce drôle, il est techniquement identique à des attaques potentiellement plus destructrices telles qu’une attaque injectant du code malveillant ou des renseignements inexacts dans des pages web ; en même temps, il montre que ces attaques sont assez faciles pour être des blagues. Les points d’accès Wi-Fi ont été connus pour injecter des publicités dynamiquement dans pages Web que visitent leurs utilisateurs, montrant que les attaques actives de réseau consitituent un modèle d'affaires viable. Des outils comme <a href="http://www.oxid.it/cain.html">Caïn and Abel</a> permettent une série d'attaques, y compris la redirection du trafic de réseau local à travers le système de l'attaquant. (Voir aussi <a href="http://arpspoof.sourceforge.net/">Arpspoof</a> et <a href="http://www.monkey.org/%7Edugsong/dsniff/">dsniff</a>).</p><p>Seul un mécanisme offrant (au minimum) l'authentification, la confidentialité et l'intégrité des données peuvent défendre contre une série d'attaques. Actuellement, le protocole HTTPS est notre meilleure option concernant les applications Web.</p><p>Cependant, il y a quelques pièges potentiels que les opérateurs de site doivent éviter afin de déployer HTTPS en toute sécurité.</p><h2>Contenu mixte</h2><p>En hébergeant une application via HTTPS, il ne doit y avoir aucun <em>contenu mixte</em> ; autrement dit, tout le contenu de la page doit être obtenu via HTTPS. Il est fréquent de voir une prise en charge partielle de HTTPS sur les sites, où les pages principales sont récupérés via HTTPS, mais certains ou tous les éléments multimédias, feuilles de style et JavaScript de la page sont récupérés via HTTP.</p><p>Cela est dangereux parce que même si le chargement de la page principale est protégé contre les attaques de réseau actives et passives, aucune des autres ressources ne l’est. Si une page charge du code JavaScript ou CSS via HTTP, un attaquant peut fournir un fichier de code falsifié et malveillant et prendre en charge le DOM (Document Object Model) de la page une fois chargé. Ainsi, l'utilisateur serait de retour à une situation non sécurisée. C’est pourquoi tous les principaux navigateurs avertissent les utilisateurs concernant les pages qui chargent du contenu mixte. Pareillement, il n'est pas sécurisé de référencer des images via HTTP : Que se passe-t-il par exemple si l'attaquant inverse les icônes pour Enregistrer et pour Sauvegarder un message dans une application de messagerie Web ? </p><p><strong>Vous devez fournir l’ensemble du domaine de l'application via HTTPS.</strong> Redirigez les requêtes HTTP avec des réponses HTTP 301 ou 302 à la ressource HTTPS équivalente. </p><p>Certains opérateurs de site fournissent uniquement la page de connexion via HTTPS, s’appuyant sur la théorie que seul le mot de passe de l’utilisateur est sensible. Les utilisateurs de ces sites <a>sont vulnérables aux attaques passives et actives.</a></p><p>Malheureusement, beaucoup de sites chargent aujourd’hui du contenu à partir de sites externes et utilisent du CDN (Content Delivery Network) qui ne prend pas en charge le protocole HTTPS. S'il n'est pas possible de servir ces ressources à partir de votre propre hôte ou d’un autre prenant en charge le protocole HTTPS, vous devriez inviter ces sites à commencer à offrir HTTPS dans l’immédiat.</p><h2>Sécurité et Cookies</h2><p>Comme Chris Palmer le décrit dans une <a href="https://www.isecpartners.com/media/12009/web-session-management.pdf">publication sur la gestion de session sécurisée pour les applications web</a>, les opérateurs de site doivent limiter les cookies sensibles (tels que les cookies utilisés pour l'authentification de l'utilisateur) à une origine sécurisée. Si un cookie a une large portée (avec l'attribut Domain dans le Set-Cookie défini en tant que : header), il peut « diivulguer » des informations à d'autres hôtes ou applications (potentiellement moins sécurisés) du même domaine.</p><p>L'application doit également définir l'attribut Secure sur le cookie lors de l'installation. Cet attribut indique au navigateur d’envoyer le cookie uniquement via un transport sécurisé (HTTPS) et jamais via un transport non sécurisé (HTTP).</p><h2>Utiliser le HTTP Strict Transport Security</h2><p><a href="https://en.wikipedia.org/wiki/Strict_Transport_Security">Le HTSTS (HTTP Strict Transport Security)</a> est une extension du protocole HTTP qui permet aux opérateurs de site d'ordonner aux navigateurs de demander à ce que le site utilise le protocole HTTPS.</p><p>Bien que tous les navigateurs ne prennent pas encore en charge HSTS, l’EFF invite tous ceux qui ne font pas (nous pensons surtout à vous, Apple et Microsoft) à suivre l'exemple donné par Google, Opera et Mozilla en adoptant ce mécanisme de sécurité utile. En effet, au bout du compte, nous prévoyons que HTTPS (et éventuellement de nouveaux protocoles tels que <a href="https://en.wikipedia.org/wiki/SPDY">SPDY</a> et <a href="https://en.wikipedia.org/wiki/QUIC">QUIC</a>) remplacera entièrement HTTP, tout comme SSH a remplacé Telnet et rsh.</p><p>Comme précaution supplémentaire, votre site doit prendre en charge la précharge du HSTS, qui empêche l'interception d'une requête HTTP si le navigateur n'a pas encore reçu d’en-tête HSTS valide depuis le serveur. La précharge du HSTS est implémentée via une liste de domaines avec option d’adhésion incluse dans Chrome, Google Chrome et Firefox. Voir la <a href="http://www.chromium.org/sts">page de Chromium</a> pour obtenir des instructions sur comment ajouter votre site à cette liste. Notez que vous devez également envoyer un en-tête de HSTS avec un max-age (âge maximum) d’une valeur supérieure à 18 semaines pour que Firefox inclue votre site dans sa liste de précharge HSTS. </p><p>Nous avons récemment activé HSTS et la précharge HSTS pour eff.org. Il nous a fallu moins d'une heure pour mettre cela en place, et nous avons trouvé le moyen de le faire sans rediriger de manière forcée les utilisateurs vers HTTPS, nous pouvons donc affirmer une préférence claire pour l'accès HTTPS en gardant le site toujours disponible via HTTP. Cela a fonctionné comme un charme et un pourcentage important de nos utilisateurs accède désormais automatiquement à notre site en HTTPS, peut-être sans même le savoir.</p><h2>Choisir des protocoles rigoureux et des suites de chiffrement</h2><p>Voici une brève liste de recommandations pour choisir les protocoles sécurisés et les suites de chiffrement d’un déploiement SSL :</p><ul><li>Désactivez la prise en charge de SSLv2, SSLv3, and TLS 1.0.</li><li>Activez la prise en charge TLS 1.1 et 1.2.</li><li>Désactivez les suites de chiffrement NULL, aNULL et eNULL, qui n'offrent pas en même temps le chiffrement et l’authentification.</li><li>Utilisez des clés privées qui sont au moins aussi sûres qu'une clé RSA de 2048 bits. </li><li>Préférez des suites de chiffrement qui incluent <b>l'échange de clés Diffie-Hellman éphémères</b>. Celles-ci offrent le caractéristique important de <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">Perfect Forward Secrecy</a> (Confidentialité persistante parfaite), qui empêche le décryptage de votre trafic Web récent si votre clé privée SSL est compromise à l’avenir. </li><li>Désactivez les suites de chiffrement avec des tailles de clés inférieures à 128 bits pour le chiffrement. </li><li>Désactivez les suites de chiffrement utilisant MD5 pour le hachage. SHA-1 est également déconseillé mais peut être requis pour la compatibilité avec TLS 1.0 et SSLv3.</li><li>Désactivez les suites de chiffrement qui utilisent RC4 pour le chiffrement. AES-CBC est préférable au RC4 mais vulnérable à une attaque <a href="https://www.imperialviolet.org/2011/09/23/chromeandbeast.html">BEAST</a>. Ainsi, AES-GCM est souvent recommandé. </li><li>Désactivez la compression de TLS afin d'éviter l'attaque <a href="https://en.wikipedia.org/wiki/CRIME_%28security_exploit%29">CRIME</a>. </li><li>Offrez uniquement la prise en charge de renégociations de TLS sécurisées conformes à <a href="http://www.ietf.org/rfc/rfc5746.txt">RFC 5746</a>, ou désactivez complètement la renégociation TLS.</li></ul><p>Un outil utile pour tester les faiblesses connues dans un déploiement existant de HTTPS est le <a href="https://www.ssllabs.com/ssltest/">SSL Server Test de Qualys.</a></p><h2>Préoccupations en matière de rendement</h2><p>Plusieurs opérateurs de site indiquent qu'ils ne peuvent pas migrer leurs sites vers HTTPS pour des raisons de rendement. Cependant, la plupart des gens qui disent cela n'ont pas réellement mesuré la perte de rendement, n’ont peut-être pas du tout mesuré le rendement, et n'ont pas profilé ni optimisé le comportement de leur site. Habituellement, les sites ont une latence beaucoup plus élevée ou un débit beaucoup plus bas que nécessaire même en hébergeant le site via HTTP, ce qui indique que le HTTPS n'est pas le problème.</p><p>La clé du problème de rendement se trouve souvent à la couche de contenu ou encore à la couche de base de données. Après tout, les applications Web sont fondamentalement gourmandes en E/S. Prenez en considération <a href="http://gmailblog.blogspot.com/2008/05/need-for-speed-path-to-faster-loading.html">cette sagesse des développeurs de Gmail </a>:</p><blockquote><p>Nous avons d’abord répertorié toutes les transactions entre le navigateur et les serveurs de Google, à partir de l'instant ou le bouton « Se connecter » est appuyé. Pour ce faire, nous avons utilisé un grand nombre d'outils de développement Web, comme <a href="http://httpwatch.com/">Httpwatch</a>, <a href="http://www.wireshark.org/">WireShark</a> et <a href="http://www.fiddlertool.com/fiddler/">Fiddler</a>, ainsi que nos propres systèmes de mesure de rendement. [...] </p><p>Nous avons passé des heures penchés sur ces traces pour voir exactement ce qui se passait entre le navigateur et Gmail pendant la séquence de connexion, et nous avons trouvé qu'il y avait entre quatorze et vingt-quatre requêtes HTTP pour pouvoir charger et afficher une boîte de réception. Pour mettre ces chiffres en perspective, la page d’accueil d’un site populaire d’actualités en ligne nécessite autour de 180 demandes pour charger entièrement, comme je l'ai vérifié hier. Mais quand nous avons examiné ces demandes, nous avons réalisé que nous pouvions faire mieux. Nous avons décidé d'attaquer le problème à partir de plusieurs angles à la fois : réduire le nombre de requêtes globales, rendre plus de demandes mises en cache par le navigateur et réduire les frais généraux de chaque demande.</p><p>Nous avons fait de bons progrès sur tous les fronts. Nous avons réduit le poids de chaque requête proprement dite en éliminant ou en réduisant la portée de certains de nos cookies. Nous avons fait en sorte que toutes nos images soient mises en cache par le navigateur, et nous avons consolidé les images de petites icônes dans de simples meta-images, une technique connue comme spriting. Nous avons combiné plusieurs demandes en une seule demande et réponse combinée. Le résultat est qu'il faut maintenant aussi peu que quatre demandes après avoir cliqué sur le bouton « Se connecter » pour afficher votre boîte de réception.</p></blockquote><p><a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">Adam Langley de Google fournit des détails supplémentaires</a> : </p><blockquote>Pour cela nous n’avons pas eu besoin de déployer <em>de machine supplémentaire</em> ou <em>de matériel spécial</em>. Sur nos ordinateurs frontaux de production, SSL/TLS consomme mois de 1 % de CPU, moins de 10 Ko de mémoire par connexion et moins de 2 % de la charge réseau. Beaucoup de gens croient que SSL consomme beaucoup de temps processeur et nous espérons que les chiffres ci-dessus (rendus publics pour la première fois) aideront à dissiper ce fait. [italiques dans l'original] </blockquote><p>Faut-il s'étonner que Gmail fonctionne bien, même s’il utilise exclusivement HTTPS ? Les opérateurs de site peuvent apporter des améliorations graduelles en ajustant progressivement leurs applications Web. Chris a fait un exposé à cet effet à <a href="http://assets.en.oreilly.com/1/event/22/High%20Performance,%20Low%20Cost,%20and%20Strong%20Security_%20Pick%20Any%20Three%20Presentation.pdf">Web 2.0 Expo 2009</a>.</p><h2>Conclusion</h2><p>Le protocole HTTPS fournit la base de la sécurité pour les utilisateurs d'applications Web, et il n'y a aucune raison relative au rendement ou aux coûts pour rester sur du HTTP. Les fournisseurs d'applications Web <a href="http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1421553">sapent leurs modèles d'entreprise</a> lorsque, en continuant à utiliser le protocole HTTP, ils permettent à un large éventail d'attaquants n'importe où sur l'internet de compromettre les informations de leurs utilisateurs.</p>
