Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 740][body][0][summary
source: <h3>Which apps and tools actually keep your messages safe?</h3> <div class="section"> In the face of widespread Internet surveillance, we need a secure and practical means of talking to each other from our phones and computers. Many companies offer “secure messaging” products—but are these systems actually secure? We decided to find out, in the first phase of a new EFF Campaign for Secure &amp; Usable Crypto. This scorecard represents only the first phase of the campaign. In later phases, we are planning to offer closer examinations of the usability and security of the tools that score the highest here. As such, <span style="text-decoration: underline;">the results in the scorecard below should not be read as endorsements of individual tools or guarantees of their security</span>; they are merely indications that the projects are on the right track. For practical advice and tutorials on how to protect your online communication against surveillance, check out EFF's <a href="https://ssd.eff.org/">Surveillance Self-Defense</a> guide. </div>
fr: <h3>Quels outils et applications protègent réellement vos messages ?</h3> <div class="section"> Face à la cybersurveillance généralisée, nous avons besoin d'un moyen sûr et pratique pour parler les uns aux autres de nos téléphones et ordinateurs. Beaucoup de compagnies offrent des produits de « messagerie sécurisée » — mais ces systèmes sont-ils réellement sûrs ? Nous avons décidé de le découvrir, dans la première phase d'une nouvelle campagne de l'EFF pour une cryptographie sécurisée et facile d’utilisation. Cette fiche d’évaluation représente seulement la première phase de cette campagne. Dans les phases ultérieures, nous prévoyons d’offrir des examens plus étroits concernant la convivialité et la sécurité des outils dont le score est le plus élevé. Par conséquent, <span style="text-decoration: underline;">les résultats de la fiche d’évaluation ci-dessous ne devraient pas être interprétés comme une approbation des outils individuels ou une garantie de leur sécurité</span> ; il s’agit simplement d’éléments indiquant que les projets sont sur la bonne voie. Pour des conseils pratiques et des tutoriels sur la façon de protéger vos communications en ligne face à la surveillance, consultez le <a href="https://ssd.eff.org/">guide d’autoprotection digitale contre la surveillance</a> de l'EFF. </div>

# 740][title_field][0][value
source: Secure Messaging Scorecard
fr: Fiche d’évaluation de messagerie sécurisée

# 742][menu:item:1956:title
source: Creating HTTPS Everywhere Rulesets
fr: Créer des jeux de règle pour HTTPS Everywhere

# 744][menu:item:1955:title
source: How to Deploy HTTPS Correctly
fr: Comment déployer HTTPS correctement

# 745][menu:item:1957:title
source: Report Bugs / Hack On The Code
fr: Rapporter un bogue / Bidouiller le code

# 747][singular
source: HTTPS Everywhere is a Firefox, Chrome, and Opera extension that encrypts your communications with many major websites, making your browsing more secure.
fr: HTTPS Everywhere est une extension pour Firefox, Chrome et Opera qui chiffre vos communications sur de nombreux sites majeurs, rendant votre navigation plus sûre.

# 748][singular
source: Encrypt the web: Install HTTPS Everywhere today.
fr: Chiffrez le Web : Installez HTTPS Everywhere aujourd'hui

# 749][singular
source: Install in Firefox
fr: Installer pour Firefox

# 750][singular
source: Install in Firefox for Android
fr: Installer pour Firefox sur Android

# 751][singular
source: Install in Chrome
fr: Installer pour Chrome

# 752][singular
source: Install in Opera
fr: Installer pour Opera

# 753][singular
source: Recent Releases
fr: Versions récentes

# 754][singular
source: Stable releases for Firefox:
fr: Versions stables pour Firefox :

# 755][singular
source: Stable releases for Chrome, Chromium, and Opera 15+:
fr: Versions stables pour Chrome, Chromium et Opera 15+ :

# 757][singular
source: Note: If you install the standalone .crx (i.e. not from the Chrome Web Store), and you are using Windows, Chrome will automatically disable the extension on each restart. You may be able to work around by using developer mode. See <a href="https://github.com/EFForg/https-everywhere/issues/819">this issue</a>.
fr: Remarque: Si vous utilisez Windows et installez le .crx autonome (c.-à-d. pas à partir du Chrome Web Store), Chrome désactivera automatiquement l'extension à chaque redémarrage. Vous pourrez peut-être contourner cela en utilisant le mode développeur. Voir <a href="https://github.com/EFForg/https-everywhere/issues/819">le souci</a> en question.

# 758][singular
source: Featured Tools
fr: Outils recommandés

# 759][singular
source: All Tools
fr: Tous les outils

# 760][singular
source: Yes
fr: Oui

# 761][singular
source: No
fr: Non

# 762][singular
source: Encrypted in transit?
fr: Chiffré en transit ?

# 763][singular
source: Encrypted so the provider can’t read it?
fr: Chiffré afin que le fournisseur ne puisse pas le lire ?

# 764][singular
source: Can you verify contacts’ identities?
fr: Pouvez-vous vérifier l'identité des contacts ?

# 765][singular
source: Are past comms secure if your keys are stolen?
fr: Les dernières communications sont-elles en sécurité si les clés sont volées ?

# 766][singular
source: Is the code open to independent review?
fr: Le code est-il ouvert à un examen indépendant ?

# 767][singular
source: Is security design properly documented?
fr: La conception de sécurité est-elle bien documentée ?

# 768][singular
source: Has there been any recent code audit?
fr: Y a-t-il eu de vérification récente du code ?
