Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 739][title_field][0][value
source: How to Deploy HTTPS Correctly
fr: Comment déployer HTTPS correctement
