Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1207][body][0][value
source: <a name="about"></a> <div class="section"> <h2>About</h2> For years, privacy and security experts worldwide have called on the general public to adopt strong, open-source cryptography to protect our communications. The Snowden revelations have confirmed our worst fears: governments are spying on our digital lives, grabbing up communications transmitted in the clear. Given widespread government surveillance, why don’t people routinely use tools to encrypt their communications? Wouldn’t we all communicate a little more freely without the shadow of surveillance? It boils down to two things: security and usability. Most of the tools that are easy for the general public to use don’t rely on security best practices--including end-to-end encryption and open source code. Messaging tools that are really secure often aren’t easy to use; everyday users may have trouble installing the technology, verifying its authenticity, setting up an account, or may accidentally use it in ways that expose their communications. EFF, in collaboration with Julia Angwin at ProPublica and Joseph Bonneau at the Princeton Center for Information Technology Policy, are joining forces to launch a campaign for secure and usable crypto. We are championing technologies that are strongly secure and also simple to use. The Secure Messaging Scorecard examines dozens of messaging technologies and rates each of them on a range of security best practices. Our campaign is focused on communication technologies -- including chat clients, text messaging apps, email applications, and video calling technologies. These are the tools everyday users need to communicate with friends, family members, and colleagues, and we need secure solutions for them. We chose technologies that have a large user base--and thus a great deal of sensitive user communications--in addition to smaller companies that are pioneering advanced security practices. We’re hoping our scorecard will serve as a race-to-the-top, spurring innovation around strong crypto for digital communications. </div> <a name="methodology"></a> <div class="section"> <h2>Methodology</h2> <p dir="ltr">Here are the criteria we looked at in assessing the security of various communication tools.</p> <p dir="ltr"><a name="encrypted"></a><strong>1. Is your communication encrypted in transit?</strong> This criterion requires that all user communications are encrypted along all the links in the communication path. Note that we are not requiring encryption of data that is transmitted on a company network, though that is ideal. We do not require that metadata (such as user names or addresses) is encrypted.</p> <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong>2.</strong> <strong>Is your communication encrypted with a key the provider doesn't have access to?</strong> This criterion requires that all user communications are end-to-end encrypted. This means the keys necessary to decrypt messages must be generated and stored at the endpoints (i.e. by users, not by servers). The keys should never leave endpoints except with explicit user action, such as to backup a key or synchronize keys between two devices. It is fine if users' public keys are exchanged using a centralized server.</p> <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong>3.</strong> <strong>Can you independently verify your correspondent's identity?</strong>{tjiid1207-43}This criterion requires that a built-in method exists for users to verify the identity of correspondents they are speaking with and the integrity of the channel, even if the service provider or other third parties are compromised. Two acceptable solutions are:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a>An interface for users to view the fingerprint (hash) of their correspondent's public keys as well as their own, which users can verify manually or out-of-band.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a>A key exchange protocol with a short-authentication-string comparison, such as the <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">Socialist Millionaire's protocol</a>.</p> </li> </ul><p dir="ltr">Other solutions are possible, but any solution must verify a binding between users and the cryptographic channel which has been set up. For the scorecard, we are simply requiring that a mechanism is implemented and not evaluating the usability and security of that mechanism.</p> <p dir="ltr"><a name="pfs"></a><strong>4.</strong> <strong>Are past communications secure if your keys are stolen?</strong></p> This criterion requires that the app provide <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">forward secrecy</a>, that is, all communications must be encrypted with ephemeral keys which are routinely deleted (along with the random values used to derive them). It is imperative that these keys cannot be reconstructed after the fact by anybody even given access to both parties' long-term private keys, ensuring that if users choose to delete their local copies of correspondence, they are permanently deleted. Note that this criterion requires criterion 2, end-to-end encryption. <p dir="ltr"><em style="line-height: 20.0063037872314px;">Note: For this phase of the campaign, we accept a hybrid forward-secrecy approach with forward secrecy on the transport layer (for example through TLS with a Diffie-Hellman cipher suite) and non-forward-secret end-to-end encryption, plus an explicit guarantee that ciphertexts are not logged by the provider. This is a compromise as it requires trusting the provider not to log ciphertexts, but we prefer this setup to having no forward secrecy at all.</em></p> <p dir="ltr"><a name="open"></a><strong>5.</strong> <strong>Is the code open to independent review?</strong></p> This criterion requires that sufficient source-code has been published that a compatible implementation can be independently compiled. Although it is preferable, we do not require the code to be released under any specific free/open source license. We only require that all code which could affect the communication and encryption performed by the client is available for review in order to detect bugs, back doors, and structural problems. <a name="open"></a><em>Note: when tools are provided by an operating system vendor, we only require code for the tool and not the entire OS. This is a compromise, but the task of securing OSes and updates to OSes is beyond the scope of this project.</em> <a name="open"></a> <p dir="ltr"><a name="open"></a><a name="documented"></a><strong>6. Is the crypto design well-documented?</strong></p> This criterion requires clear and detailed explanations of the cryptography used by the application. Preferably this should take the form of a white-paper written for review by an audience of professional cryptographers. This must provide answers to the following questions: <ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Which algorithms and parameters (such as key sizes or elliptic curve groups) are used in every step of the encryption and authentication process</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>How keys are generated, stored, and exchanged between users</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>The life-cycle of keys and the process for users to change or revoke their key</p> </li> <li dir="ltr"> <p dir="ltr"><a name="documented"></a>A clear statement of the properties and protections the software aims to provide (implicitly, this tends to also provide a threat model, though it's good to have an explicit threat model too). This should also include a clear statement of scenarios in which the protocol is not secure. </p> </li> </ul><a name="documented"></a> <p dir="ltr"><a name="documented"></a><a name="audited"></a><strong>7.</strong> <strong>Has there been an independent security audit?</strong></p> <p dir="ltr"><a name="audited"></a>This criterion requires an independent security review has been performed within the 12 months prior to evaluation. This review must cover both the design and the implementation of the app and must be performed by a named auditing party that is independent of the tool's main development team. Audits by an independent security team within a large organization are sufficient. Recognizing that unpublished audits can be valuable, we do not require that the results of the audit have been made public, only that a named party is willing to verify that the audit took place.</p> <p dir="ltr">We've discussed this criterion in depth in a Deeplinks post: <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">What Makes a Good Security Audit?</a>{tjiid1207-148} </p> </div> <a name="about"></a> <div class="section"><a name="changelog"></a> <h2>Changelog</h2> Entries in the <a href="#">Secure Messaging Scorecard</a> were checked with the listed projects and companies when the Scorecard launched on 2014-11-06. Updates will be made if the listees or others inform us of changes or inaccuracies. A log of all such changes is below: <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">2015-06-12</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We removed Secret as the service was <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">shut down</a> in May 2015.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-03-06</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited QQ for completing an independent internal security audit (<span style="color: #008000;">✓</span>)<span style="line-height: 20.0063037872314px;">.</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-02-17</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited Telegram (both secret and regular mode) for undergoing a code audit in February 2015 <span style="line-height: 20.0063037872314px;">(</span><span style="line-height: 20.0063037872314px; color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">).</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-01-29</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li><span style="line-height: 20.0063037872314px;">We have credited QQ for encrypting messages in transit </span><span style="line-height: 20.0063037872314px;">(</span><span style="color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">). Though QQ does not use TLS/SSL, which is considered best practice, they have implemented a custom protocol for message encryption in transit.</span></li> <li><span style="line-height: 20.0063037872314px;">We have clarified our scoring for forward secrecy (criterion #4).</span></li> </ul></li> <li><strong style="line-height: 1.538em;">2015-01-05</strong><span style="line-height: 1.538em;"> :</span> <ul><li><span style="line-height: 1.538em;">We have split the scoring for Telegram into two rows: baseline Telegram and Telegram secret chats. Baseline Telegram chats are not end-to-end encrypted so that the provider can't read them (</span><span style="color: #ff0000;" data-mce-mark="1">✘</span><span style="line-height: 1.538em;">). Telegram secret chats are, and in addition Telegram now </span><a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;">supports perfect forward secrecy</a><span style="line-height: 1.538em;"> so that messages can be securely deleted (</span><span style="color: #008000;" data-mce-mark="1">✓</span><span style="line-height: 1.538em;">)</span></li> <li><span style="line-height: 1.538em;">Wickr now provides the ability to verify contact's identities by exposing key fingerprints, which can be verified out-of-band or through in-band video. (</span><span style="line-height: 1.538em;">✓</span><span style="line-height: 1.538em;">)</span></li> </ul></li> </ul><ul><li><strong>2014-11-14</strong> : <ul><li>RIM has told us that BlackBerry Messenger Protected uses an <a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf">out-of-band passphrase exchange</a> and <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)">EC-SPEKE</a> to perform identity verification. (✓) RIM has also told us that BBM Protected receives security reviews by an internal security team. (✓)</li> <li>Viber has received a recent external security audit from EY Advanced Security Center. (✓)</li> <li>Pidgin has documented a number of auditing processes including regular use of static analysis tools and audits by a team at Cisco Talos. The Pidgin developers were clear that they do not know how thorough and complete these audits have been, but the audits nonetheless <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">meet our criteria</a>. (✓) Although auditing of Pidgin improves the security of the related Adium project (the projects share many components including libpurple, libotr, and libxml2), the Adium developers tell us that besides occasional static analysis by the developers themselves they are not aware of any independent auditing effort that addresses the Adium-specific code. So for the time being that project will not receive an audit checkmark.</li> </ul></li> <li><strong>2014-11-10</strong> : Skype check mark for end-to-end encryption <a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption">removed</a>. (✘)</li> <li><strong>2014-11-04</strong> : Snapchat app has audits from an internal security team. (✓)</li> </ul></div>
tr: <a name="about"></a> <div class="section"> <h2>Hakkında</h2> Gizlilik ve güvenlik uzmanları, haberleşmelerini korumak amacıyla halkı yıllardır güçlü, açık kaynak kodlu kriptografi kullanmaya davet etti. Snowden'ın açığa çıkardığı belgeler, korkularımızı doğruladı: devletler dijital yaşamlarımızı izliyor, açıktaki haberleşmelerimizi topluyordu. Devletlerin yaygın bir şekilde yaptığı bu izlemeye rağmen, insanlar niçin rutin olarak haberleşmelerini şifrelemiyor? İzlenmenin gölgesinde olmadan biraz daha rahat bir şekilde haberleşemez miyiz? Sorun iki şeyden ibaret: güvenlik ve kullanılabilirlik. Halkın kolayca kullanabileceği araçların çoğu, uçtan uca şifreleme ya da açık kaynak kodlu olma gibi önemli güvenlik uygulamalarına dayanmıyor. Gerçekten güvenilir olan mesajlaşma araçlarını kullanmak genellikle kolay değildir; sıradan bir kullanıcı teknolojiyi kurmakta, doğruluğunu onaylamakta, bir hesap yaratmakta zorlanabilir ya da aracı haberleşmelerini yanlışlıkla ortaya dökecek bir şekilde kullanabilir. EFF olarak, ProPublica yazarı Julia Angwin ve Princeton Center for Information Technology Policy'den Joseph Bonneau ile birlikte güçlerimizi birleştirerek güvenli ve kullanışlı kripto için bir kampanya başlatıyoruz. Fazlasıyla güvenli ve kullanımı kolay olan teknolojileri savunuyoruz. Güvenli Mesajlaşma Karnesi, düzinelerce mesajlaşma teknolojisini inceler ve bunların her birini en iyi güvenlik uygulamalarını baz alarak derecelendirir. Kampanyamız haberleşme teknolojilerine odaklanmıştır -- bunlara chat uygulamaları, metin mesajı uygulamaları, email uygulamaları ve video arama teknolojileri dahildir. Bu araçları kullanarak insanlar her gün arkadaşlarıyla, aile üyeleriyle ve iş arkadaşlarıyla haberleşir, ve bu haberleşmeler için güvenli çözümlere ihtiyacımız var. Gelişmiş güvenlik uygulamaları konusunda lider olan küçük firmaların yanında, büyük kullanıcı kitlelerine (ve dolayısıyla birçok kullanıcının haberleşmelerine sahip) olan teknolojileri seçiyoruz. Karnemizin bu firmalar arasında bir zirveye oynama rekabetini başlatmasını ve dijital haberleşmeler için güçlü kriptonun etrafındaki teknolojilerin gelişimini teşvik etmesini umut ediyoruz. </div> <a name="methodology"></a> <div class="section"> <h2>Metodoloji</h2> <p dir="ltr">Farklı haberleşme araçlarının güvenliğini değerlendirirken dikkat ettiğimiz kriterler şu şekildedir:</p> <p dir="ltr"></p><a name="encrypted"></a> <strong>1. Haberleşmeleriniz taşıma sırasında şifreli mi?</strong> Bu kriter, bir kullanıcının haberleşmelerinin tamamının haberleşme ağının tüm bağlantıları boyunca şifrelenmiş olmasını gerektirir. Verilerin şirket ağı üzerinde aktarılırken şifrelenmiş olması ideal olsa da, bunu gerekli kılmadığımızı belirtelim. Metaverinin (kullanıcının ismi veya adresi gibi) şifrelenmiş olmasını da şart koşmuyoruz. <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong> 2.</strong><strong> Haberleşmeleriniz servis sağlayıcısının erişemeyeceği bir anahtarla mı şifrelenmiş?</strong></p> Bu kriter, tüm haberleşmelerin uçtan uca şifrelenmiş olmasını gerektirir. Bu, mesajların şifrelerinin çözülmesi için gereken anahtarların uç noktalarda (kullanıcılar tarafından, sunucu tarafından değil) yaratılması ve saklanması anlamına gelir. Yedekleme veya iki cihaz arasında senkronizasyon gibi net bir kullanıcı müdahalesi gerektiren işlemler haricinde, anahtarlar uç noktalardan ayrılmamalıdır. Kullanıcıların açık (public) anahtarlarının değiş tokuşunun merkezi sunucularda yapılmasında bir sakınca yoktur. <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong> 3.</strong><strong> Görüştüğünüz kişinin kimliğini bağımsız bir şekilde doğrulayabiliyor musunuz?</strong> Bu kriter, servis sağlayıcısı ya da üçüncü partilerin güvenliği ihlal edilmiş olsa bile, kullanıcıların görüştükleri kişinin kimliğini ve görüştükleri kanalın bütünlüğünü (integrity) doğrulayabilecekleri yerleşik bir yöntemin varlığını şart koşar. Kabulü mümkün iki farklı yöntem:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a> Kullanıcıların şahsen ya da bant dışı doğrulayabilecekleri, kendilerinin ve görüştükleri kişilerin parmak izini (hash) görebileceği bir arayüz.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a> <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">Sosyalist Milyoner protokolü</a> gibi bir kısa kimlik doğrulama dizisine (short authentication string) sahip bir anahtar değiş tokuş protokolü. Diğer çözümler de mümkündür, ancak tüm çözümler kullanıcılar ve kriptografik kanallar arasında kurulan bağlantıyı doğrulamalıdır. Karne için, mekanizmanın uygulanmış olmasını gerekli kılıyoruz ve bu uygulamanın kullanılabilirliğini ya da güvenliğini değerlendirmiyoruz.</p> <p dir="ltr"></p><a name="pfs"></a><strong></strong> <strong> </strong><strong>4.</strong><strong></strong> <strong> </strong><strong>Anahtarlarınız çalındıysa geçmişteki haberleşmeleriniz güvende mi?</strong> Bu kriter, uygulamanın <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">mükemmel iletme gizliliği</a> (perfect forward secrecy) sağlamasını şart koşar. İletme gizliliği, tüm haberleşmelerin (anahtarları yaratan rastgele değerlerle birlikte) rutin olarak silinen kısa süreli anahtarlarla şifrelenmesini zorunlu kılar. Anahtarların bu işlemden sonra, iki tarafın uzun süreli gizli anahtarlarına erişimi olsa bile, herhangi biri tarafından tekrardan oluşturulamaması gerekir. Kullanıcıların görüşmelerinin yerel kopyalarını silmeyi tercih etmeleri durumunda, bu işlem görüşmelerinin kalıcı olarak silindiğini garantiler. Bu kriterin 2. kriteri, yani uçtan uca şifrelemeyi zorunlu kıldığını dikkate alın. <p dir="ltr"></p> <em style="line-height: 20.0063037872314px;"> </em><em style="line-height: 20.0063037872314px;">Not: Kampanyanın bu aşamasında, karma bir iletme gizliliği yaklaşımını kabul ediyoruz. Yani şu an için, taşıma katmanında iletme gizliliğini (örneğin Diffie-Hellman cipher suite'ine sahip bir TLS bağlantısı), iletme gizliliğine sahip olmayan uçtan uca şifrelemeyi ve ek olarak şifreli metinlerin (ciphertext) servis sağlayıcısı tarafından kayıt altına alınmadığının açık bir garantisini talep ediyoruz.</em> <p dir="ltr"></p><a name="open"></a><strong></strong> <strong> </strong><strong>5.</strong><strong></strong> <strong> </strong><strong>Uygulamanın kodu bağımsız incelemeye açık mı?</strong> Bu kriter, uyumlu bir uygulamanın bağımsızca derlenebilmesi (compile edilebilmesi) için yeteri kadar kaynak kodunun yayınlanmış olmasını gerektirir. Her ne kadar tercih sebebi olsa da, kodun herhangi bir açık kaynak kod lisansı altında yayınlanmasını gerekli görmüyoruz. Bug'ların, arka kapıların ve yapısal problemlerin incelenebilmesi için, yalnızca uygulama tarafından gerçekleştirilen şifrelemeyi ve haberleşmeyi etkileyebilecek kodun elde edilebilir olmasını şart koşuyoruz. <a name="open"></a><em></em> <em> </em><em>Not: Araçlar işletim sistemi üreticisi tarafından sağlanıyorsa, işletim sisteminin değil, yalnızca aracın kodunun erişilebilir olmasını şart koşuyoruz. Burada ödün veriyoruz, çünkü işletim sistemlerinin ve işletim sistemlerine gelen güncellemelerin güvence altına alınması görevi bu projenin kapsamı dışındadır.</em><a name="open"></a> <p dir="ltr"></p><a name="open"></a><a name="documented"></a><strong></strong> <strong> </strong><strong>6. Kripto tasarımı iyice belgelenmiş mi?</strong> Bu kriter, uygulama tarafından kullanılan kriptografinin izahının detaylı ve net bir şekilde yapılmış olmasını gerektirir. Bu belgelenmenin, white paper olarak profesonal bir kriptocu kitlesi tarafından incelemesi için yazılmış olması tercih sebebidir. Bu dökümanın aşağıdaki sorulara cevap vermesi beklenir: <ul><li dir="ltr"> <p dir="ltr"></p><a name="documented"></a> Doğrulama ve şifrelemenin her adımında hangi algoritmalar ve parametreler (anahtar boyutu, eliptik eğri grupları gibi) kullanıldı</li> </ul><ul><li dir="ltr"> <p dir="ltr"></p><a name="documented"></a> Anahtarlar nasıl yaratılıyor, nasıl saklanıyor ve kullanıcılar arasında nasıl değiş tokuş edilebiliyor</li> </ul><ul><li dir="ltr"> <p dir="ltr"></p><a name="documented"></a> Anahtarların kullanım süresi ve kullanıcıların anahtarlarının değişim ve iptal edilmesi süreci</li> <li dir="ltr"> <p dir="ltr"></p><a name="documented"></a> Yazılımın sağlamayı amaçladığı özelliklerin ve korumaların net bir beyanı (bu dolaylı olarak bir tehdit modeli sağlar, ancak net bir tehdit modeline ayrı olarak sahip olmak da iyidir). Ayrıca bu beyanda protokolün ne tür koşullarda güvenli olmadığını da belirtmelisiniz.</li> </ul><a name="documented"></a> <p dir="ltr"></p><a name="documented"></a><a name="audited"></a><strong></strong> <strong> </strong><strong>7.</strong><strong></strong> <strong> </strong><strong>Yakın bir zamanda bağımsız bir güvenlik denetimi yapıldı mı?</strong> <p dir="ltr"></p><a name="audited"></a> Bu kriter değerlendirmeden 12 ay önce bağımsız bir güvenlik incelemesinin yapılmış olmasını gerektirir. Bu inceleme yazılımın tasarımını ve uygulamasını kapsamalıdır ve aracın ana geliştirme takımından bağımsız bir isme sahip bir denetim grubu tarafından gerçekleştirilmelidir. Bu denetimin büyük bir organizasyonun içinde yer alan bir güvenlik ekibi tarafından yapılması yeterlidir. Yayınlanmamış denetim raporlarının değerli olduğunun farkındayız ve bu yüzden bu raporun sonuçlarının herkese duyurulmasını gerek görmüyoruz. Ancak denetimi yapan grubun denetimin gerçekleştiğini doğrulamasını şart koşuyoruz. <p dir="ltr"></p> Bu kriteri bir Deeplink yazısında derinlemesine konuştuk (İngilizce): <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit"></a> <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit"> </a><a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">What Makes a Good Security Audit?</a></li> </ul></div> <a name="about"></a> <div class="section"><a name="changelog"></a>Changelog <a href="#">Güvenli Mesajlaşma Karnesi</a>'ndaki girdiler, listelenmiş projeler ve şirketlerle birlikte karne yayınlandığında (06-11-2014) kontrol edildi. Listelenenler veya başkaları bir değişiklik veya yanlışlık olması durumunda bizi uyardıklarında, düzeltmeler yapılacaktır. Bu anlamda yapılan değişikliklerin kayıtları aşağıdadır: <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">12-06-2015</strong><span style="line-height: 20.0063037872314px;"></span>: <ul><li>Mayıs 2015'te Secret'ı <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset"></a><a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset"> </a><a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">kapandığı</a>için listeden kaldırdık.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;"> </strong><strong style="line-height: 20.0063037872314px;">06-03-2015</strong><span style="line-height: 20.0063037872314px;"></span>: <ul><li>Dahili bağımsız güvenlik denetimini tamamladığı için QQ'ya gereken notu verdik (<span style="color: #008000;"></span>)<span style="line-height: 20.0063037872314px;"></span>.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;"> </strong><strong style="line-height: 20.0063037872314px;">17-02-2015</strong><span style="line-height: 20.0063037872314px;"></span>: <ul><li>✓Şubat 2015'te kod denetiminden (gizli ve normal modu için) geçen Telegram'a gereken notu verdik <span style="line-height: 20.0063037872314px;"></span>(<span style="line-height: 20.0063037872314px; color: #008000;"></span> ✓<span style="line-height: 20.0063037872314px;"></span> ).</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;"> </strong><strong style="line-height: 20.0063037872314px;">29-01-2015</strong><span style="line-height: 20.0063037872314px;"></span>: <ul><li>Taşıma sırasında mesajları şifrelediği için QQ'ya gereken notu verdik <span style="line-height: 20.0063037872314px;"></span>(<span style="color: #008000;"></span> ✓<span style="line-height: 20.0063037872314px;"></span> ). QQ, en iyi uygulama yöntemi olarak görülen TLS/SSL'i kullanmamasına rağmen, taşıma sırasında mesajların şifrelenmesi için özel bir protokol kullanmaya başladı.</li> <li>İletme gizliliğiyle ilgili skor verme yöntemimizi netleştirdik (4 numaralı kriter).</li> </ul></li> <li><strong style="line-height: 1.538em;"> </strong><strong style="line-height: 1.538em;">05-01-2015</strong><span style="line-height: 1.538em;"></span>: <ul><li>Telegram'a verdiğimiz skoru iki satıra ayırdık: Temel Telegram ve Telegram gizli sohbetler (secret chats). Temel Telegram sohbetleri, servis sağlayıcısının okuyamayacağı bir şekilde uçtan uca şifreli değil. (<span style="color: #ff0000;" data-mce-mark="1"></span>✘<span style="line-height: 1.538em;"> ).</span></li> </ul></li> <li>). Telegram gizli sohbetleri, Telegram'a ek olarak <a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;"></a><a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;">mükemmel iletme özelliğini destekleyerek</a><span style="line-height: 1.538em;"></span>mesajlarınızın güvenli bir şekilde silinmesine olanak sağlar (<span style="color: #008000;" data-mce-mark="1"></span> ✓<span style="line-height: 1.538em;"></span> )</li> </ul></ul><ul><li>Wickr, anahtar parmak izlerini açığa çıkarma özelliğini getirerek, kişi listesindeki kimliklerin doğruluğunu sağlamaya olanak tanımaya başladı. Bu doğrulama bant dışı veya bant içi yapılabilir. (<span style="line-height: 1.538em;"></span>✓<span style="line-height: 1.538em;"></span>)</li> </ul><ul><li><strong>14-11-2014</strong>: <ul><li>RIM, BlackBerry Messenger Protected'ın kimlik doğrulaması için <a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf"></a><a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf"> </a><a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf">bant dışı şifre değiş tokuşunu</a>ve <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)"></a> <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)"> </a><a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)">EC-SPEKE'yi</a> kullandığını bize iletti. (✓) RIM bize ayrıca BBM Protected'ın dahili bir güvenlik ekibi tarafından güvenlik incelemelerinin yapıldığını söyledi. (✓)</li> <li>Viber'ın EY Advanced Security Center tarafından harici güvenlik denetimi yapıldı. (✓)</li> <li>Pidgin, Cisco Talos tarafından yapılmış statik analiz araçlarının sıradan kullanımı ve kontrolüyle ilgili birçok sayıdaki denetim işlemlerini belgeledi. Pidgin geliştiricileri bu denetimlerin ne denli dikkatli ve eksiksiz olduğunu bize belirtmediler ancak yine de bu denetimler <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit"></a><a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit"> </a><a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">bizim kriterlerimize uyuyor</a>. (✓) Pidgin'in denetimi, Pidgin'le ilişkili Adium projesinin güvenliğini arttırıyor olsa da (iki proje de libpurple, libotr ve libxml2 gibi birçok bileşeni ortaklaşa kullanıyor), Adium geliştiricileri, geliştiricilerin kendileri tarafından yapılmış sıradan bir statik analizin dışında Adium'a özel kodun denetimiyle ilgili bağımsız bir incelemeden haberdar olmadıklarını belirttiler. Proje bu yüzden şu an için bizden denetim onayını almayacak.</li> </ul></li> <li><strong> </strong><strong>10-11-2014</strong>: Skype'ın uçtan uca şifreleme onay imi <a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption"></a><a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption"> </a><a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption">kaldırıldı</a> . (✘)</li> <li><strong> </strong><strong>04-11-2014</strong>: Snapchat'in denetimleri dahili bir güvenlik ekibi tarafından gerçekleştiriliyor. (✓)</li> </ul></div>
