Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1204][body][0][value
source: <p>This page answers frequently-asked questions about EFF's <a href="/https-everywhere">HTTPS Everywhere</a> project. If your question isn't answered below, you can try the resources <a href="/https-everywhere/development">listed here</a>.</p>
tr: <p>Bu sayfa EFF'in <a href="/https-everywhere">HTTPS Everywhere</a> projesiyle ilgili sık sorulan sorulara cevap veren sayfadır. Eğer sorunuzun cevabı aşağıda yoksa, <a href="/https-everywhere">linkteki sayfa</a>da listelenen kaynaklara gözatabilirsiniz.</p>

# 1204][field_questions][0][question
source: What if HTTPS Everywhere breaks some site that I use?
tr: Ya HTTPS Everywhere kullandığım siteyi bozarsa?

# 1204][field_questions][0][answer
source: <p></p><a name="bugs"></a><p>This is occasionally possible because of inconsistent support for HTTPS on sites (e.g., when a site seems to support HTTPS access but makes a few, unpredictable, parts of the site unavailable in HTTPS). If you <a href="https://github.com/EFForg/https-everywhere/issues">report the problem to us</a>, we can try to fix it. In the meantime, you can disable the rule affecting that particular site in your own copy of HTTPS Everywhere by clicking on the HTTPS Everywhere toolbar button and unchecking the rule for that site.</p><p>You can also report the problem to the site, since they have the power to fix it!</p>
tr: <p> </p><p></p><a name="bugs"></a><p>Bu durum, HTTPS'in sitelerdeki istikrarsız desteği yüzünden arada sırada gerçekleşebilen bir durumdur (örneğin, bir site HTTPS erişimini desteklediğinde ancak sitenin bazı bölümlerini öngörülemeyen bir şekilde HTTPS için erişilemez kıldığında). Eğer bu tarz bir problemi <a href="https://github.com/EFForg/https-everywhere/issues">bize iletirseniz</a>, sorunu düzeltmeye çalışabiliriz. Bu sırada, hata aldığınız sitenin kuralını araç çubuğundaki HTTPS Everywhere butonuna tıklayarak kopyanız üzerinden inaktif hale getirebilirsiniz.</p><p>Aynı zamanda bu problemi siteye de iletebilirsiniz, çünkü onların bu sorunu düzeltme gücü vardır!</p>

# 1204][field_questions][1][question
source: Why is HTTPS Everywhere preventing me from joining this hotel/school/other wireless network?
tr: HTTPS Everywhere neden benim otel/okul/diğer kablosuz ağlara bağlanmamı engelliyor?

# 1204][field_questions][1][answer
source: <p></p><a name="captiveportal"></a><p>Some wireless networks hijack your HTTP connections when you first join them, in order to demand authentication or simply to try to make you agree to terms of use. HTTPS pages are protected against this type of hijacking, which is as it should be. If you go to a website that isn't protected by HTTPS Everywhere (currently, nytimes.com is one such site) that will allow your connection to be captured and redirected to the authentication or terms of use page.</p>
tr: <p> </p><p></p><a name="captiveportal"></a><p>Bazı kablosuz ağlar, doğrulama talep etmek ya da sizi kullanım koşullarını kabul etmeye zorlamak için bu ağlara bağlandığınızda HTTP bağlantılarınızı çalarlar. HTTPS sayfaları olması gerektiği gibi bu tarz çalınmalara karşı korumalıdır. HTTPS Everywhere tarafından korunmayan bir siteyi ziyaret edderseniz (şu an için nytimes.com buna bir örnektir), bu bağlantınızın yakalanmasına ve doğrulanma ya da kullanım koşulları sayfasına yönlendirmesine olanak sağlar.</p>

# 1204][field_questions][2][question
source: Will there be a version of HTTPS Everywhere for IE, Safari, or some other browser?
tr: HTTPS Everywhere'in IE, Safari ya da diğer internet tarayıcıları için bir sürümü çıkacak mı?

# 1204][field_questions][2][answer
source: <p><a name="platform"></a> As of early 2012, the Safari extension API does not offer a way to perform secure rewriting of http requests to https. But if you happen to know a way to perform secure request rewriting in these browsers, feel free to let us know at <tt>https-everywhere at EFF.org</tt> (but note that modifying <tt>document.location</tt> or <tt>window.location</tt> in JavaScript is not secure).</p>
tr: <p><a name="platform"></a>2012 yılının başından beri, Safari eklenti API'ı http isteklerini https'ye yazmak için güvenli bir yol sunmuyor. Ancak bu yöntemin güvenli bir şekilde nasıl gerçekleşebileceğini biliyorsanız, lütfen bu yöntemi bize <tt>EFF'teki https-everywhere</tt> sayfası aracılığıyla yazmaktan çekinmeyin. (Ancak JavaScrıpt'teki <tt>document.location</tt> ya da <tt>window.location</tt>'ı modifiye etmenin güvenli olmadığını unutmayın.)</p>

# 1204][field_questions][3][question
source: Why use a whitelist of sites that support HTTPS? Why can't you try to use HTTPS for every last site, and only fall back to HTTP if it isn't available?
tr: Neden HTTPS destekleyen siteler için bir beyaz liste (whitelist) kullanıyorsunuz? Her site için HTTPS kullanmayı deneyip, sitenin bunu desteklememesi durumunda HTTP'ye geri dönmek daha doğru değil mi?

# 1204][field_questions][3][answer
source: <p><a name="automatic-https"></a> There are several problems with the idea of trying to automatically detect HTTPS on every site. There is no guarantee that sites are going to give the same response via HTTPS that they give via HTTP. As of 2015, Forbes is a good example of this problem: compare these <a href="http://forbes.com">HTTP</a> and <a href="https://forbes.com">HTTPS</a> responses. Also, it's not possible to test for HTTPS in real time without introducing security vulnerabilities (What should the extension do if the HTTPS connection attempt fails? Falling back to insecure HTTP isn't safe). And in some cases, HTTPS Everywhere has to perform quite complicated transformations on URIs — for example until recently the Wikipedia rule had to turn an address like <tt>http://en.wikipedia.org/wiki/World_Wide_Web</tt> into one like <tt>https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web</tt> because HTTPS was not available on Wikipedia's usual domains.</p>
tr: <p><a name="automatic-https"></a>Bir sitenin HTTPS destekleyip desteklemediğini otomatik olarak tanımlamak problemli bir işlemdir. Sitelerin HTTP aracılığıyla verdikleri bir yanıtın aynısını HTTPS ile vereceklerinin bir garantisi yoktur. 2015 itibarı ile Forbes bu problem için iyi bir örnektir: bu <a href="http://forbes.com">HTTP</a> ve <a href="https://forbes.com">HTTPS</a> yanıtlarını karşılaştırın. Ayrıca, güvenlik zayıflıkları sunmadan gerçek zamanlı olarak HTTPS bağlantısını test etmek mümkün değildir. (HTTPS bağlantısının başarılı olmaması durumunda eklenti ne yapmalı? HTTP'ye geri dönmek güvenli değildir.) Ve bazı durumlarda, HTTPS Everywhere URI'lar üzerinde oldukça karmaşık dönüşümler uygulamak zorundadır — örneğin, yakın zamana kadar Wikipedia adresleri <tt>http://en.wikipedia.org/wiki/World_Wide_Web</tt>'den, <tt>https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web</tt>'e çevirmek zorunda kalıyordu çünkü HTTPS, Wikipedia'nın normal alan adı için mevcut değildi.</p>

# 1204][field_questions][4][question
source: How do I get rid of/move the HTTPS Everywhere button in the toolbar?
tr: Araç çubuğundaki HTTPS Everywhere butonunu nasıl kaldırabilir ya da yerinden oynatabilirim?

# 1204][field_questions][4][answer
source: <p><a name="toolbar"></a> The HTTPS Everywhere button is useful because it allows you to see, and disable, a ruleset if it happens to be causing problems with a site. But if you'd rather disable it, go to View-&gt;Toolbars-&gt;Customize, and drag the button out of the toolbar into the Addons bar at the bottom of the page. Then you can hide the Addons bar. (In theory you should be able to drag it into the tray of available icons too, but that may trigger <a href="https://trac.torproject.org/projects/tor/ticket/6276">this bug</a>.</p>
tr: <p><a name="toolbar"></a>HTTPS Everywhere butonu, eklentinin bir sitede problem çıkartması durumunda eklentinin kural setini görmenizi ve devre dışı bırakmanıza olanak sağladığı için yararlıdır. Ama butonu devre dışı bırakmak istiyorsanız, bunu View (Görünüm)-&gt;Toolbars (Araç Çubuğu)-&gt;Customize (Özelleştir)'e giderek ve butonu araçlar çubuğundan sayfanın alt kısmında bulunan Addons (Eklentiler) çubuğuna taşıyarak gerçekleştirebilirsiniz. Daha sonra Addons (Eklentiler) çubuğunu gizleyebilirsiniz. (Teorik olarak butonu diğer ikonların mevcut olduğu bölüme taşıyabilirsiniz, ancak bu işlem <a href="https://trac.torproject.org/projects/tor/ticket/6276">linkteki bug</a>'ın oluşmasına sebep olabilir.)</p>

# 1204][field_questions][5][question
source: When does HTTPS Everywhere protect me? When does it not protect me?
tr: HTTPS Everywhere beni ne zaman korur, ne zaman korumaz?

# 1204][field_questions][5][answer
source: <a name="where"></a> HTTPS Everywhere protects you only when you are using <em>encrypted portions of supported web sites</em>. On a supported site, it will automatically activate HTTPS encryption for all known supported parts of the site (for some sites, this might be only a portion of the entire site). For example, if your web mail provider does not support HTTPS at all, HTTPS Everywhere can't make your access to your web mail secure. Similarly, if a site allows HTTPS for text but not images, someone might be able to see which images your browser loads and guess what you're accessing. HTTPS Everywhere depends entirely on the security features of the individual web sites that you use; it <em>activates</em> those security features, but it can't <em>create</em> them if they don't already exist. If you use a site not supported by HTTPS Everywhere or a site that provides some information in an insecure way, HTTPS Everywhere can't provide additional protection for your use of that site. Please remember to check that a particular site's security is working to the level you expect before sending or receiving confidential information, including passwords. One way to determine what level of protection you're getting when using a particular site is to use a packet-sniffing tool like <a href="http://www.wireshark.org/">Wireshark</a> to record your own communications with the site. The resulting view of your communications is about the same as what an eavesdropper on your wifi network or at your ISP would see. This way, you can determine whether some or all of your communications would be protected; however, it may be quite time-consuming to make sense of the Wireshark output with enough care to get a definitive answer. You can also turn on the "Block all HTTP requests" feature for added protection. Instead of loading insecure pages or images, HTTPS Everywhere will block them outright.
tr: <a name="where"></a>HTTPS Everywhere sizi sadece <em>desteklenen websitelerinin şifrelenmiş kısımlarını kullanırken korur.</em> Desteklenmiş site üzerinde eklenti, sitenin desteklenmiş olduğu bilinen bölümleri için HTTPS şifrelemesini otomatik olarak aktifleştirir (bazı siteler için, bu sitenin yalnızca bir kesimi olabilir). Örneğin, web eposta sağlayıcınız HTTPS'yi hiçbir şekilde desteklemiyorsa, HTTPS Everywhere eposta sağlayıcınızla olan bağlantıyı güvenli hale getiremez. Benzer olarak, eğer bir site metin için HTTPS destekliyor, ancak resimler için desteklemiyorsa, bir kişi internet tarayıcınızın hangi resimleri görüntülediğini görebilir ve hangi siteye eriştiğinizi tahmin edebilir. HTTPS Everywhere çalışması tamamıyla kullandığınız sitelerin güvenlik özelliklerine dayanır; <em>eklenti bu güvenlik özelliklerini aktifleştirir ancak bu güvenlik özellikleri yerinde değilse onları yaratamaz</em>. Eğer HTTPS Everywhere tarafından desteklenmeyen ya da güvenli olmayan bir şekilde bilgi sağlayan bir site kullanıyorsanız, bu siteyi kullanırken HTTPS Everywhere size ekstra bir güvenlik sağlayamaz. Lütfen belli bir siteye şifreler dahil olmak üzere gizli bir bilgi göndermeden veya almadan önce, o sitenin güvenliğini kontrol edin. Bir siteyi kullanmadan önce, korunma seviyenizi tespit etmenizin yollarından biri <a href="http://www.wireshark.org/">Wireshark</a> tarzı siteyle iletişiminizi kayıt altına alan bir veri (paket) koklayıcı kullanmanızdır. Bu işlemin sonucunda görecekleriniz, ISS'inizin ya da wifi ağınızı izleyen birinin görecekleriyle aşağı yukarı aynıdır. Bu yolla haberleşmelerinizin belli bir bölümünün mü yoksa tamamının mı korunacağını belirleyebilirsiniz; ancak, Wireshark çıktısından akla yatar bir sonuç almak size oldukça zaman harcatabilir. Aynı zamanda eklentinin "Block all HTTP requests" (Tüm HTTP isteklerini engelle) özelliğini ek güvenlik önlemi için aktifleştirebilirsiniz. Güvenli olmayan sayfaları ya da resimleri yüklemek yerine, HTTPS Everywhere bunları kesin olarak engeller.

# 1204][field_questions][6][question
source: What does HTTPS Everywhere protect me against?
tr: HTTPS Everywhere beni nelere karşı korur?

# 1204][field_questions][6][answer
source: <p></p><a name="threats"></a><p>On supported parts of supported sites, HTTPS Everywhere enables the sites' HTTPS protection which can protect you against eavesdropping and tampering with the contents of the site or with the information you send to the site. Ideally, this provides some protection against an attacker learning the content of the information flowing in each direction — for instance, the text of e-mail messages you send or receive through a webmail site, the products you browse or purchase on an e-commerce site, or the particular articles you read on a reference site.</p><p>However, HTTPS Everywhere <strong>does not conceal the identities of the sites you access</strong>, the amount of time you spend using them, or the amount of information you upload or download from a particular site. For example, if you access http://www.eff.org/issues/nsa-spying and HTTPS Everywhere rewrites it to https://www.eff.org/issues/nsa-spying, an eavesdropper can still trivially recognize that you are accessing www.eff.org (but might not know which issue you are reading about). In general, the entire hostname part of the URL remains exposed to the eavesdropper because this must be sent repeatedly in unencrypted form while setting up the connection. Another way of saying this is that HTTPS was never designed to conceal the identity of the sites that you visit.</p><p>Researchers have also shown that it may be possible for someone to figure out more about what you're doing on a site merely through careful observation of the amount of data you upload and download, or the timing patterns of your use of the site. A simple example is that if the site only has one page of a certain total size, anyone downloading exactly that much data from the site is probably accessing that page.</p><p>If you want to protect yourself against monitoring of the sites you visit, consider using HTTPS Everywhere together with software like <a href="https://www.torproject.org/">Tor</a>.</p>
tr: <p> </p><p></p><a name="threats"></a><p> Desteklenen sitelerin desteklenen bölümlerinde, HTTPS Everywhere sitenin HTTPS korumasını kullanarak başkalarının bağlantınızı izlemesine, sitenin içeriğini değiştirmesine ya da siteye gönderdiğiniz bilgilerin değiştirilmesine karşı korur. İdeal olarak, bu her bir yöne dağılan bilgilerin içeriğinin bir saldırgan tarafından öğrenilmesine karşı bir koruma sağlar. Bir webmail sitesi aracılığıyla gönderdiğiniz ve aldığınız eposta mesajlarınız, bir online alışveriş sitesinden baktığınız ya da satın aldığınız ürünler, ya da bir site üzerinden okuduğunuz makaleler bunlara örnek olabilir.</p><p> Ancak, HTTPS Everywhere <strong>ziyaret ettiğiniz sitelerin kimliklerini, bu sitelerde ne kadar zaman geçirdiğinizi ya da o siteye ne kadar bilgi yüklediğiniz veya indirdiğiniz bilgisini gizlemez.</strong> Örneğin, http://www.eff.org/issues/nsa-spying adresine eriştiğinizde ve HTTPS Everywhere bu adresi https://www.eff.org/issues/nsa-spying olarak değiştirdiğinde, bağlantınızı izleyen kişi www.eff.org adresine girdiğinizi kolay bir şekilde öğrenebilir (ancak bu sitede hangi bölümü okuduğunuzu bilemeyebilir). Genel olarak, sistem adının (hostname) tamamı sizi izleyen kişilere karşı korumasızdır çünkü bu adres siteyle bağlantıyı kurabilmek için defalarca şifresiz bir şekilde gönderilir. Bunu söylemenin bir diğer yolu, HTTPS'nin ziyaret ettiğiniz sitelerin kimliğini gizlemek için tasarlanmamış bir protokol olmadığıdır.</p><p> Araştırmacılar ayrıca bir kişinin siteye gönderdiğiniz ya da aldığınız veri boyutuna veya siteyi kullandığınız zaman dilimine bakarak bir site üzerinde neler yaptığınızın anlaşılabileceğini göstermiştir. Basit bir örnek vermek gerekise; bir sitenin bir sayfasının belli bir boyutu varsa, bu sayfayı kim görüntülerse görüntülesin aynı boyutta veri indirecektir. Bu da bu site üzerinde hangi sayfayı görüntülediğini ele verebilir.</p><p> Eğer başkalarının hangi sitelere girdiğinizi görmesini istemiyorsanız, HTTPS Everywhere ile birlikte <a href="https://www.torproject.org/">Tor</a> kullanmayı düşünün.</p>

# 1204][field_questions][7][question
source: How do I get support for an additional site in HTTPS Everywhere?
tr: HTTPS Everywhere'de ek bir site için nasıl destek alabilirim?

# 1204][field_questions][7][answer
source: <p><a name="sites"></a> You can learn <a href="https://www.eff.org/https-everywhere/rulesets">how to write rules</a> that teach HTTPS Everywhere to support new sites. You can install these rules in your own browser or send them to us for possible inclusion in the official version.</p>
tr: <p><a name="sites"></a> HTTPS Everywhere'e yeni siteleri desteklemesi için kuralların nasıl yazılacağını <a href="https://www.eff.org/https-everywhere/rulesets">linkteki sayfadan</a> öğrenebilirsiniz. Bu kuralları kendi internet tarayıcınıza indirebilir ya da resmi sürüme eklenmesi ihtimali için bize gönderebilirsiniz.</p>

# 1204][field_questions][8][question
source: What if the site doesn't support HTTPS, or only supports it for some activities, like entering credit card information?
tr: Ya bir site HTTPS'i desteklemiyor ya da sadece kredi kartı bilgisi ekranı gibi belli yerlerde destekliyorsa?

# 1204][field_questions][8][answer
source: <p><a href="https://letsencrypt.org/">https://letsencrypt.org/</a></p><a name="partial"></a><a name="amo"></a><p>You could try to contact the site and point out that using HTTPS for all site features is an increasingly common practice nowadays and protects users (and sites) against a variety of Internet attacks. For instance, it defends against the ability of other people on a wifi network to spy on your use of the site or even take over your account. You can also point out that credit card numbers aren't the only information you consider private or sensitive.</p><p>Sites like Google, Twitter, and Facebook now support HTTPS for non-financial information — for general privacy and security reasons.</p>
tr: <p><a href="https://letsencrypt.org/">https://letsencrypt.org/</a></p><p></p><a name="partial"></a><a name="amo"></a><p> </p><p>Siteyle iletişime geçip, HTTPS desteğinin gittikçe yaygınlaşan bir uygulama olduğunu ve kullanıcıları (ve siteleri) çeşitli internet saldırılarına karşı koruduğunu belirtebilirsiniz. Örneğin, HTTPS aynı wifi ağı üzerinde bulunan kişilerin kullandığınız siteler aracılığıyla sizi gözetlemesini ya da hesabınızı ele geçirmesini engeller. Bunun yanında, gizli ya da hassas bilgilerin kredi kartı numaralarıyla sınırlı olmadığını da siteye belirtebilirsiniz.</p><p> </p><p> Google, Twitter ve Facebook gibi siteler, artık genel gizlilik ve güvenlik sebeplerinden ötürü mali olmayan bilgiler için bile HTTPS desteği sunuyor.</p>

# 1204][field_questions][9][question
source: Isn't it more expensive or slower for a site to support HTTPS compared to regular HTTP?
tr: Bir sitenin HTTPS'i desteklemesi, HTTP desteğine oranla daha pahalı ya da yavaş değil midir?

# 1204][field_questions][9][answer
source: <p></p><a name="expensive"></a><p>It can be, but some sites have been pleasantly surprised to see how practical it can be. Also, experts at Google are currently implementing several enhancements to the TLS protocol that make HTTPS dramatically faster; if these enhancements are added to the standard soon, the speed gap between the two should almost disappear. See <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">Adam Langley's description of the HTTPS deployment situation</a> for more details on these issues. Notably, Langley states: "In order to [enable HTTPS by default for Gmail] we had to deploy no additional machines and no special hardware. On our production frontend machines, SSL/TLS accounts for less than 1% of the CPU load, less than 10KB of memory per connection and less than 2% of network overhead."</p><p>It used to be expensive to purchase a certificate for HTTPS usage, but they can now be obtained for free from <a href="http://www.startssl.com/">StartSSL</a> or <a href="https://buy.wosign.com/free/">WoSign</a>, and soon free certificate will be available from Let's Encrypt as well.</p>
tr: <p> </p><p></p><a name="expensive"></a><p> Olabilir, ancak bazı siteler bunun ne kadar pratik olabileceğini gördüğünde oldukça şaşırdılar. Ayrıca, Google'da çalışan uzmanlar, HTTPS'i dramatik bir şekilde hızlandırmak amacıyla TLS protokolüne çeşitli iyileştirmeler uyguluyorlar. Eğer bu iyileştirmeler standartın kendisine yakın bir zamanda eklenirse, HTTP ve HTTPS arasındaki hız farkı neredeyse kapanacaktır. Bu konuda daha detaylı bilgi için Adam Langley'nin <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">blogunda yazdığı makaleye</a> bakabilirsiniz. Langley, "HTTPS'i Gmail için varsayılan olarak aktifleştirmek için, ek bir makine ya da özel bir donanım konuşlandırmak zorunda kalmadık. Üretim frontend sistemlerimizde, SSL/TLS CPU yoğunluğunun %1'ine, bağlantı başına 10KB hafızaya ve %2'den daha az ağ yüküne denk geliyor." diyor.</p><p> Önceden HTTPS kullanımı için sertifika almak masraflıydı, ancak artık bu sertifikalar ücretsiz olarak <a href="http://www.startssl.com/">StartSSL</a>'den ya da <a href="https://buy.wosign.com/free/">WoSign</a>'dan, aynı zamanda yakın bir süre içinde Let's Encrypt'ten de elde edilebilecek.</p>

# 1204][field_questions][10][question
source: Why should I use HTTPS Everywhere instead of just typing https:// at the beginning of site names?
tr: Sitenin isminin başına https:// yazmak varken, niçin HTTPS Everywhere kullanayım?

# 1204][field_questions][10][answer
source: <p><a name="why"></a> Even if you normally type https://, HTTPS Everywhere might protect you if you occasionally forget. Also, it can rewrite other people's links that you follow. For instance, if you click on a link to <a href="http://en.wikipedia.org/wiki/EFF_Pioneer_Award">http://en.wikipedia.org/wiki/EFF_Pioneer_Award</a>, HTTPS Everywhere will automatically rewrite the link to <a href="https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award">https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award</a>. Thus, you might get some protection even if you wouldn't have noticed that the target site is available in HTTPS.</p>
tr: <p><a name="why"></a>Normalde https:// yazsanız bile, HTTPS Everywhere sizi bunu yazmayı unuttuğunuz durumlarda da korur. Ayrıca, takip ettiğiniz insanların paylaştıkları http linklerini https olarak yeniden de yazar. Örneğin, <a href="http://en.wikipedia.org/wiki/EFF_Pioneer_Award">http://en.wikipedia.org/wiki/EFF_Pioneer_Award</a> linkine tıklarsanız, HTTPS bu linki otomatik olarak <a href="https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award">https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award</a>'a çevirir. Bu yüzden hedef sitenin HTTPS olarak mevcut olduğunun farkında olmadığınızda bile HTTPS Everywhere sizi korur.</p>

# 1204][field_questions][11][question
source: Why does HTTPS Everywhere include rules for sites like PayPal that already require HTTPS on all their pages?
tr: HTTPS Everywhere neden PayPal gibi her sayfasında HTTPS bağlantısı talep eden siteler için kurallar içerir?
