Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 736][field_questions][10][answer
source: <p><a name="why"></a> Even if you normally type https://, HTTPS Everywhere might protect you if you occasionally forget. Also, it can rewrite other people's links that you follow. For instance, if you click on a link to <a href="http://en.wikipedia.org/wiki/EFF_Pioneer_Award">http://en.wikipedia.org/wiki/EFF_Pioneer_Award</a>, HTTPS Everywhere will automatically rewrite the link to <a href="https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award">https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award</a>. Thus, you might get some protection even if you wouldn't have noticed that the target site is available in HTTPS.</p>
fr: <p><a name="why"></a> Même si vous avez l'habitude de taper https://, HTTPS Everywhere peut vous protéger si jamais vous l'oubliez. En outre, il peut réécrire les liens tierces que vous suivez. Par exemple, si vous cliquez sur un lien vers <a href="http://en.wikipedia.org/wiki/EFF_Pioneer_Award">http://en.wikipedia.org/wiki/EFF_Pioneer_Award</a>, HTTPS Everywhere réécrira automatiquement le lien en <a href="https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award">https://secure.wikimedia.org/wikipedia/en/wiki/EFF_Pioneer_Award</a>. Ainsi, vous pourriez bénéficier d’une protection, même si vous n'aviez pas remarqué que le site cible était disponible en HTTPS.</p>

# 736][field_questions][11][question
source: Why does HTTPS Everywhere include rules for sites like PayPal that already require HTTPS on all their pages?
fr: Pourquoi HTTPS Everywhere inclut-il des règles pour des sites comme PayPal qui utilisent déjà HTTPS sur toutes leurs pages ?

# 736][field_questions][11][answer
source: <p><a name="sslstrip"></a> HTTPS Everywhere, like the <a href="http://www.w3.org/Security/wiki/Strict_Transport_Security">HSTS protocol</a>, tries to address an attack called <a href="http://www.thoughtcrime.org/software/sslstrip/">SSL stripping</a>. Users are only protected against the SSL stripping attack if their browsers don't even <em>try</em> to connect to the HTTP version of the site — even if the site would have redirected them to the HTTPS version. With HTTPS Everywhere, the browser won't even attempt the insecure HTTP connection, even if that's what you ask it to do. (Note that HTTPS Everywhere currently does not include a comprehensive list of such sites, which are mainly financial institutions.)</p>
fr: <p><a name="sslstrip"></a>HTTPS Everywhere, tout comme le <a href="http://www.w3.org/Security/wiki/Strict_Transport_Security">protocole HSTS</a>, tente de répondre à une attaque appelée <a href="http://www.thoughtcrime.org/software/sslstrip/">SSL stripping</a>. Les utilisateurs sont protégés contre une attaque SSL stripping uniquement si leurs navigateurs ne <em>tentent</em>même pas de se connecter à la version HTTP du site - même si le site les aurait redirigé vers la version HTTPS. Avec HTTPS Everywhere, le navigateur ne tentera pas de connexion HTTP non sécurisée, même si vous le lui demandez. (Notez que HTTPS Everywhere n’inclut pas actuellement de liste exhaustive de ces sites, qui sont principalement des établissements financiers.)</p>

# 736][field_questions][12][question
source: What do the different colors for rulesets in the toolbar menu mean?
fr: Que signifient les différentes couleurs pour les jeux de règles dans le menu de la barre d'outils ?

# 736][field_questions][12][answer
source: <p></p><a name="colors"></a><p>The colors are:</p><p>Dark Green: ruleset was active in loading the resources in the current page.</p><p>Light Green: ruleset was ready to prevent HTTP loads in the current page, but everything that the ruleset would have covered was loaded over HTTPS anyway (in the code, light green is called a "moot rule").</p><p>Dark Brown or Clockwise Red Arrow: broken rule -- the ruleset is active but the server is redirecting at least some URLs back from HTTPS to HTTP.</p><p>Gray: the ruleset is disabled.</p>
fr: <p></p><a name="colors"></a><p>Les couleurs signifient ceci :</p><p>Vert foncé : le jeu de règles était actif dans le chargement des ressources de la page actuelle.</p><p>Vert clair : le jeu de règles était prêt à empêcher les charges HTTP de la page en cours, mais tout ce qu'il aurait pu couvrir a été de toute façon chargé via HTTPS (dans le code, le vert clair est appelé une « règle théorique »).</p><p>Βrun foncé ou flèche rouge dans le sens horaire : règle brisée ; le jeu de règles est actif, mais le serveur réoriente certaines URL de HTTPS vers HTTP.</p><p>Gris : le jeu de règles est désactivé.</p>

# 736][field_questions][13][question
source: I'm having a problem installing the browser extension.
fr: J'ai un problème d'installation pour l'extension HTTPS Everywhere.

# 736][field_questions][13][answer
source: <p><a name="problems-installing"></a> Some people report that installing HTTPS Everywhere gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast anti-virus, which blocks installation of browser extensions. You may be able to <a href="https://addons.mozilla.org/en-US/firefox/addon/https-everywhere/">install from addons.mozilla.org instead</a>.</p>
fr: <p><a name="problems-installing"></a>Certains utilisateurs signalent que l'installation de HTTPS Everywhere leur renvoie l'erreur : « The addon could not be downloaded because of a connection failure on www.eff.org. » (L'extension n'a pas pu être téléchargée en raison d'un échec de connexion sur www.eff.org.) Cela peut provenir de l'antivirus Avast, qui bloque l'installation d'extensions de navigateur. Il est possible que vous puissiez l'<a href="https://addons.mozilla.org/en-US/firefox/addon/https-everywhere/">installer à partir de addons.mozilla.org</a>.</p>

# 736][field_questions][14][question
source: How do I add my own site to HTTPS Everywhere?
fr: Comment puis-je ajouter mon propre site à HTTPS Everywhere ?

# 736][field_questions][14][answer
source: We're excited that you want your site in HTTPS Everywhere! However, remember that not everyone who visits your site has our extension installed. If you run a web site, you can make it default to HTTPS for everyone, not just HTTPS Everywhere users. And it's less work! The steps you should take, in order, are: <ol><li>Set up a <a href="https://www.sslshopper.com/apache-redirect-http-to-https.html">redirect</a> from HTTP to HTTPS on your site.</li> <li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html">Add the Strict-Transport-Security (HSTS) header on your site</a>.</li> <li><a href="https://hstspreload.appspot.com/">Add your site to the HSTS Preload list</a>.</li> </ol> These steps will give your site much better protection that adding it to HTTPS Everywhere. Generally speaking, once you are done, there is no need to add your site to HTTPS Everywhere. However, if you would still like to, please follow the <a href="https://eff.org/https-everywhere/rulesets">instructions on writing rulesets</a>, and indicate that you are the author of the web site when you submit your pull request.
fr: Nous sommes ravis de savoir que vous souhaitez inclure votre site dans HTTPS Everywhere ! Rappelez-vous cependant que tous ceux qui visitent votre site n'ont pas nécessairement installé notre extension. Si vous gérez un site Web, vous pouvez faire en sorte qu'il utilise HTTPS par défaut pour tout le monde, pas juste pour les utilisateurs de HTTPS Everywhere. Et cela représente encore moins de travail ! Les étapes que vous devez suivre, sont, dans l'ordre, les suivantes : <ol><li>Mettre en place une <a href="https://www.sslshopper.com/apache-redirect-http-to-https.html">redirection</a> de HTTP à HTTPS sur votre site.</li> <li><a href="https://raymii.org/s/tutorials/HTTP_Strict_Transport_Security_for_Apache_NGINX_and_Lighttpd.html">Ajouter l'entête HTTP Strict Transport Security (HSTS) à votre site</a>.</li> <li><a href="https://hstspreload.appspot.com/">Ajouter votre site à la liste préchargée de HSTS</a>.</li> </ol> Ces étapes donneront à votre site une bien meilleure protection que son ajout à HTTPS Everywhere. D'une manière générale, une fois que vous avez terminé, il n'y a pas besoin d'ajouter votre site à HTTPS Everywhere. Si toutefois vous le souhaitez, veuillez suivre les <a href="https://eff.org/https-everywhere/rulesets">instructions sur l'écriture de jeux de règles</a>, et indiquer que vous êtes l'auteur du site Web lorsque vous soumettez votre demande de tirage (pull request).

# 736][title_field][0][value
source: HTTPS Everywhere FAQ
fr: FAQ de HTTPS Everywhere

# 737][body][0][value
source: <p>HTTPS Everywhere is produced as a collaboration between <a href="https://www.torproject.org">The Tor Project</a> and the <a href="https://eff.org/">Electronic Frontier Foundation</a>. Many sites on the web offer some limited support for encryption over <a href="https://en.wikipedia.org/wiki/HTTP_Secure">HTTPS</a>, but make it difficult to use. For instance, they may default to unencrypted HTTP, or fill encrypted pages with links that go back to the unencrypted site. The HTTPS Everywhere extension fixes these problems by using <a href="https://www.xkcd.com/208">clever technology</a> to rewrite requests to these sites to HTTPS. Information about how to access the project's Git repository and get involved in development is <a href="/https-everywhere/development">here</a>.</p><p><strong>Webmasters and prospective contributors:</strong> Check the <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> to quickly see how existing HTTPS Everywhere rules affect sites you care about! HTTPS Everywhere is governed by EFF's <a href="https://www.eff.org/code/privacy">Privacy Policy for Software</a>.</p><p><a name="problems-installing"></a> <strong>Problems Installing: </strong>Some people report that installing HTTPS Everywhere gives them the error: "The addon could not be downloaded because of a connection failure on <span class="moz-txt-link-abbreviated">www.eff.org</span>." <a href="https://kittens.eff.org/https-everywhere/faq#problems-installing">See this FAQ entry for help</a>.</p><p><a href="#" id="https-everywhere-more">Read More About HTTPS Everywhere »</a></p><div id="https-everywhere-hidden"><h2>Questions and Caveats</h2><p>Sadly, many sites still include a lot of content from third party domains that is not available over HTTPS. As always, if the browser's lock icon <a href="https://www.eff.org/https-everywhere/faq#mixed-content">is broken or carries an exclamation mark</a>, you may remain vulnerable to some adversaries that use active attacks or traffic analysis. However, the effort that would be required to eavesdrop on your browsing should still be usefully increased. <strong>Update: in recent versions of Firefox, Mozilla has removed the broken padlock indicator. Now, the only difference between a secure and insecure HTTPS deployment is the blue or green tint on the left of the address bar for secure deployments</strong> Answers to common questions may be on the <a href="/https-everywhere/faq/">frequently asked questions</a> page. <strong>HTTPS Everywhere can protect you only when you're using sites that support HTTPS and for which HTTPS Everywhere include a <a href="/https-everywhere/rulesets">ruleset</a>.</strong> If sites you use don't support HTTPS, ask the site operators to add it; only the site operator is able to enable HTTPS. There is more information and instruction on how server operators can do that in the EFF article <a href="/pages/how-deploy-https-correctly">How to Deploy HTTPS Correctly</a>.</p><h2>Development And Writing your own Rulesets</h2><p><strong>Webmasters and prospective contributors:</strong> Check the <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> to quickly see how existing HTTPS Everywhere rules affect sites you care about! You can help us test forthcoming site support and new features by installing the <a href="/files/https-everywhere-devel.xpi">development branch</a> of the extension. HTTPS Everywhere uses small ruleset files to define which domains are redirected to https, and how. If you'd like to write your own ruleset, you can find out how to do that <a href="/https-everywhere/rulesets">here</a>. Information about how to access the project's Git repository and get involved in development is <a href="/https-everywhere/development">here</a>. Send feedback on this project to the <tt>https-everywhere AT eff.org</tt> mailing list. Note that this is a public and publicly-archived mailing list. You can also <a href="https://lists.eff.org/mailman/listinfo/https-everywhere">subscribe</a>. Send new rewrite rules or fixes to existing rewrite rules to the <tt>https-everywhere-rules AT eff.org</tt> mailing list. Note that this is a public and publicly-archived mailing list. You can also <a href="https://lists.eff.org/mailman/listinfo/https-everywhere-rules">subscribe</a>.</p></div>
fr: <p>HTTPS Everywhere est le produit d'une collaboration entre le <a href="https://www.torproject.org">projet Tor</a> et l'<a href="https://eff.org/">Electronic Frontier Foundation</a>. Beaucoup de sites Web offrent un support limité pour le chiffrement via <a href="https://en.wikipedia.org/wiki/HTTP_Secure">HTTPS</a>, mais le rendent difficile d’utilisation. Par exemple, ils offrent par défaut une connexion HTTP non chiffrée, ou remplissent les pages chiffrées de liens qui remontent vers le site non chiffré. L'extension HTTPS Everywhere résout ces problèmes en utilisant une <a href="https://www.xkcd.com/208">technologie intelligente</a> de réécriture des requêtes sur ces sites en HTTPS. Des informations sur comment accéder au dépôt Git du projet et s'impliquer au développement sont disponibles <a href="/https-everywhere/development">ici</a>.</p><p><strong>Avis aux webmasters et contributeurs potentiels :</strong> Consultez <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> pour vérifier rapidement comment les règles de HTTPS Everywhere affectent les sites qui vous intéressent ! HTTPS Everywhere est régi par la <a href="https://www.eff.org/code/privacy">politique de confidentialité de l'EFF pour les programmes logiciels</a>.</p><p><a name="problems-installing"></a> <strong>Problèmes d'installation :</strong>Certains utilisateurs rapportent que l'installation de HTTPS Everywhere renvoie l'erreur : « The addon could not be downloaded because of a connection failure on <span class="moz-txt-link-abbreviated">www.eff.org</span>. » (L'extension n'a pas pu être téléchargée en raison d'un échec de connexion sur www.eff.org.) <a href="https://kittens.eff.org/https-everywhere/faq#problems-installing">Lire cette entrée de la FAQ pour plus d'assistance</a>.</p><p><a href="#" id="https-everywhere-more">En savoir plus sur HTTPS Everywhere » </a></p><div id="https-everywhere-hidden"><h2>Questions et mises en garde</h2><p>Malheureusement, de nombreux sites incluent encore beaucoup de contenu de sites tiers qui n'est pas disponible via HTTPS. Comme toujours, si l'icône de verrou du navigateur <a href="https://www.eff.org/https-everywhere/faq#mixed-content">est cassé ou porte un point d'exclamation</a>, vous pouvez demeurer vulnérables à certains adversaires qui utilisent des attaques actives ou l'analyse de trafic. Toutefois, l'effort nécessaire pour espionner votre navigation reste accru. <strong>Mise à jour : dans les versions récentes de Firefox, Mozilla a enlevé l'indicateur du cadenas cassé. Maintenant, la seule différence entre un déploiement HTTPS sécurisé et non sécurisé est que la teinte bleue ou verte sur la gauche de la barre d'adresse pour montrer les déploiements sécurisés.</strong> Les réponses à des questions courantes peuvent se trouver sur la page des <a href="/https-everywhere/faq/">questions fréquemment posées</a>. <strong>HTTPS Everywhere peut vous protéger uniquement lorsque vous utilisez des sites prenant en charge le protocole HTTPS et pour lesquels HTTPS Everywhere inclue un<a href="/https-everywhere/rulesets"> jeu de règles</a>.</strong> Si les sites que vous visitez ne prennent pas en charge HTTPS, demandez aux opérateurs du site de l'ajouter ; seul l’opérateur du site est en mesure d'activer HTTPS. Vous trouverez plus d'informations et d'instructions sur comment un opérateur de serveur peut faire cela dans l'article de l'EFF <a href="/pages/how-deploy-https-correctly"> Comment déployer HTTPS correctement.</a>.</p><h2>Développement et écriture de votre propre jeu de règles</h2><p><strong>Avis aux webmasters et aux éventuels contributeurs : </strong>Consultez <a href="https://www.eff.org/https-everywhere/atlas">HTTPS Everywhere Atlas</a> pour voir rapidement comment les règles actuelles de HTTPS Everywhere règles affectent les sites qui vous intéressent ! Vous pouvez nous aider à tester la future prise en charge de sites et les nouvelles fonctionnalités en installant la <a href="/files/https-everywhere-devel.xpi">branche de développement</a> de l'extension. HTTPS Everywhere utilise des fichiers de jeu de règles pour définir quels domaines sont redirigés vers HTTPS et comment. Si vous souhaitez écrire votre propre jeu de règles, vous trouverez comment le faire <a href="/https-everywhere/rulesets">ici</a>. Des informations sur comment accéder au dépôt Git du projet et comment s'impliquer dans le développement sont disponibles <a href="/https-everywhere/development">ici</a>. Envoyez vos commentaires sur ce projet sur la liste de diffusion <tt>https-everywhere @ eff.org</tt>. Notez qu'il s'agit d'une liste de diffusion publique et archivée publiquement. Vous pouvez également <a href="https://lists.eff.org/mailman/listinfo/https-everywhere">vous y abonner</a>. Envoyez de nouvelles règles de réécriture ou des correctifs aux règles actuelles de réécriture sur la liste de diffusion <tt>https-everywhere @ eff.org</tt>. Notez qu'il s'agit d'une liste de diffusion publique et archivée publiquement. Vous pouvez également <a href="https://lists.eff.org/mailman/listinfo/https-everywhere-rules">vous y abonner</a>.</p></div>
