Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 736][body][0][value
source: <p>This page answers frequently-asked questions about EFF's <a href="/https-everywhere">HTTPS Everywhere</a> project. If your question isn't answered below, you can try the resources <a href="/https-everywhere/development">listed here</a>.</p>
fr: <p>Cette page répond à vos questions fréquentes sur le projet <a href="/https-everywhere">HTTPS Everywhere</a> de l'EFF. Si vous ne trouvez pas la réponse à votre question ci-dessous, vous pouvez consulter les ressources <a href="/https-everywhere/development">présentées ici</a>.</p>

# 736][field_questions][0][question
source: What if HTTPS Everywhere breaks some site that I use?
fr: Que faire si HTTPS Everywhere rend un site que j'utilise non fonctionnel ?

# 736][field_questions][0][answer
source: <p></p><a name="bugs"></a><p>This is occasionally possible because of inconsistent support for HTTPS on sites (e.g., when a site seems to support HTTPS access but makes a few, unpredictable, parts of the site unavailable in HTTPS). If you <a href="https://github.com/EFForg/https-everywhere/issues">report the problem to us</a>, we can try to fix it. In the meantime, you can disable the rule affecting that particular site in your own copy of HTTPS Everywhere by clicking on the HTTPS Everywhere toolbar button and unchecking the rule for that site.</p><p>You can also report the problem to the site, since they have the power to fix it!</p>
fr: <p></p><a name="bugs"></a><p>Ceci peut arriver parfois à cause de la prise en charge inconsistante du protocole HTTPS par certains sites Web (par exemple, quand un site semble proposer l'accès HTTPS mais qu’il rend quelques parties imprévisibles du site non disponibles via HTTPS). Si vous nous <a href="https://github.com/EFForg/https-everywhere/issues">signalez le problème</a>, nous pourrons tenter de le réparer. Entre temps, vous pouvez désactiver la règle affectant ce site particulier dans votre propre copie de HTTPS Everywhere en cliquant sur le bouton de la barre d'outils HTTPS Everywhere et en décochant la règle pour ce site. </p><p>Vous pouvez également signaler le problème aux auteurs du site Web en question, puisqu’ils ont le pouvoir de le régler !</p>

# 736][field_questions][1][question
source: Why is HTTPS Everywhere preventing me from joining this hotel/school/other wireless network?
fr: Pourquoi HTTPS Everywhere m'empêche-t-il de rejoindre tel hôtel, école ou autre réseau sans fil ?

# 736][field_questions][1][answer
source: <p></p><a name="captiveportal"></a><p>Some wireless networks hijack your HTTP connections when you first join them, in order to demand authentication or simply to try to make you agree to terms of use. HTTPS pages are protected against this type of hijacking, which is as it should be. If you go to a website that isn't protected by HTTPS Everywhere (currently, nytimes.com is one such site) that will allow your connection to be captured and redirected to the authentication or terms of use page.</p>
fr: <p></p><a name="captiveportal"></a><p>Certains réseaux sans fil détournent vos connexions HTTP lorsque vous les rejoignez pour la première fois, pour vous demander une authentification ou simplement pour tenter de vous faire accepter des conditions d'utilisation. Les pages HTTPS sont protégées contre ce type de détournement, comme elle le devraient. Si vous visitez un site Web qui n'est pas protégée par HTTPS Everywhere (actuellement, nytimes.com est l’un de ces sites) ceci permettra à votre connexion d’être capturée et redirigée vers la page d'authentification ou les termes d'utilisation.</p>

# 736][field_questions][2][question
source: Will there be a version of HTTPS Everywhere for IE, Safari, or some other browser?
fr: Y aura-t-il une version de HTTPS Everywhere pour Internet Explorer, Safari ou pour un autre navigateur ?

# 736][field_questions][2][answer
source: <p><a name="platform"></a> As of early 2012, the Safari extension API does not offer a way to perform secure rewriting of http requests to https. But if you happen to know a way to perform secure request rewriting in these browsers, feel free to let us know at <tt>https-everywhere at EFF.org</tt> (but note that modifying <tt>document.location</tt> or <tt>window.location</tt> in JavaScript is not secure).</p>
fr: <p><a name="platform"></a>À partir du début 2012, l'API d'extension de Safari n'offre pas le moyen d'effectuer une réécriture sécurisée des requêtes HTTP en HTTPS. Si toutefois vous connaissez un moyen pour effectuer des demandes de réécriture sécurisées dans ces navigateurs, n'hésitez pas à nous le faire savoir à l'adresse <tt>https-everywhere @ EFF.org</tt> (mais notez que le fait de modifier <tt>document.location</tt> ou <tt>window.location</tt> via JavaScript n'est pas sécurisé).</p>

# 736][field_questions][3][question
source: Why use a whitelist of sites that support HTTPS? Why can't you try to use HTTPS for every last site, and only fall back to HTTP if it isn't available?
fr: Pourquoi utiliser une liste blanche des sites qui prennent en charge HTTPS ? Pourquoi ne pas plutôt essayer d'utiliser HTTPS pour chaque site et recourir à HTTP uniquement si ce n'est pas disponible ?

# 736][field_questions][3][answer
source: <p><a name="automatic-https"></a> There are several problems with the idea of trying to automatically detect HTTPS on every site. There is no guarantee that sites are going to give the same response via HTTPS that they give via HTTP. As of 2015, Forbes is a good example of this problem: compare these <a href="http://forbes.com">HTTP</a> and <a href="https://forbes.com">HTTPS</a> responses. Also, it's not possible to test for HTTPS in real time without introducing security vulnerabilities (What should the extension do if the HTTPS connection attempt fails? Falling back to insecure HTTP isn't safe). And in some cases, HTTPS Everywhere has to perform quite complicated transformations on URIs — for example until recently the Wikipedia rule had to turn an address like <tt>http://en.wikipedia.org/wiki/World_Wide_Web</tt> into one like <tt>https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web</tt> because HTTPS was not available on Wikipedia's usual domains.</p>
fr: <p><a name="automatic-https"></a> Il y a plusieurs problèmes liés à l'idée d'essayer de détecter automatiquement le protocole HTTPS sur chaque site Web. Il n'y a aucune garantie que les sites donnent la même réponse via HTTPS que celle offerte via HTTP. À partir de 2015, Forbes est un bon exemple pour ce problème : comparez ses réponses <a href="http://forbes.com">HTTP</a> et <a href="https://forbes.com">HTTPS</a>. En outre, il n'est pas possible de tester le HTTPS en temps réel sans introduire des failles de sécurité (Que devrait faire l'extension si la tentative de connexion HTTPS échoue ? Recourir à un HTTP non sécurisé n'est pas sûr.) Et dans certains cas, HTTPS Everywhere doit effectuer des transformations assez compliquées sur un URI. Par exemple, jusqu'à récemment, la règle pour le site de Wikipedia devait transformer une adresse comme <tt>http://en.wikipedia.org/wiki/World_Wide_Web</tt> en <tt>https://secure.wikimedia.org/wikipedia/en/wiki/World_Wide_Web</tt> car le HTTPS n'était pas disponible sur les noms de domaine habituels de Wikipedia.</p>

# 736][field_questions][4][question
source: How do I get rid of/move the HTTPS Everywhere button in the toolbar?
fr: Comment puis-je retirer ou déplacer le bouton HTTPS Everywhere sur la barre d'outils ?

# 736][field_questions][4][answer
source: <p><a name="toolbar"></a> The HTTPS Everywhere button is useful because it allows you to see, and disable, a ruleset if it happens to be causing problems with a site. But if you'd rather disable it, go to View-&gt;Toolbars-&gt;Customize, and drag the button out of the toolbar into the Addons bar at the bottom of the page. Then you can hide the Addons bar. (In theory you should be able to drag it into the tray of available icons too, but that may trigger <a href="https://trac.torproject.org/projects/tor/ticket/6276">this bug</a>.</p>
fr: <p><a name="toolbar"></a> Le bouton HTTPS Everywhere est utile car il permet de vérifier et de désactiver le jeu de règles si celui-ci crée des problèmes sur un site. Si toutefois vous préférez le désactiver, allez sur le menu Affichage-&gt; Barres d'outils-&gt; Personnaliser et faites glisser le bouton en dehors de la barre d'outils et sur la barre d'Extensions en bas de page. Ensuite, vous pouvez masquer la barre d'Extensions. (En théorie, vous devriez pouvoir également le faire glisser vers la barre des icônes disponibles, mais cela peut déclencher <a href="https://trac.torproject.org/projects/tor/ticket/6276">ce bogue</a>.)</p>

# 736][field_questions][5][question
source: When does HTTPS Everywhere protect me? When does it not protect me?
fr: Dans quel cas HTTPS Everywhere me protège-t-il ? Et dans quel cas ne me protège-t-il pas ?

# 736][field_questions][5][answer
source: <a name="where"></a> HTTPS Everywhere protects you only when you are using <em>encrypted portions of supported web sites</em>. On a supported site, it will automatically activate HTTPS encryption for all known supported parts of the site (for some sites, this might be only a portion of the entire site). For example, if your web mail provider does not support HTTPS at all, HTTPS Everywhere can't make your access to your web mail secure. Similarly, if a site allows HTTPS for text but not images, someone might be able to see which images your browser loads and guess what you're accessing. HTTPS Everywhere depends entirely on the security features of the individual web sites that you use; it <em>activates</em> those security features, but it can't <em>create</em> them if they don't already exist. If you use a site not supported by HTTPS Everywhere or a site that provides some information in an insecure way, HTTPS Everywhere can't provide additional protection for your use of that site. Please remember to check that a particular site's security is working to the level you expect before sending or receiving confidential information, including passwords. One way to determine what level of protection you're getting when using a particular site is to use a packet-sniffing tool like <a href="http://www.wireshark.org/">Wireshark</a> to record your own communications with the site. The resulting view of your communications is about the same as what an eavesdropper on your wifi network or at your ISP would see. This way, you can determine whether some or all of your communications would be protected; however, it may be quite time-consuming to make sense of the Wireshark output with enough care to get a definitive answer. You can also turn on the "Block all HTTP requests" feature for added protection. Instead of loading insecure pages or images, HTTPS Everywhere will block them outright.
fr: <a name="where"></a> HTTPS Everywhere vous protège uniquement lorsque vous utilisez des <em>parties chiffrés de sites Web pris en charge</em>. Sur un site compatible, il active automatiquement le chiffrement HTTPS pour toutes les parties du site Web qui sont pris en charge (pour certains sites, cela ne correspond qu'à une section de l’ensemble). Par exemple; si votre fournisseur de messagerie Web n'est pas du tout compatible HTTPS, HTTPS Everywhere ne peut pas sécuriser votre accès à votre messagerie Web. De même, si un site permet le HTTPS pour du texte, mais pas pour des images, quelqu'un pourrait être en mesure de voir quelles images sont chargées par votre navigateur et de deviner ce que visitez. HTTPS Everywhere repose entièrement sur les fonctionnalités de sécurité des sites Web individuels que vous utilisez ; il <em>active</em> les fonctions de sécurité, mais il ne peut pas les <em>créer</em> si elles n'existent pas déjà. Si vous utilisez un site qui n'est pas pris en charge par HTTPS Everywhere ou un site qui fournit certaines informations de manière non sécurisée, HTTPS Everywhere ne peut pas fournir de protection supplémentaire pour votre utilisation de ce site. N'oubliez pas de vous assurer que la sécurité d'un site particulier fonctionne au degré que vous attendez avant d'envoyer ou de recevoir des informations confidentielles, y compris des mots de passe. Une façon de déterminer le niveau de protection que vous obtenez lorsque vous visitez un site particulier est d'utiliser un analyseur de paquets comme <a href="http://www.wireshark.org/">Wireshark</a> pour enregistrer vos communications avec le site en question. La vue de vos communications qui en résulte est plus ou moins la même que ce qu'un espion sur votre réseau Wi-Fi ou chez votre FAI serait en mesure de voir. De cette façon, vous pouvez déterminer si l'ensemble ou une partie de vos communications seraient protégées. Toutefois, une telle vérification peut prendre beaucoup de temps avant qu vous puissiez comprendre suffisamment les données de Wireshark pour obtenir une réponse définitive. Vous pouvez aussi activer la fonction "Block all HTTP requests" (Bloquer toutes les requêtes HTTP) pour une protection supplémentaire. Au lieu de charger des pages ou des images non sécurisées, HTTPS Everywhere les bloquera immédiatement.

# 736][field_questions][6][question
source: What does HTTPS Everywhere protect me against?
fr: De quoi HTTPS Everywhere me protège-t-il ?

# 736][field_questions][6][answer
source: <p></p><a name="threats"></a><p>On supported parts of supported sites, HTTPS Everywhere enables the sites' HTTPS protection which can protect you against eavesdropping and tampering with the contents of the site or with the information you send to the site. Ideally, this provides some protection against an attacker learning the content of the information flowing in each direction — for instance, the text of e-mail messages you send or receive through a webmail site, the products you browse or purchase on an e-commerce site, or the particular articles you read on a reference site.</p><p>However, HTTPS Everywhere <strong>does not conceal the identities of the sites you access</strong>, the amount of time you spend using them, or the amount of information you upload or download from a particular site. For example, if you access http://www.eff.org/issues/nsa-spying and HTTPS Everywhere rewrites it to https://www.eff.org/issues/nsa-spying, an eavesdropper can still trivially recognize that you are accessing www.eff.org (but might not know which issue you are reading about). In general, the entire hostname part of the URL remains exposed to the eavesdropper because this must be sent repeatedly in unencrypted form while setting up the connection. Another way of saying this is that HTTPS was never designed to conceal the identity of the sites that you visit.</p><p>Researchers have also shown that it may be possible for someone to figure out more about what you're doing on a site merely through careful observation of the amount of data you upload and download, or the timing patterns of your use of the site. A simple example is that if the site only has one page of a certain total size, anyone downloading exactly that much data from the site is probably accessing that page.</p><p>If you want to protect yourself against monitoring of the sites you visit, consider using HTTPS Everywhere together with software like <a href="https://www.torproject.org/">Tor</a>.</p>
fr: <p></p><a name="threats"></a><p>Sur les parties prises en charge des sites Web compatibles, HTTPS Everywhere active la protection HTTPS de ces sites, ce qui peut vous protéger contre l'écoute clandestine et la falsification du contenu du site ou des informations que vous lui envoyez. Idéalement, cela offre une certaine protection en empêchant un attaquant d’apprendre le contenu des informations qui circulent dans chaque direction (par exemple, le texte des messages électroniques que vous envoyez ou recevez sur une messagerie Web, les produits que vous achetez sur un site de commerce éléctronique ou les pages spécifiques que vous lisez sur un site de référence).</p><p>Cependant, HTTPS Everywhere <strong>ne cache pas l'identité des sites vous visitez</strong>, la quantité de temps que vous passez à les utiliser ou la quantité d'informations que vous téléchargez ou que vous envoyez à partir d'un site Web particulier. Par exemple, si vous visitez http://www.eff.org/issues/nsa-spying et que HTTPS Everywhere le réécrit en https://www.eff.org/issues/nsa-spying, un espion pourrait quand même reconnaître facilement que vous accédez à www.eff.org (mais ne pourrait pas savoir le sujet que vous lisez). En général, toute la partie du nom d'hôte de l'URL reste exposée à un espion parce qu'elle doit être envoyée à plusieurs reprises sous forme non chiffrée lors de la mise en place de la connexion. Pour l’expliquer autrement, le protocole HTTPS n'a jamais été conçu pour cacher l'identité des sites que vous visitez.</p><p>Des chercheurs ont également montré qu'une personne pourrait en savoir plus sur ce que vous faites sur un site en observant attentivement la quantité de données que vous envoyez ou que vous téléchargez, ou les modes de synchronisation de votre visite du site. Un exemple simple est que si le site possède uniquement une page d'une taille précise, quiconque télécharge exactement autant de données à partir de ce site accède probablement à cette page.</p><p>Si vous souhaitez vous protéger contre la surveillance des sites que vous visitez, envisagez d'utiliser HTTPS Everywhere en combinaison avec un logiciel comme <a href="https://www.torproject.org/">Tor</a>.</p>

# 736][field_questions][7][question
source: How do I get support for an additional site in HTTPS Everywhere?
fr: Comment obtenir une assistance pour un site supplémentaire sur HTTPS Everywhere ?

# 736][field_questions][7][answer
source: <p><a name="sites"></a> You can learn <a href="https://www.eff.org/https-everywhere/rulesets">how to write rules</a> that teach HTTPS Everywhere to support new sites. You can install these rules in your own browser or send them to us for possible inclusion in the official version.</p>
fr: <p><a name="sites"></a> Vous pouvez apprendre à <a href="https://www.eff.org/https-everywhere/rulesets">écrire les règles</a> qui enseignent à HTTPS Everywhere de prendre en charge de nouveaux sites. Vous pouvez installer ces règles dans votre propre navigateur ou nous les envoyer pour qu'elles soient incluses éventuellement dans la version officielle.</p>

# 736][field_questions][8][question
source: What if the site doesn't support HTTPS, or only supports it for some activities, like entering credit card information?
fr: Que faire si le site ne prend pas en charge le protocole HTTPS, ou qu’il le prend en charge uniquement pour certaines activités, comme la saisie des informations de carte de crédit ?

# 736][field_questions][8][answer
source: <p><a href="https://letsencrypt.org/">https://letsencrypt.org/</a></p><a name="partial"></a><a name="amo"></a><p>You could try to contact the site and point out that using HTTPS for all site features is an increasingly common practice nowadays and protects users (and sites) against a variety of Internet attacks. For instance, it defends against the ability of other people on a wifi network to spy on your use of the site or even take over your account. You can also point out that credit card numbers aren't the only information you consider private or sensitive.</p><p>Sites like Google, Twitter, and Facebook now support HTTPS for non-financial information — for general privacy and security reasons.</p>
fr: <p><a href="https://letsencrypt.org/">https://letsencrypt.org/</a></p><a name="partial"></a><a name="amo"></a><p>Vous pourriez essayer de contacter le site et souligner que l'utilisation de HTTPS pour toutes les fonctions du site est une pratique de plus en plus répandue de nos jours et qu’elle protège les utilisateurs (ainsi que les sites) contre une variété d'attaques en ligne. Par exemple, elle empêche que d'autres personnes sur un réseau Wi-Fi puissent espionner votre utilisation du site ou même prendre le contrôle de votre compte. Vous pouvez également remarquer que les numéros de cartes de crédit ne sont pas la seule information que vous jugez privée ou sensible.</p><p>Des sites comme Google, Twitter et Facebook prennent désormais en charge le protocole HTTPS pour les informations qui ne sont pas financières, tant pour le respect de la vie privée que pour des raisons de sécurité.</p>

# 736][field_questions][9][question
source: Isn't it more expensive or slower for a site to support HTTPS compared to regular HTTP?
fr: Offrir du HTTPS n'est-il pas plus coûteux ou plus lent pour un site, comparé à une connexion HTTP normale ?

# 736][field_questions][9][answer
source: <p></p><a name="expensive"></a><p>It can be, but some sites have been pleasantly surprised to see how practical it can be. Also, experts at Google are currently implementing several enhancements to the TLS protocol that make HTTPS dramatically faster; if these enhancements are added to the standard soon, the speed gap between the two should almost disappear. See <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">Adam Langley's description of the HTTPS deployment situation</a> for more details on these issues. Notably, Langley states: "In order to [enable HTTPS by default for Gmail] we had to deploy no additional machines and no special hardware. On our production frontend machines, SSL/TLS accounts for less than 1% of the CPU load, less than 10KB of memory per connection and less than 2% of network overhead."</p><p>It used to be expensive to purchase a certificate for HTTPS usage, but they can now be obtained for free from <a href="http://www.startssl.com/">StartSSL</a> or <a href="https://buy.wosign.com/free/">WoSign</a>, and soon free certificate will be available from Let's Encrypt as well.</p>
fr: <p></p><a name="expensive"></a><p>Cela peut l'être effectivement, mais certains sites ont été agréablement surpris de voir combien cela peut être pratique. En outre, des experts de Google mettent actuellement en œuvre plusieurs améliorations au protocole TLS qui rendent HTTPS nettement plus rapide; si ces améliorations sont ajoutées bientôt au protocole HTTPS, l'écart de vitesse entre les deux devrait presque disparaître. Lisez la <a href="http://www.imperialviolet.org/2010/06/25/overclocking-ssl.html">description de la situation de déploiement de HTTPS par Adam Langley</a> pour plus de détails sur ces questions. Notamment, Langley affirme : « Pour [activer HTTPS par défaut pour Gmail] nous n'avons pas eu besoin de déployer de machine supplémentaire ou de matériel spécial. Sur nos ordinateurs frontaux de production, SSL/TLS consomme moins de 1 % de la charge CPU, moins de 10 Ko de mémoire par connexion et moins de 2 % de la charge du réseau. »</p><p>Avant, il était coûteux d'acheter un certificat pour utiliser HTTPS, mais ils peuvent maintenant être obtenus gratuitement par <a href="http://www.startssl.com/">StartSSL</a> ou <a href="https://buy.wosign.com/free/">WoSign</a>, et bientôt un certificat gratuit sera également disponible par Let's Encrypt.</p>

# 736][field_questions][10][question
source: Why should I use HTTPS Everywhere instead of just typing https:// at the beginning of site names?
fr: Pourquoi devrais-je utiliser HTTPS Everywhere au lieu de taper simplement https:// avant le nom d’un site ?
