Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID42_*.xlf
Languages: fr

# 851][field_questions][0][question
source: What is Privacy Badger?
fr: Qu'est-ce que le Badger de Confidentialité (Privacy Badger) ?

# 851][field_questions][0][answer
source: <a id="what_is_privacy_badger"></a>Privacy Badger is a browser add-on that stops advertisers and other third-party trackers from secretly tracking where you go and what pages you look at on the web. If an advertiser seems to be tracking you across multiple websites without your permission, Privacy Badger automatically blocks that advertiser from loading any more content in your browser. To the advertiser, it's like you suddenly disappeared.
fr: <a id="what_is_privacy_badger"></a>Le Badger de Confidentialité est une extension qui empêche les annonceurs et autres trackers tiers de pister les pages que vous visitez sur le web. Si un annonceur semble vous pister sans votre autorisation sur plusieurs sites Web, le Badger de Confidentialité l'empêche automatiquement de charger davantage de contenu dans votre navigateur. Pour l'annonceur, c'est comme si vous aviez soudainement disparu.

# 851][field_questions][1][question
source: How is Privacy Badger different to Disconnect, Adblock Plus, Ghostery, and other blocking extensions?
fr: En quoi le Badger de Confidentialité est-il différent de Disconnect, Adblock Plus, Ghostery et autres bloqueurs de trackers ?

# 851][field_questions][1][answer
source: <a id="how_is_it_different"></a>Privacy Badger was born out of our desire to be able to recommend a single extension that would automatically analyze and block any tracker or ad that violated the principle of user consent; which could function well without any settings, knowledge, or configuration by the user; which is produced by an organization that is unambiguously working for its users rather than for advertisers; and which uses algorithmic methods to decide what is and isn't tracking. Although we like Disconnect, Adblock Plus, Ghostery and similar products (in fact Privacy Badger is based on the ABP code!), none of them are exactly what we were looking for. In our testing, all of them required some custom configuration to block non-consensual trackers. Several of these extensions have business models that we weren't entirely comfortable with. And EFF hopes that by developing rigorous algorithmic and policy methods for detecting and preventing non-consensual tracking, we'll produce a codebase that could in fact be adopted by those other extensions, or by mainstream browsers, to give users maximal control over who does and doesn't get to know what they do online.
fr: <a id="how_is_it_different"></a>Le Badger de Confidentialité est né de notre désir de pouvoir recommander une seule et unique extension qui puisse analyser et bloquer automatiquement tout tracker ou publicité violant le principe de consentement de l'utilisateur ; qui puisse fonctionner correctement sans réglages, connaissances ou configuration de la part de celui-ci ; qui soit produit par une organisation travaillant sans ambiguïté pour ses utilisateurs, plutôt que pour les annonceurs ; et qui utilise des méthodes algorithmiques pour décider quels sites pistent l'utilisateur et quels ne le font pas. Bien que nous appréciions Disconnect, Adblock Plus, Ghostery et autres produits similaires (en fait, le Badger de Confidentialité est basé sur le code source de l'ABP!), aucun d'entre eux n'est exactement ce que nous recherchions. Lors de nos tests, ils nécessitaient tous une configuration personnalisée pour bloquer les trackers indésirables. Plusieurs de ces extensions ont des modèles d'affaires avec les quels nous n'étions pas tout à fait à l'aise. À l'EFF, nous espérons qu'en développant des méthodes algorithmiques et des politiques rigoureuses pour détecter et prévenir le pistage non désiré, nous produirons un code base qui pourrait en fait être adopté par ces autres extensions ou par les principaux navigateurs, afin de donner aux utilisateurs un contrôle maximal sur qui a le droit ou pas de savoir ce qu'ils font en ligne.

# 851][field_questions][2][question
source: How does Privacy Badger work?
fr: Comment fonctionne le Badger de Confidentialité ?

# 851][field_questions][2][answer
source: <a id="how_does_it_work"></a>When you view a webpage, that page will often be made up of content from many different sources. (For example, a news webpage might load the actual article from the news company, ads from an ad company, and the comments section from a different company that's been contracted out to provide that service.) Privacy Badger keeps track of all of this. If as you browse the web, the same source seems to be tracking your browser across different websites, then Privacy Badger springs into action, telling your browser not to load any more content from that source. And when your browser stops loading content from a source, that source can no longer track you. Voila! At a more technical level, Privacy Badger keeps note of the "third party" domains that embed images, scripts and advertising in the pages you visit. If a third party server appears to be tracking you without permission, by using uniquely identifying cookies (and, as of version 1.0, local storage super cookies and canvas fingerprinting as well) to collect a record of the pages you visit across multiple sites, Privacy Badger will automatically disallow content from that third party tracker. In some cases a third-party domain provides some important aspect of a page's functionality, such as embedded maps, images, or stylesheets. In those cases Privacy Badger will allow connections to the third party but will screen out its tracking cookies and referrers. <p align="right">[<a href="#top">top</a>]</p>
fr: <a id="how_does_it_work"></a>Lorsque vous visitez une page Web, cette page est souvent composée de contenu provenant de nombreuses sources différentes (par exemple, une page web peut charger l'article principal à partir d'un site d'actualités, des annonces à partir d'une agence de publicité et la section de commentaires à partir d'une autre agence sous-traitant ce service). Le Badger de Confidentialité garde une trace de tout cela. Si, en surfant sur le web, la même source semble pister votre navigateur à travers plusieurs sites, le Badger de Confidentialité entre alors en action, indiquant à votre navigateur de ne plus charger de contenu provenant de celle-ci. Et, si votre navigateur cesse de charger du contenu depuis cette source, celle-ci ne peut donc plus vous pister. Le tour est joué ! Sur un niveau plus technique, le Badger de Confidentialité prend note des sites tiers qui intègrent des images, des scripts et des publicités dans les pages que vous visitez. Si un serveur tiers semble vous pister sans autorisation en utilisant des cookies d'identification unique (et, depuis la version 1.0, les supercookies de stockage local ainsi que le canvas fingerprinting) pour recueillir sur plusieurs sites les pages que vous visitez, le Badger de Confidentialité bloque automatiquement le contenu provenant de ce tracker tiers. Parfois, un site tiers fournit certains aspects importants de la fonctionnalité d'une page, tels que les cartes, les images ou les feuilles de style. Dans ce genre de cas, le Badger de Confidentialité autorise les connexions à ce site tiers mais élimine ses cookies de pistage et ses référenceurs. <p align="right">[<a href="#top">haut de page</a>]</p>

# 851][field_questions][3][question
source: What is a third party tracker?
fr: Qu'est-ce qu'un tracker tiers ?

# 851][field_questions][3][answer
source: <a id="trackers"></a>When you visit a webpage parts of the page may come from domains and servers other than the one you asked to visit. This is an essential feature of <a href="https://en.wikipedia.org/wiki/Hypertext">hypertext</a>, but it has also come to be a serious privacy problem. On the modern Web, embedded images and code often use cookies and other methods to track your browsing habits — often to display advertisements. The domains that do this are called "third party trackers", and you can read more about how they work <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">here</a>.
fr: <a id="trackers"></a>Lorsque vous visitez une page Web, certaines parties de la page peuvent provenir de sites et de serveurs autres que ceux que vous avez demandés de visiter. C'est une caractéristique essentielle de l'<a href="https://en.wikipedia.org/wiki/Hypertext">hypertexte</a>, qui est cependant devenue un grave souci de confidentialité. Dans le Web moderne, les images et le code intégrés utilisent souvent des cookies et d'autres méthodes pour pister vos habitudes de navigation, souvent dans le but d'afficher des publicités. Les sites qui font cela sont appelés des "trackers tiers", et vous pouvez en savoir plus sur leur mode de fonctionnement <a href="https://www.eff.org/deeplinks/2009/09/online-trackers-and-social-networks">ici</a>.

# 851][field_questions][4][question
source: What do the red, yellow and green sliders in the Privacy Badger menu mean?
fr: Quelle est la signification des barres coulissantes rouge, jaune et vert dans le menu du Badger de Confidentialité ?

# 851][field_questions][4][answer
source: <a id="what_do_the_colors_mean"></a>The colors mean the following: <ul><li>Green means there's a third party domain, but it hasn't yet been observed tracking you across multiple sites, so it might be unobjectionable. When you first install Privacy Badger every domain will be in this green state but as you browse, domains will quickly be classified as trackers.</li> <li>Yellow means that the third party domain appears to be trying to track you, but it is on Privacy Badger's cookie-blocking "yellowlist" of third party domains that, when analyzed, seemed to be necessary for Web functionality. In that case, Privacy Badger will load content from the domain but will try to screen out third party cookies and referrers from it.</li> <li>Red means that content from this third party tracker has been completely disallowed.</li> </ul> Privacy Badger analyzes each third party's behavior over time, and picks what it thinks is the right setting for each domain, but you can adjust the sliders if you wish.
fr: <a id="what_do_the_colors_mean"></a>Les couleurs signifient ceci : <ul><li>Le vert montre qu'il s'agit d'un site tiers n'ayant pas encore été observé en train de vous pister sur plusieurs sites Web, il pourrait donc être tolérable. Lors de l'installation initiale du Badger de Confidentialité, tous les sites sont marqués en vert, mais, après avoir surfé un peu sur le Web, certains d'entre eux seront rapidement classés comme des trackers.</li> <li>Le jaune montre que le site tiers semble essayer de vous pister, mais qu'il se trouve dans la "liste jaune" de blocage de cookies du Badger de Confidentialité concernant des sites tiers qui, une fois analysés, semblaient nécessaires pour la fonctionnalité du site que vous visitez. Dans ce cas, le Badger de Confidentialité charge du contenu provenant de ce site tout en éliminant ses cookies tiers et ses référenceurs.</li> <li>Le rouge montre que le contenu de ce tracker tiers a été complètement interdit.</li> </ul> Le Badger de Confidentialité analyse le comportement de chaque site tiers au fil du temps et choisit le paramètre qu'il considère adapté pour chaque site, cependant, vous pouvez ajuster les barres coulissantes si vous le souhaitez.

# 851][field_questions][5][question
source: Why does Privacy Badger block ads?
fr: Pourquoi le Badger de Confidentialité bloque-t-il les publicités ?

# 851][field_questions][5][answer
source: <a id="why_does_privacy_badger_block_ads"></a>Actually, nothing in the Privacy Badger code is specifically written to block ads. Rather, it focuses on disallowing any visible or invisible "third party" scripts or images that appear to be tracking you even though you specifically denied consent by sending a Do Not Track header. It just so happens that most (but not all) of these third party trackers are advertisements. When you see an ad, the ad sees you, and can track you. Privacy Badger is here to stop that.
fr: <a id="why_does_privacy_badger_block_ads"></a>En réalité, rien dans le code du Badger de Confidentialité n'a été spécifiquement écrit pour bloquer les publicités. Il se concentre plutôt à empêcher les scripts ou les images tiers, visibles ou invisibles, qui semblent vous pister, même si vous avez spécifiquement refusé d'y consentir, en envoyant un en-tête Do Not Track (Ne pas me pister). Le fait est que la plupart (mais pas la totalité) des trackers tiers sont des publicités. Quand vous voyez une publicité, celle-ci vous voit également et peut vous pister. Le Badger de Confidentialité est là pour empêcher cela.

# 851][field_questions][6][question
source: Why doesn't Privacy Badger block all ads?
fr: Pourquoi le Badger de Confidentialité ne bloque-t-il pas toutes les publicités ?

# 851][field_questions][6][answer
source: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Because Privacy Badger is primarily a privacy tool, not an ad blocker. Our aim is not to block ads, but to prevent non-consensual invasions of people's privacy because we believe they are inherently objectionable. We also want to create incentives for advertising companies to do the right thing. Of course, if you really dislike ads, you can also install a traditional ad blocker.<a name="dnt-policy"></a>
fr: <a id="why_doesnt_privacy_badger_block_all_ads"></a>Parce que le Badger de Confidentialité est avant tout un outil de confidentialité, pas un bloqueur de publicité. Notre but n'est pas de bloquer les publicités, mais de prévenir les invasions de votre confidentialité sans votre accord, car nous les considérons fondamentalement inacceptables. De plus, nous voulons fournir des incitations aux agences de publicité pour qu'elles agissent dans le bon sens. Bien sûr, si vous n'aimez vraiment pas les publicités, vous pouvez installer également un bloqueur de publicité traditionnel.<a name="dnt-policy"></a>

# 851][field_questions][7][question
source: What about tracking by the sites I actively visit, like NYTimes.com or Facebook.com?
fr: Qu'en est-il du pistage provenant des sites que je visite, tels que NYTimes.com ou Facebook.com ?

# 851][field_questions][7][answer
source: <a id="what_about_first_party_tracking"></a>For the time being, Privacy Badger only protects you against tracking by third party sites. In the future we plan to add some privacy protections for "first party" sites that you actually visit. We are doing things in this order because the most scandalous, intrusive and objectionable form of online tracking is that conducted by companies you've <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">often never heard of</a> and have no relationship with. First and foremost, Privacy Badger is there to enforce Do Not Track against these domains by providing the technical means to restrict access to their tracking scripts and images. The right policy for whether nytimes.com, facebook.com or google.com can track you <i>when you visit that site</i> – and the technical task of preventing it – is more complicated because often (though not always) tracking is interwoven with the features the site offers, and sometimes (though not always) users may understand that the price of an excellent free tool like Google's search engine is measured in privacy, not money.
fr: <a id="what_about_first_party_tracking"></a>Pour l'instant, le Badger de Confidentialité vous protège seulement contre le pistage effectué par des sites tiers. À l'avenir, nous prévoyons d'ajouter quelques protections de confidentialité pour les sites que vous visitez réellement. Nous faisons les choses dans cet ordre-là car la forme la plus scandaleuse, la plus intrusive et la plus inacceptable de pistage en ligne est celle menée par des agences dont vous n'avez <a href="http://mediamemo.allthingsd.com/files/2010/09/LUMA-display-ad-map.jpg">souvent jamais entendu parler</a>, avec lesquelles vous n'avez aucune relation. Le Badger de Confidentialité est là, avant tout, pour faire respecter le réglage Do Not Track (Ne pas me pister) par ces sites en fournissant les moyens techniques pour limiter l'accès à leurs images et scripts de pistage. Établir de bonnes règles pour savoir si nytimes.com, facebook.com ou google.com peuvent vous pister <i>quand vous visitez leur site</i> (ainsi que la tâche technique de le prévenir) est plus compliqué car souvent (mais pas toujours) le pistage est mêlé aux fonctionnalités du site et parfois (mais pas toujours) les utilisateurs peuvent accepter que le prix d'un excellent outil gratuit tel que le moteur de recherche de Google soit mesuré en termes de confidentialité et pas en termes d'argent.

# 851][field_questions][8][question
source: Does Privacy Badger contain a "black list" of blocked sites?
fr: Le Badger de Confidentialité contient-il une « liste noire » de sites bloqués ?

# 851][field_questions][8][answer
source: <a id="is_there_a_black_list"></a>No, unlike other blocking tools like AdBlock Plus, we have not made decisions about which sites to block, but rather about which behavior is objectionable. Domains will only be blocked or screened if the Privacy Badger code inside your browser actually observes the domain collecting unique identifiers after it was sent a Do Not Track message. Privacy Badger <i>does</i> contain a "<a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">yellowlist</a>" of some sites that are known to provide essential third party resources; those sites show up as yellow and have their cookies blocked rather than being blocked entirely. This is a compromise with practicality, and in the long term we hope to phase out the yellowlist as these third parties begin to <a href="/dnt-policy">explicitly commit to respecting Do Not Track</a>. The criteria for including a domain on the yellowlist can be <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">found here</a>.
fr: <a id="is_there_a_black_list"></a>Non, contrairement à d'autres outils de blocage comme AdBlock Plus, nous n'avons pas décidé quels sites doivent être bloqués, mais plutôt quel comportement n'est pas acceptable. Les sites seront bloqués ou filtrés uniquement si le code du Badger de Confidentialité à l'intérieur de votre navigateur observe que le site recueille des identificateurs uniques malgré le fait d'avoir reçu un message Do Not Track. Par contre, le Badger de Confidentialité <i>contient</i> une « <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/doc/sample_cookieblocklist.txt">liste jaune</a> » de certains sites connus pour fournir des ressources tierces essentielles ; ces sites apparaissent en jaune mais ils ne sont pas bloqués entièrement ; seuls leur cookies sont bloqués. C'est un compromis pour la praticité. À long terme, nous espérons éliminer progressivement cette liste jaune au fur et à mesure que ces sites tiers <a href="/dnt-policy">s'engagent explicitement à respecter le message Do Not Track</a>. Les critères d'inclusion d'un site dans la liste jaune sont disponibles <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/yellowlist-criteria.txt" target="_blank">ici</a>.

# 851][field_questions][9][question
source: How was the cookie blocking yellowlist created?
fr: Comment la liste jaune de blocage de cookies a-t-elle été créée ?

# 851][field_questions][9][answer
source: <a id="how_was_the_white_list_created"></a>The initial list of domains that should be cookie blocked rather than blocked entirely was derived from a <a href="https://jonathanmayer.org/papers_data/bau13.pdf">research project</a> on classifying third party domains as trackers and non-trackers. We will make occasional adjustments to it as necessary. If you find domains that are under- or over-blocked, please <a href="https://github.com/EFForg/privacybadgerchrome/issues">file a bug</a> on Github.
fr: <a id="how_was_the_white_list_created"></a>La liste initiale des sites dont uniquement les cookies devraient être bloqués et non les sites en entier est dérivée d'un <a href="https://jonathanmayer.org/papers_data/bau13.pdf">projet de recherche</a> pour classifiér les sites tiers en trackers et en non-trackers. Nous ferons des ajustements occasionnels, si nécessaire. Si vous trouvez des sites qui sont trop ou pas suffisamment bloqués, veuillez <a href="https://github.com/EFForg/privacybadgerchrome/issues">remplir un rapport de bogue</a> sur Github.

# 851][field_questions][10][question
source: Does Privacy Badger prevent fingerprinting?
fr: Le Badger de Confidentialité empêche-t-il la prise d'empreintes digitales ?

# 851][field_questions][10][answer
source: <a id="does_it_prevent_fingerprinting"></a>Browser fingerprinting is an extremely subtle and problematic method of tracking, which we <a href="https://panopticlick.eff.org">documented with the Panopticlick project</a>. Privacy Badger 1.0 can detect <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">based</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank">fingerprinting</a>, and will block third party domains that use it. Detection of other forms of fingerprinting and protections against first-party fingerprinting are ongoing projects. Of course, once a domain is blocked by Privacy Badger, it will no longer be able to fingerprint you as a third-party.
fr: <a id="does_it_prevent_fingerprinting"></a>L'empreinte digitale de navigateur (browser fingerprinting) est une méthode de pistage extrêmement subtile et problematique, que nous avons <a href="https://panopticlick.eff.org">documentée avec le projet Panopticlick</a>. Le Badger de Confidentialité 1.0 peut détecter le <a href="http://janhkrueger.de/gitpup/RSSArtikel/raw/bd53c81bd5d1ee434d76a64ece26de1aac3a218d/w2sp12-final4.pdf" target="_blank">canvas</a> <a href="http://filelifter.de/assets/plugindata/poola/thewebneverforgets.pdf" target="_blank">fingerprinting</a> <a href="https://www.propublica.org/article/meet-the-online-tracking-device-that-is-virtually-impossible-to-block" target="_blank"></a>et bloque les sites qui l'utilisent. La détection d'autres formes d'empreintes digitales et la protection contre l'identification par les sites visités sont des projets en cours. Bien sûr, une fois qu'un site tiers est bloqué par le Badger de Confidentialité, il n'est plus en mesure de soutirer vos empreintes digitales.

# 851][field_questions][11][question
source: Does Privacy Badger consider every cookie to be a tracking cookie?
fr: Le Badger de Confidentialité considère-t-il chaque cookie comme un cookie de pistage ?
