Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID38_*.xlf
Languages: fr

# 740][body][0][value
source: <a name="about"></a> <div class="section"> <h2>About</h2> For years, privacy and security experts worldwide have called on the general public to adopt strong, open-source cryptography to protect our communications. The Snowden revelations have confirmed our worst fears: governments are spying on our digital lives, grabbing up communications transmitted in the clear. Given widespread government surveillance, why don’t people routinely use tools to encrypt their communications? Wouldn’t we all communicate a little more freely without the shadow of surveillance? It boils down to two things: security and usability. Most of the tools that are easy for the general public to use don’t rely on security best practices--including end-to-end encryption and open source code. Messaging tools that are really secure often aren’t easy to use; everyday users may have trouble installing the technology, verifying its authenticity, setting up an account, or may accidentally use it in ways that expose their communications. EFF, in collaboration with Julia Angwin at ProPublica and Joseph Bonneau at the Princeton Center for Information Technology Policy, are joining forces to launch a campaign for secure and usable crypto. We are championing technologies that are strongly secure and also simple to use. The Secure Messaging Scorecard examines dozens of messaging technologies and rates each of them on a range of security best practices. Our campaign is focused on communication technologies -- including chat clients, text messaging apps, email applications, and video calling technologies. These are the tools everyday users need to communicate with friends, family members, and colleagues, and we need secure solutions for them. We chose technologies that have a large user base--and thus a great deal of sensitive user communications--in addition to smaller companies that are pioneering advanced security practices. We’re hoping our scorecard will serve as a race-to-the-top, spurring innovation around strong crypto for digital communications. </div> <a name="methodology"></a> <div class="section"> <h2>Methodology</h2> <p dir="ltr">Here are the criteria we looked at in assessing the security of various communication tools.</p> <p dir="ltr"><a name="encrypted"></a><strong>1. Is your communication encrypted in transit?</strong> This criterion requires that all user communications are encrypted along all the links in the communication path. Note that we are not requiring encryption of data that is transmitted on a company network, though that is ideal. We do not require that metadata (such as user names or addresses) is encrypted.</p> <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong>2.</strong> <strong>Is your communication encrypted with a key the provider doesn't have access to?</strong> This criterion requires that all user communications are end-to-end encrypted. This means the keys necessary to decrypt messages must be generated and stored at the endpoints (i.e. by users, not by servers). The keys should never leave endpoints except with explicit user action, such as to backup a key or synchronize keys between two devices. It is fine if users' public keys are exchanged using a centralized server.</p> <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong>3.</strong> <strong>Can you independently verify your correspondent's identity?</strong>{tjiid740-43}This criterion requires that a built-in method exists for users to verify the identity of correspondents they are speaking with and the integrity of the channel, even if the service provider or other third parties are compromised. Two acceptable solutions are:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a>An interface for users to view the fingerprint (hash) of their correspondent's public keys as well as their own, which users can verify manually or out-of-band.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a>A key exchange protocol with a short-authentication-string comparison, such as the <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">Socialist Millionaire's protocol</a>.</p> </li> </ul><p dir="ltr">Other solutions are possible, but any solution must verify a binding between users and the cryptographic channel which has been set up. For the scorecard, we are simply requiring that a mechanism is implemented and not evaluating the usability and security of that mechanism.</p> <p dir="ltr"><a name="pfs"></a><strong>4.</strong> <strong>Are past communications secure if your keys are stolen?</strong> This criterion requires that the app provide <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">forward secrecy</a>, that is, all communications must be encrypted with ephemeral keys which are routinely deleted (along with the random values used to derive them). It is imperative that these keys cannot be reconstructed after the fact by anybody even given access to both parties' long-term private keys, ensuring that if users choose to delete their local copies of correspondence, they are permanently deleted. Note that this criterion requires criterion 2, end-to-end encryption.</p> <p dir="ltr"><em style="line-height: 20.0063037872314px;">Note: For this phase of the campaign, we accept a hybrid forward-secrecy approach with forward secrecy on the transport layer (for example through TLS with a Diffie-Hellman cipher suite) and non-forward-secret end-to-end encryption, plus an explicit guarantee that ciphertexts are not logged by the provider. This is a compromise as it requires trusting the provider not to log ciphertexts, but we prefer this setup to having no forward secrecy at all.</em></p> <p dir="ltr"><a name="open"></a><strong>5.</strong> <strong>Is the code open to independent review?</strong> This criterion requires that sufficient source-code has been published that a compatible implementation can be independently compiled. Although it is preferable, we do not require the code to be released under any specific free/open source license. We only require that all code which could affect the communication and encryption performed by the client is available for review in order to detect bugs, back doors, and structural problems.</p> <a name="open"></a><em>Note: when tools are provided by an operating system vendor, we only require code for the tool and not the entire OS. This is a compromise, but the task of securing OSes and updates to OSes is beyond the scope of this project.</em> <a name="open"></a> <p dir="ltr"><a name="open"></a><a name="documented"></a><strong>6. Is the crypto design well-documented?</strong> This criterion requires clear and detailed explanations of the cryptography used by the application. Preferably this should take the form of a white-paper written for review by an audience of professional cryptographers. This must provide answers to the following questions:</p> <ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Which algorithms and parameters (such as key sizes or elliptic curve groups) are used in every step of the encryption and authentication process</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>How keys are generated, stored, and exchanged between users</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>The life-cycle of keys and the process for users to change or revoke their key</p> </li> <li dir="ltr"> <p dir="ltr"><a name="documented"></a>A clear statement of the properties and protections the software aims to provide (implicitly, this tends to also provide a threat model, though it's good to have an explicit threat model too). This should also include a clear statement of scenarios in which the protocol is not secure. </p> </li> </ul><a name="documented"></a> <p dir="ltr"><a name="documented"></a><a name="audited"></a><strong>7.</strong> <strong>Has there been an independent security audit?</strong></p> <p dir="ltr"><a name="audited"></a>This criterion requires an independent security review has been performed within the 12 months prior to evaluation. This review must cover both the design and the implementation of the app and must be performed by a named auditing party that is independent of the tool's main development team. Audits by an independent security team within a large organization are sufficient. Recognizing that unpublished audits can be valuable, we do not require that the results of the audit have been made public, only that a named party is willing to verify that the audit took place.</p> <p dir="ltr">We've discussed this criterion in depth in a Deeplinks post: <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">What Makes a Good Security Audit?</a>{tjiid740-148} </p> </div> <a name="about"></a> <div class="section"><a name="changelog"></a> <h2>Changelog</h2> Entries in the <a href="#">Secure Messaging Scorecard</a> were checked with the listed projects and companies when the Scorecard launched on 2014-11-06. Updates will be made if the listees or others inform us of changes or inaccuracies. A log of all such changes is below: <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">2015-06-12</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We removed Secret as the service was <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">shut down</a> in May 2015.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-03-06</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited QQ for completing an independent internal security audit (<span style="color: #008000;">✓</span>)<span style="line-height: 20.0063037872314px;">.</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-02-17</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>We credited Telegram (both secret and regular mode) for undergoing a code audit in February 2015 <span style="line-height: 20.0063037872314px;">(</span><span style="line-height: 20.0063037872314px; color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">).</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">2015-01-29</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li><span style="line-height: 20.0063037872314px;">We have credited QQ for encrypting messages in transit </span><span style="line-height: 20.0063037872314px;">(</span><span style="color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">). Though QQ does not use TLS/SSL, which is considered best practice, they have implemented a custom protocol for message encryption in transit.</span></li> <li><span style="line-height: 20.0063037872314px;">We have clarified our scoring for forward secrecy (criterion #4).</span></li> </ul></li> <li><strong style="line-height: 1.538em;">2015-01-05</strong><span style="line-height: 1.538em;"> :</span> <ul><li><span style="line-height: 1.538em;">We have split the scoring for Telegram into two rows: baseline Telegram and Telegram secret chats. Baseline Telegram chats are not end-to-end encrypted so that the provider can't read them (</span><span style="color: #ff0000;" data-mce-mark="1">✘</span><span style="line-height: 1.538em;">). Telegram secret chats are, and in addition Telegram now </span><a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;">supports perfect forward secrecy</a><span style="line-height: 1.538em;"> so that messages can be securely deleted (</span><span style="color: #008000;" data-mce-mark="1">✓</span><span style="line-height: 1.538em;">)</span></li> <li><span style="line-height: 1.538em;">Wickr now provides the ability to verify contact's identities by exposing key fingerprints, which can be verified out-of-band or through in-band video. (</span><span style="line-height: 1.538em;">✓</span><span style="line-height: 1.538em;">)</span></li> </ul></li> </ul><ul><li><strong>2014-11-14</strong> : <ul><li>RIM has told us that BlackBerry Messenger Protected uses an <a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf">out-of-band passphrase exchange</a> and <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)">EC-SPEKE</a> to perform identity verification. (✓) RIM has also told us that BBM Protected receives security reviews by an internal security team. (✓)</li> <li>Viber has received a recent external security audit from EY Advanced Security Center. (✓)</li> <li>Pidgin has documented a number of auditing processes including regular use of static analysis tools and audits by a team at Cisco Talos. The Pidgin developers were clear that they do not know how thorough and complete these audits have been, but the audits nonetheless <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">meet our criteria</a>. (✓) Although auditing of Pidgin improves the security of the related Adium project (the projects share many components including libpurple, libotr, and libxml2), the Adium developers tell us that besides occasional static analysis by the developers themselves they are not aware of any independent auditing effort that addresses the Adium-specific code. So for the time being that project will not receive an audit checkmark.</li> </ul></li> <li><strong>2014-11-10</strong> : Skype check mark for end-to-end encryption <a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption">removed</a>. (✘)</li> <li><strong>2014-11-04</strong> : Snapchat app has audits from an internal security team. (✓)</li> </ul></div>
fr: <a name="about"></a> <div class="section"> <h2>À propos</h2> Pendant des années, des experts de la confidentialité et de la sécurité dans le monde entier ont appelé le public à adopter une cryptographie forte et open source afin de protéger nos communications. Les révélations de Snowden ont confirmé nos pires craintes : les gouvernements épient nos vies numériques, saisissant des communications transmises en clair. Étant donné la surveillance gouvernementale généralisée, pourquoi les gens n’utilisent pas couramment des outils pour chiffrer leurs communications ? Ne communiquerions-nous pas tous un peu plus librement sans l'ombre de la surveillance ? Cela se résume à deux choses : sécurité et convivialité. La plupart des outils qui sont faciles à utiliser par le grand public n’appliquent pas des pratiques exemplaires de sécurité (y compris le cryptage de bout à bout et le code source ouvert). Les outils de messagerie qui sont vraiment sécurisés ne sont souvent pas faciles à utiliser ; les utilisateurs quotidiens peuvent avoir des difficultés pour installer la technologie nécessaire, pour vérifier son authenticité, pour créer un compte, ou peuvent les utiliser accidentellement de manière qui expose leurs communications. L’EFF, en collaboration avec Julia Angwin de ProPublica et Joseph Bonneau du Princeton Center for Information Technology Policy, unissent leurs forces pour lancer une campagne pour une cryptographie sécurisée et conviviale. Nous défendons des technologies qui sont très sécurisés mais aussi simples à utiliser. La Fiche d’évaluation de messagerie sécurisée (Secure Messaging Scorecard) examine des dizaines de technologies de messagerie et évalue chacune d’entre elles sur une série des meilleures pratiques de sécurité. Notre campagne est axée sur les technologies de communication (y compris les clients de messagerie instantanée, des applications de messagerie texte, des applications de messagerie électronique et les technologies d’appels vidéo). Ce sont les outils dont les utilisateurs quotidiens ont besoin pour communiquer avec leurs amis, leur famille et leurs collègues, et nous avons devons pouvoir leur proposer des solutions sécurisées. Nous avons choisi des technologies qui ont une base importante d'utilisateurs (et donc beaucoup de communications sensibles) en outre de plus petites entreprises qui innovent en matière de pratiques de sécurité. Nous espérons que la fiche d'évaluation servira à une course vers l’excellence, stimulant l'innovation autour d’une cryptographie forte des communications numériques. </div> <a name="methodology"></a> <div class="section"> <h2>Méthodologie</h2> <p dir="ltr">Voici les critères que nous avons examinés dans l'évaluation de la sécurité des différents outils de communication.</p> <p dir="ltr"><a name="encrypted"></a><strong>1. Votre communication est-elle chiffrée en transit ?</strong> Ce critère exige que les communications de l’utilisateur soient chiffrées sur toutes les liaisons dans la voie de communication. Veuillez noter que nous n'exigeons pas le chiffrement des données qui sont transmises sur un réseau d'entreprise, même si ce serait l'idéal. Nous ne demandons pas que les métadonnées (telles que les adresses ou noms d'utilisateurs) soient chiffrées.</p> <a name="encrypted"></a> <p dir="ltr"><a name="encrypted"></a><a name="e2e"></a><strong>2.</strong> <strong>Votre communication est-elle chiffrée avec une clé à laquelle le fournisseur n'a pas accès ?</strong> Ce critère exige que toutes les communications de l'utilisateur soient chiffrées de bout en bout. Cela signifie que les clés nécessaires pour décrypter les messages doivent être générées et stockées dans les points de terminaison (c.-à-d. par les utilisateurs, et non par les serveurs). Les clés devraient jamais laisser de points de terminaison sauf par une action explicite de l'utilisateur, comme celle de créer une clé de sauvegarde ou de synchroniser des clés entre deux périphériques. C’est acceptable que les clés publiques des utilisateurs soient échangées à l'aide d'un serveur centralisé.</p> <a name="e2e"></a> <p dir="ltr"><a name="e2e"></a><a name="verify"></a><strong>3.</strong> <strong>Pouvez-vous vérifier de façon indépendante l’identité de votre correspondant ? </strong>{tjiid740-43}Ce critère exige qu'il existe une méthode intégrée pour que les utilisateurs puissent vérifier l'identité de leurs correspondants ainsi que l'intégrité du canal de communication, même si le fournisseur de services ou d'autres tierces parties sont compromis. Deux solutions acceptables sont :</p> <ul><li dir="ltr"> <p dir="ltr"><a name="verify"></a>Une interface pour que les utilisateurs puissent afficher l'empreinte (hash) de clés publiques de leurs correspondants ainsi que la leur, permettant de les vérifier ensuite manuellement ou en local.</p> </li> <li dir="ltr"> <p dir="ltr"><a name="verify"></a>Un protocole d'échange de clés avec une comparaison de type Short Authentification String (SAS), tel que le <a href="http://en.wikipedia.org/wiki/Socialist_millionaire" style="line-height: 1.538em;">protocole du millionnaire socialiste</a>.</p> </li> </ul><p dir="ltr">D’autres solutions sont possibles, mais toute solution doit vérifier la liaison entre les utilisateurs et le canal de chiffrement qui a été mis en place. Pour la fiche d’évaluation, nous demandons simplement qu'un mécanisme soit présent et nous n’évaluons pas sa facilité d'utilisation ni sa sécurité.</p> <p dir="ltr"><a name="pfs"></a><strong>4.</strong> <strong>Les communications passées sont-elles sécurisées si vos clés sont volées ?</strong> Ce critère exige que l'application offre une <a href="https://www.eff.org/deeplinks/2013/08/pushing-perfect-forward-secrecy-important-web-privacy-protection">confidentialité persistante</a> (forward secrecy), autrement dit, que toutes les communications soient chiffrées avec des clés éphémères qui sont systématiquement supprimés (de même que les valeurs aléatoires utilisées pour leur création). Il est impératif que ces clés ne puissent pas être reconstruites après le fait par quiconque même s’il a obtenu l’accès aux clés privées à long terme des deux parties, garantissant ainsi que si les utilisateurs choisissent de supprimer leurs copies locales de correspondance, que celles-ci sont définitivement supprimées. Notez que ce critère exige le critère numéro 2, un chiffrement de bout en bout.</p> <p dir="ltr"><em style="line-height: 20.0063037872314px;">Remarque : Pour cette phase de la campagne, nous acceptons une approche hybride utilisant la confidentialité persistante sur la couche de transport (par exemple par le biais de TLS avec une suite de chiffrement Diffie-Hellman) et un chiffrement de bout en bout sans confidentialité persistante, plus une garantie explicite que les textes chiffrés ne sont pas enregistrées par le fournisseur. Il s'agit d'un compromis car il faut faire confiance au fournisseur de ne pas enregistrer les textes chiffrés, mais nous préférons cette configuration plutôt que de n’avoir aucune forme de confidentialité persistante.</em></p> <p dir="ltr"><a name="open"></a><strong>5.</strong> <strong>Le code est-il ouvert à un examen indépendant ?</strong> Ce critère exige qu’une portion suffisante de code source ait été publiée afin qu'une implémentation compatible puisse être compilée de manière indépendante. Bien que cela soit préférable, nous ne demandons pas que le code soit distribué sous une licence libre ou open source spécifique. Nous demandons seulement que l’ensemble du code qui pourrait affecter la communication et le chiffrement effectué par le client soit disponible pour examen afin de pouvoir détecter des bogues, des portes dérobées et des problèmes structurels.</p> <a name="open"></a><em>Remarque : lorsque les outils sont fournis par un vendeur de système d'exploitation, nous avons seulement besoin du code de l'outil et non pas de l'OS en entier. Il s'agit d'un compromis, mais la tâche de sécuriser les systèmes d'exploitation et les mises à jour de systèmes d'exploitation dépasse le cadre de ce projet.</em> <a name="open"></a> <p dir="ltr"><a name="open"></a><a name="documented"></a><strong>6. La conception cryptographique est-elle bien documentée ?</strong> Ce critère exige qu’il existe des explications claires et détaillées de la cryptographie utilisée par l'application. De préférence, cela devrait prendre la forme d'un livre blanc écrit pour une vérification par un public de cryptographes professionnels. Cela doit apporter des réponses aux questions suivantes :</p> <ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Quels algorithmes et paramètres (tels que les tailles de clés ou les groupes de courbes elliptiques) sont-ils utilisés à chaque étape du processus de cryptage et d'authentification ?</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Comment les clés sont-elles générées, stockées et échangées entre les utilisateurs ?</p> </li> </ul><ul><li dir="ltr"> <p dir="ltr"><a name="documented"></a>Quel est le cycle de vie des clés et le processus pour que les utilisateurs puissent modifier ou révoquer leur clé ?</p> </li> <li dir="ltr"> <p dir="ltr"><a name="documented"></a>Une déclaration claire des propriétés et des protections que le logiciel a pour but de fournir (implicitement, cela tend à fournir également un modèle de menace, mais il est bon de prévoir en outre un modèle de menace explicite). Cela devrait inclure en outre un énoncé clair des scénarios dans lesquels le protocole n'est pas sûr. </p> </li> </ul><a name="documented"></a> <p dir="ltr"><a name="documented"></a><a name="audited"></a><strong>7.</strong> <strong>Un audit de sécurité indépendant a-t-il été conduit ?</strong></p> <p dir="ltr"><a name="audited"></a>Ce critère exige qu'un audit de sécurité indépendant ait été effectué dans les 12 mois avant l'évaluation. Cette vérification doit couvrir le concept ainsi que la mise en œuvre de l’application et doit être effectué par un service d’audit reconnu, indépendant de l'équipe principale de développement de l'outil. Un audit réalisé par une équipe de sécurité indépendante au sein d'une organisation de grande taille est jugé adéquat. Reconnaissant que les audits non publiés peuvent être précieux, nous n’exigeons pas que les résultats de l’audit aient été rendus publiques, seulement qu'une partie nommée soit disposée de s’assurer que la vérification a eu lieu.</p> <p dir="ltr">Nous avons discuté de ce critère en profondeur dans article des Deeplinks : <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">Qu’est-ce qui constitue un bon audit de sécurité ?</a>{tjiid740-148} </p> </div> <a name="about"></a> <div class="section"><a name="changelog"></a> <h2>Journal des modifications</h2> Les entrées de la <a href="#">Fiche d’évaluation de messagerie sécurisée</a> ont été confirmées auprès des entreprises et des projets énumérés lors du lancement de la Scorecard le 11-06-2014. Des mises à jour seront effectuées si les participants ou autres nous informent de changements ou d’inexactitudes. Vous trouverez ci-dessous le journal de toutes les modifications : <ul style="font-size: 13.0080003738403px; line-height: 20.0063037872314px;"><li><strong style="line-height: 20.0063037872314px;">06-12-2015</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>Nous avons retiré Secret car ce service a <a href="https://medium.com/secret-den/sunset-bc18450478d5" title="Secret sunset">fermé </a> en mai 2015.</li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">06-03-2015</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>Nous avons crédité QQ pour avoir conduit un audit interne de sécurité indépendant (<span style="color: #008000;">✓</span>)<span style="line-height: 20.0063037872314px;">.</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">17-02-2015</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li>Nous avons crédité Telegram (mode secret et mode normal) pour avoir été soumis à un audit de code en février 2015 <span style="line-height: 20.0063037872314px;">(</span><span style="line-height: 20.0063037872314px; color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">).</span></li> </ul></li> <li><strong style="line-height: 20.0063037872314px;">29-01-2015</strong><span style="line-height: 20.0063037872314px;"> :</span> <ul><li><span style="line-height: 20.0063037872314px;">Nous avons crédité QQ pour le cryptage des messages en transit </span><span style="line-height: 20.0063037872314px;">(</span><span style="color: #008000;">✓</span><span style="line-height: 20.0063037872314px;">). Bien que QQ n'utilise pas de TLS/SSL, ce qui est considéré comme la meilleure pratique, ils ont mis en œuvre un protocole personnalisé pour le cryptage des messages en transit.</span></li> <li><span style="line-height: 20.0063037872314px;">Nous avons clarifié notre système de notation pour la confidentialité persistante (critère #4).</span></li> </ul></li> <li><strong style="line-height: 1.538em;">05-01-2015</strong><span style="line-height: 1.538em;"> :</span> <ul><li><span style="line-height: 1.538em;">Nous avons réparti le score de Telegram en deux rangées : conversations Telegram normales et conversations Telegram secrètes. Les conversations normales Telegram ne sont pas chiffrées de bout en bout afin que le fournisseur ne puisse pas les lire. (</span><span style="color: #ff0000;" data-mce-mark="1">✘</span><span style="line-height: 1.538em;">). Les conversations secrètes de Telegram le sont, et en outre Telgram </span><a href="https://core.telegram.org/api/pfs" title="Telegram perfect forward secrecy blog post" style="line-height: 1.538em;">prend désormais en charge la confidentialité persistante parfaite</a><span style="line-height: 1.538em;"> afin que les messages puissent être supprimés en toute sécurité (</span><span style="color: #008000;" data-mce-mark="1">✓</span><span style="line-height: 1.538em;">)</span></li>. <li><span style="line-height: 1.538em;">Wickr offre maintenant la possibilité de vérifier l'identité d’un contact en exposant les principales empreintes digitales, qui peuvent être vérifiées en local ou par l'intermédiaire de la bande vidéo. (</span><span style="line-height: 1.538em;">✓</span><span style="line-height: 1.538em;">)</span></li> </ul></li> </ul><ul><li><strong>14-11-2014</strong> : <ul><li>RIM nous a dit que BlackBerry Messenger Protected utilise une <a href="http://docs.blackberry.com/en/admin/deliverables/64972/BBM_Protected-Security_Note_en.pdf">phrase de chiffrement d’échange hors-bande</a> et <a href="https://en.wikipedia.org/wiki/SPEKE_(cryptography)">EC-SPEKE</a> pour effectuer la vérification d'identité. (✓) RIM nous a également dit que BBM Protected reçoit des révisions de sécurité par une équipe interne de sécurité. (✓)</li> <li>Viber a reçu un récent audit de sécurité externe de la part d’EY Advanced Security Center. (✓)</li> <li>Pidgin a recensé un certain nombre d’audits de procédures, y compris l'utilisation régulière des outils d'analyse statique et des audits par une équipe de Cisco Talos. Les développeurs de Pidgin ont été clairs qu'ils ne savent pas à quel point ces audits ont été complets et approfondis, mais ces audits <a href="https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit">satisfont néanmoins nos critères</a>. (✓) Bien que l'audit de Pidgin améliore la sécurité du projet connexe Adium (les projets partagent de nombreux composants y compris libpurple, libotr et libxml2), les développeurs d'Adium nous disent qu'à part l'analyse statique occasionnelle effectuée par les développeurs eux-mêmes, ils ne sont pas au courant d’un effort d’audit indépendant traitant le code spécifique d’Adium. Donc, pour le moment, ce projet ne recevra pas de coche pour un audit vérification.</li> </ul></li> <li><strong>10-11-2014</strong> : La coche de la case pour le chiffrement de bout à bout a été <a href="https://www.eff.org/deeplinks/2014/11/scorecard-update-we-cannot-credit-skype-end-end-encryption">retirée</a> pour Skype. (✘)</li> <li><strong>04-11-2014</strong> : L’application Snapchat a reçu un audit par une équipe interne de sécurité. (✓)</li> </ul></div>
