Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID42_*.xlf
Languages: fr

# 851][field_questions][11][answer
source: <a id="is_every_cookie_a_tracking_cookie"></a>No. Privacy Badger analyzes the cookies from each site; unique cookies that contain tracking IDs are disallowed, while "low entropy" cookies that perform other functions are allowed. For instance a cookie like LANG=fr that encodes the user's language preference, or a cookie that preserves a very small amount of information about ads the user has been shown, would be allowed provided that individual or small groups of users' reading habits could not be collected with them. We have a <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">very rough</a> implementation of this; pull requests are welcome.
fr: <a id="is_every_cookie_a_tracking_cookie"></a>Non. Le Badger de Confidentialité analyse les cookies provenant de chaque site. Les cookies uniques contenant des identifiants de pistage ne sont pas autorisés, alors que les cookies de « faible entropie » remplissant d'autres fonctions sont acceptés. Par exemple, un cookie comme LANG=fr qui encode votre langue de préférence, ou un cookie qui conserve très peu d'informations sur les publicités que l'utilisateur a vues, serait autorisé dans la mesure où les habitudes de navigation d'un individu ou de petits groupes d'utilisateurs ne pourraient pas être recueillis par eux. L'implémentation est actuellement <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/heuristicblocking.js#l482">assez approximative</a> ; les demandes de tirage (pull requests) sont les bienvenues.

# 851][field_questions][12][question
source: Does Privacy Badger account for a cookie that was used to track me even if I deleted it?
fr: Le Badger de Confidentialité prend-il en compte un cookie qui a été utilisé pour me pister même si je l'ai supprimé ?

# 851][field_questions][12][answer
source: <a id="what_about_deleted_cookies"></a>Yes. Privacy Badger keeps track of cookies that could be used to track you and where they came from, even if you frequently clear your browser's cookies.
fr: <a id="what_about_deleted_cookies"></a>Oui. Le Badger de Confidentialité tient un registre des cookies qui ont été utilisés pour vous pister ainsi que leur provenance, même si vous supprimez fréquemment les cookies de votre navigateur.

# 851][field_questions][13][question
source: Will you be supporting any other browsers besides Chrome / Firefox?
fr: D'autres navigateurs à part Chrome et Firefox seront-ils supportés ?

# 851][field_questions][13][answer
source: <a id="safari_and_ie"></a>In the near future we hope to release Privacy Badger for Opera, Safari, and Firefox Mobile. Unfortunately at the moment we cannot support Internet Explorer, since current version IE appears to be incompatible with how Privacy Badger works at a technical level. (With that said, if you would like to work on porting Privacy Badger to other platforms, please let us know!)
fr: <a id="safari_and_ie"></a>Dans un avenir proche, nous espérons pouvoir lancer le Badger de Confidentialité pour Opera, Safari et Firefox Mobile. Malheureusement, pour le moment, nous ne pouvons soutenir Internet Explorer, puisque la version actuelle d'IE semble être incompatible avec le fonctionnement du Badger de Confidentialité sur le plan technique. (Ceci dit, si vous souhaitez travailler sur le portage du Badger de Confidentialité sur d'autres plates-formes, faites-le nous savoir !).

# 851][field_questions][14][question
source: Can I download Privacy Badger outside of the Chrome Web Store?
fr: Puis-je télécharger le Badger de Confidentialité en dehors du Chrome Web Store ?

# 851][field_questions][14][answer
source: <a id="no_chrome_store"></a>You can! If you are using an alternative Chromium based browser such as Chromium ports Iron, Comodo Dragon, or Maxthon you can get the latest version of the addon directly from this link: <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>
fr: <a id="no_chrome_store"></a>En effet ! Si vous utilisez un navigateur basé sur Chromium, tel qu'Iron, Comodo Dragon ou Maxthon, vous pouvez obtenir la dernière version de l'extension directement à partir de ce lien : <a href="https://www.eff.org/files/privacy_badger-chrome.crx">https://www.eff.org/files/privacy_badger-chrome.crx</a>

# 851][field_questions][15][question
source: I am an online advertising / tracking company. How do I stop Privacy Badger from blocking me?
fr: Je suis une agence de publicité ou de pistage en ligne. Comment puis-je éviter d'être bloquée par le Badger de Confidentialité ?

# 851][field_questions][15][answer
source: <a id="how_to_comply_with_dnt"></a>One way is to stop tracking third party users who have turned on the Do Not Track header (i.e., stop collecting cookies, supercookies or fingerprints from them). That will work for new Privacy Badger installs. If copies of Privacy Badger have already blocked your domain, you can unblock yourself by promising to respect the Do Not Track header in a way that conforms with the user's privacy policy. You can do that by posting a specific compliant <a href="https://www.eff.org/dnt-policy" target="_blank">DNT policy</a> to the URL <tt>http<b>s</b>://example.com/.well-known/dnt-policy.txt</tt>, where "example.com" is all of your DNT-compliant domains. Note that the domain <i>must</i> support HTTPS, to protect against tampering by network attackers. The path contains ".well-known" per <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Privacy Badger currently checks for this specific <i>verbatim</i> policy document, though in the future Privacy Badger may allow content from sites that post different versions of a <a href="/dnt-policy">compliant DNT Policy</a>, and that there may be ways for users to specify their own acceptable DNT policies if they wish to.
fr: <a id="how_to_comply_with_dnt"></a>Une méthode consiste à arrêter le pistage des utilisateurs tiers qui ont activé l'en-tête Do Not Track (c.-à-d. à arrêter le pistage par cookies, supercookies ou empreintes digitales). Cela fonctionnera pour les nouvelles installations du Badger de Confidentialité. Si les copies de Badger de Confidentialité ont déjà bloqué votre site, vous pouvez vous débloquer vous-même en promettant de respecter l'en-tête Do Not Track d'une manière qui soit conforme à la politique de confidentialité de l'utilisateur. Vous pouvez faire cela en affichant une <a href="https://www.eff.org/dnt-policy" target="_blank">politique spécifique conforme au DNT</a> à l'URL <tt>http<b>s</b>://exemple.com/.well-known/dnt-policy.txt</tt>, où « exemple.com » est l'ensemble de vos domaines conformes au DNT. Notez que le domaine <i>doit</i> prendre en charge HTTPS, pour protéger contre la falsification par des attaques de réseau. Le chemin d'accès doit contenir le fichier ".well-known" tel qu'il est défini par <a href="https://tools.ietf.org/html/rfc5785">RFC 5785</a>. Le Badger de Confidentialité vérifie actuellement la présence de ce document spécifique <i>in extenso</i>, bien que dans l'avenir le Badger de Confidentialité pourrait autoriser le contenu provenant de sites qui publient des versions différentes d'une <a href="/dnt-policy">politique conforme au DNT</a>, et que les utilisateurs aient, s'ils le souhaitent, le moyen de spécifier leurs propres politiques DNT acceptables.

# 851][field_questions][16][question
source: What is the Privacy Badger license? Where is the Privacy Badger source code?
fr: Quelle est la licence du Badger de Confidentialité ? Où se trouve le code du projet ?

# 851][field_questions][16][answer
source: <a id="license"></a>Privacy Badger is GPLv3 code, the Chrome version is based on a modified version of the AdBlock Plus engine. You can find the Privacy Badger source trees <a href="https://github.com/EFForg/">on Github</a>. There is also a <a href="https://lists.eff.org/mailman/listinfo/privacybadger">development mailing list</a>. Privacy Badger is governed by EFF's <a href="/code/privacy">Privacy Policy for Software</a>. <a name="comparison"></a>
fr: <a id="license"></a>Le Badger de Confidentialité est sous licence GPLv3, la version de Chrome est basée sur une version modifiée du moteur AdBlock Plus. Vous pouvez trouver les arborescences du code source du Badger de Confidentialité <a href="https://github.com/EFForg/">sur Github</a>. Il y a aussi une <a href="https://lists.eff.org/mailman/listinfo/privacybadger">liste de diffusion pour les développeurs</a>. Le Badger de Confidentialité est régi par la <a href="/code/privacy">politique de confidentialité de l'EFF</a> concernant ses programmes logiciels.<a name="comparison"></a>

# 851][field_questions][17][question
source: I found a bug! What do I do now?
fr: J'ai trouvé un bogue ! Que dois-je faire maintenant ?

# 851][field_questions][17][answer
source: <a id="i_found_a_bug"></a>First, please make sure the bug hasn't already been reported by checking the current bug list <a href="https://github.com/EFForg/privacybadgerfirefox/issues">for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues">for Chrome</a>. If the bug hasn't yet been reported you can report the bug <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">here for Privacy Badger for Firefox</a> or <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">here for Privacy Badger for Chrome</a>. If you don't have a GitHub account, then you can login using the anonymous one: "cypherpunk"/"cypherpunk", but please understand that doing so will limit our ability to communicate with you about the bug and make it harder for us to fix it quickly.
fr: <a id="i_found_a_bug"></a>Tout d'abord, assurez-vous que le bogue n'a pas déjà été rapporté en vérifiant la liste de bogues <a href="https://github.com/EFForg/privacybadgerfirefox/issues">pour Firefox</a> ou <a href="https://github.com/EFForg/privacybadgerchrome/issues">pour Chrome</a>. Si le bogue n'a pas encore été signalé, vous pouvez le rapporter <a href="https://github.com/EFForg/privacybadgerfirefox/issues/new">ici s'il s'agit du Badger de Confidentialité pour Firefox</a> ou <a href="https://github.com/EFForg/privacybadgerchrome/issues/new">ici s'il s'agit du Badger de Confidentialité pour Chrome</a>. Si vous n'avez pas de compte GitHub, vous pouvez vous connecter à l'aide au compte anonyme: « cypherpunk » / « cypherpunk », mais veuillez comprendre que cela limitera notre capacité à communiquer avec vous au sujet du bogue et rendra sa correction plus difficile.

# 851][field_questions][18][question
source: How can I support Privacy Badger?
fr: Comment puis-je soutenir le Badger de Confidentialité ?

# 851][field_questions][18][answer
source: <a id="support"></a>Thanks for asking! Individual donations make up about half of EFF's support, which gives us the freedom to work on user-focused projects. If you want to support the development of Privacy Badger and other projects like it, helping build a more secure Internet ecosystem, you can <a href="https://supporters.eff.org/donate/support-privacy-badger">throw us a few dollars here</a>. Thank you. If you want to help with the code we appreciate that as well. Here are the lists of good volunteer tasks <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.
fr: <a id="support"></a>Merci de le demander ! Les dons individuels représentent environ la moitié du soutien de l'EFF, ce qui nous donne la liberté de travailler sur des projets axés sur l'utilisateur. Si vous souhaitez soutenir le développement du Badger de Confidentialité et d'autres projets similaires et contribuer à la construction d'un écosystème Web plus sûr, vous pouvez nous <a href="https://supporters.eff.org/donate/support-privacy-badger">envoyer un peu d'argent ici</a>. Merci. Si vous souhaitez contribuer du code, c'est également apprécié. Voici la liste des activités bénévoles pour la version <a href="https://github.com/EFForg/privacybadgerfirefox/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[firefox]</a> et <a href="https://github.com/EFForg/privacybadgerchrome/issues?q=is%3Aopen+is%3Aissue+label%3A%22Good+Volunteer+Task%22" target="_blank">[chrome]</a>.

# 851][field_questions][19][question
source: How does Privacy Badger handle social media widgets?
fr: Comment le Badger de Confidentialité traite-il les widgets de réseaux sociaux ?

# 851][field_questions][19][answer
source: <a id="social"></a>Social media widgets (such as the Facebook Like button, Twitter Tweet button, or Google +1 button) often track your reading habits. Even if you don't click them, the social media companies often see exactly which pages you're seeing the widget on. Privacy Badger includes a feature imported from the <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a> project which is able to replace the widgets with a stand-in version, so that you can still see and click them. You will not be tracked by these replacements unless you explicitly choose to click them. Privacy Badger currently knows how to replace the following widgets if they are observed tracking you: AddThis, Facebook, Google, LinkedIn, Pinterest, Stumbleupon, and Twitter. (The source code for these replacements is <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">here</a>; pull requests are welcome) Note that Privacy Badger will not replace social media widgets unless it has blocked the associated tracker. If you're seeing real social media widgets, it generally means that Privacy Badger hasn't detected tracking from that variant of the widget, or that the site you're looking at has implemented its own version of the widget. To avoid confusion, the replacement widgets are marked with the Privacy Badger badge next to the button. To interact with a replacement widget, simply click on it. Depending on the widget, Privacy Badger will either send you directly to the appropriate sharing page (for example, to post a tweet) or it will enable and load the real social widget (for example, the Facebook Like button, with personalized information about how many of your friends have "liked" the page). In the second case, you will still need to interact with the real widget to "like" or share the page. <a id="connection-failure"></a>
fr: <a id="social"></a>Les médias sociaux (par exemple, le bouton Facebook Like, Twitter Tweet ou Google +1) pistent souvent vos habitudes de lecture. Même si vous ne cliquez pas dessus, les sociétés de médias sociaux peuvent souvent voir exactement sur quelles pages leur widget s'affiche chez vous. Le Badger de Confidentialité inclut une fonction qui a été importée du projet <a href="http://sharemenot.cs.washington.edu/">ShareMeNot</a>, capable de remplacer les widgets par une version alternative, pour que vous puissiez continuer à les voir et cliquer dessus. Vous ne serez pas pistés par ces widgets alternatifs, sauf si vous choisissez explicitement de cliquer dessus. Le Badger de Confidentialité peut actuellement remplacer les widgets suivants, s'ils sont observés en train de vous pister : Twitter, Facebook, Google, LinkedIn, Pinterest, Stumbleupon et AddThis. (Le code source de ces remplacements est disponible <a href="https://github.com/EFForg/privacybadgerchrome/blob/master/src/socialwidgets.json">ici</a> ; les requêtes de tirage sont les bienvenues). Notez que le Badger de Confidentialité remplace les widgets de médias sociaux uniquement s'il a bloqué le tracker associé. Si vous voyez des widgets de médias sociaux réels, cela signifie en général que le Badger de Confidentialité n'a pas détecté de pistage pour cette variante du widget, ou que le site que vous regardez a mis en place sa propre version du widget. Pour éviter toute confusion, les widgets de remplacement portent le badge du Badger de Confidentialité en regard du bouton. Pour interagir avec un widget de remplacement, il suffit de cliquer dessus. Selon le widget, le Badger de Confidentialité vous enverra directement à la page de partage appropriée (par exemple, pour poster un tweet) ou il activera et chargera le widget social réel (par exemple, le bouton Facebook Like, contenant des informations personnalisées sur combien de vos amis ont "aimé" la page). Dans ce second cas, vous aurez toujours besoin d'interagir avec le widget réel pour faire « like » ou pour partager la page. <a id="connection-failure"></a>

# 851][field_questions][20][question
source: I'm having a problem installing the browser extension.
fr: J'ai un problème d'installation de l'extension du Badger de Confidentialité.

# 851][field_questions][20][answer
source: Some people report that installing Privacy Badger gives them the error: "The addon could not be downloaded because of a connection failure on www.eff.org." This may be caused by Avast antivirus, which blocks installation of browser extensions. You may be able to work around by right-clicking to download the .xpi file, then dragging it into Firefox to install. If that fails, you may temporarily disable Avast antivirus before installing the extension.
fr: Certains utilisateurs rapportent que l'installation du Badger de Confidentialité renvoie l'erreur : « The add-on could not be downloaded because of a connection failure on www.eff.org (l'extension n'a pas pu être téléchargée en raison d'un échec de connexion sur www.eff.org) ». Cela peut provenir de l'antivirus Avast, qui bloque l'installation des extensions de navigateur. Vous pouvez tenter de contourner ce souci en faisant un clic droit pour télécharger le fichier .xpi, puis en le faisant glisser dans Firefox pour l'installer. Si cela échoue, vous pouvez désactiver temporairement l'antivirus Avast avant d'installer l'extension.

# 851][field_questions][21][question
source: Is Privacy Badger compatible with other extensions, including other adblockers?
fr: Le Badger de Confidentialité est-il compatible avec d'autres extensions, y compris d'autres bloqueurs de pubs ?

# 851][field_questions][21][answer
source: Privacy Badger is compatible with most extensions. Whether it makes sense to run it with another adblocker varies. If you have customized your adblocker settings to block trackers as well, Privacy Badger may be partially redundant (though it may offer advantages like cookie blocking that other tracker blockers do not). However if you run extensions like Adlbock Plus or Ghostery in their default configurations, Privacy Badger can significantly increase your privacy online. (Adblock does not block invisible trackers by default, Ghostery does not block anything by default.) The only extensions known to be incompatible with Privacy Badger is the Avast anitvirus extension, which blocks the installation of Privacy Badger and other extensions. Last updated July 22nd, 2015
fr: Le Badger de Confidentialité est compatible avec la plupart des extensions. Son utilité en combinaison avec un autre bloqueur de pub varie selon les cas. Si vous avez personnalisé les paramètres de votre anti-pub pour bloquer également les trackers, le Badger de Confidentialité peut être en partie redondant (même s'il peut offrir des avantages comme le blocage de cookies, que d'autres bloqueurs de trackers ne proposent pas). Cependant, si vous exécutez des extensions comme Adlbock Plus ou Ghostery avec leurs configurations par défaut, le Badger de Confidentialité peut augmenter considérablement votre confidentialité en ligne (Adblock ne bloque pas les trackers invisibles par défaut, Ghostery ne bloque rien par défaut). La seule extension connue pour être incompatible avec le Badger de Confidentialité est l'extension d'Avast anitvirus qui bloque son installation ainsi que celle d'autres extensions. Mis à jour le 22 juillet 2015

# 851][title_field][0][value
source: Privacy Badger
fr: Badger de Confidentialité

# 852][field_text_field][0][value
source: A Project of the <a href="/">Electronic Frontier Foundation</a>
fr: Un projet de <a href="/">l'Electronic Frontier Foundation</a>

# 853][singular
source: Privacy Badger blocks spying ads and invisible trackers.
fr: Le Badger de Confidentialité bloque les pubs espion et les trackers invisibles

# 854][singular
source: Privacy Badger
fr: Badger de Confidentialité

# 855][singular
source: Install Privacy Badger
fr: Installez le Badger de Confidentialité

# 856][singular
source: Privacy Badger FAQ
fr: FAQ du Badger de Confidentialité

# 857][singular
source: and Enable Do Not Track
fr: et activez la fonction Ne pas me pister

# 858][singular
source: Click here for !browser version
fr: Cliquez ici pour la version !browser

# 861][singular
source: Download for Firefox
fr: Télécharger pour Firefox

# 862][singular
source: Download for Chrome
fr: Télécharger pour Chrome
