Repository: 4ndygu/www-l10n
Catalog: translations/*/JobID77_*.xlf
Languages: tr

# 1206][title_field][0][value
source: How to Deploy HTTPS Correctly
tr: HTTPS Doğru Bir Şekilde Nasıl Uygulanır
